// Class ShooterGame.BaseGameDataEventReceiver
// Size: 0x30 (Inherited: 0x30)
struct UBaseGameDataEventReceiver : UObject {
};

// Class ShooterGame.AbilityRechargeComponent
// Size: 0x108 (Inherited: 0xe8)
struct UAbilityRechargeComponent : UActorComponent {
	int32_t MaxCharges; // 0xe8(0x04)
	char pad_EC[0x4]; // 0xec(0x04)
	struct FMulticastInlineDelegate AuthOnAbilityRecharged; // 0xf0(0x10)
	int32_t CurrentCharges; // 0x100(0x04)
	char pad_104[0x4]; // 0x104(0x04)

	void OnRep_CurrentCharges(); // Function ShooterGame.AbilityRechargeComponent.OnRep_CurrentCharges // (Final|Native|Private) // @ game+0x3803ed0
	int32_t GetCurrentCharges(); // Function ShooterGame.AbilityRechargeComponent.GetCurrentCharges // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x3803160
	void AuthSetMaxCharges(int32_t NumMaxCharges); // Function ShooterGame.AbilityRechargeComponent.AuthSetMaxCharges // (Final|BlueprintAuthorityOnly|Native|Public|BlueprintCallable) // @ game+0x3802860
	void AuthResetCharges(); // Function ShooterGame.AbilityRechargeComponent.AuthResetCharges // (BlueprintAuthorityOnly|Native|Public|BlueprintCallable) // @ game+0x38028f0
};

// Class ShooterGame.AbilityRechargeCooldownComponent
// Size: 0x130 (Inherited: 0xe8)
struct UAbilityRechargeCooldownComponent : UActorComponent {
	struct FMulticastInlineDelegate OnClientCooldownStateChanged; // 0xe8(0x10)
	struct UEquipmentChargeComponent* EquipmentChargeComponent; // 0xf8(0x08)
	char pad_100[0x10]; // 0x100(0x10)
	float CooldownSeconds; // 0x110(0x04)
	float TempChargeCooldownSeconds; // 0x114(0x04)
	char pad_118[0x8]; // 0x118(0x08)
	float CooldownFinishTimestamp; // 0x120(0x04)
	float TempChargeCooldownFinishTimestamp; // 0x124(0x04)
	int32_t ChargesInUse; // 0x128(0x04)
	bool bCooldownPaused; // 0x12c(0x01)
	char pad_12D[0x3]; // 0x12d(0x03)

	void SetNumberOfChargesInUse(int32_t NewChargesInUse); // Function ShooterGame.AbilityRechargeCooldownComponent.SetNumberOfChargesInUse // (Final|Native|Public|BlueprintCallable) // @ game+0x3803fa0
	void SetCooldownPaused(bool Paused); // Function ShooterGame.AbilityRechargeCooldownComponent.SetCooldownPaused // (Final|Native|Public|BlueprintCallable) // @ game+0x3803f10
	void OnGamePhaseChanged(enum class EAresGamePhase NewGamePhase, int32_t RoundNumberEnded); // Function ShooterGame.AbilityRechargeCooldownComponent.OnGamePhaseChanged // (Native|Event|Public|BlueprintEvent) // @ game+0x3803df0
	void OnChargesChanged(struct UResourceComponent* ResourceComponent); // Function ShooterGame.AbilityRechargeCooldownComponent.OnChargesChanged // (Final|Native|Private) // @ game+0x3803d60
	void OnChargeConsumed(struct UResourceComponent* ResourceComponent, int32_t UnitsConsumed); // Function ShooterGame.AbilityRechargeCooldownComponent.OnChargeConsumed // (Final|Native|Private) // @ game+0x3803c90
	void OnCharacterRespawn(struct AShooterCharacter* Character); // Function ShooterGame.AbilityRechargeCooldownComponent.OnCharacterRespawn // (Native|Event|Public|BlueprintEvent) // @ game+0x3803c00
	void MulticastUpdateCooldownValues(float ServerWorldTime, float NewCooldownFinishTimestamp, float NewTempChargeCooldownFinishTimestamp, int32_t NewChargesInUse, bool bNewCooldownPaused); // Function ShooterGame.AbilityRechargeCooldownComponent.MulticastUpdateCooldownValues // (Final|Net|NetReliableNative|Event|NetMulticast|Private) // @ game+0x3803a40
	bool IsInTempChargeCooldown(); // Function ShooterGame.AbilityRechargeCooldownComponent.IsInTempChargeCooldown // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x3803980
	bool IsInCooldown(); // Function ShooterGame.AbilityRechargeCooldownComponent.IsInCooldown // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x3803950
	bool IsCooldownPaused(); // Function ShooterGame.AbilityRechargeCooldownComponent.IsCooldownPaused // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x3803920
	float GetTempChargeCooldownSeconds(); // Function ShooterGame.AbilityRechargeCooldownComponent.GetTempChargeCooldownSeconds // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x38033e0
	float GetTempChargeCooldownRemainingSeconds(); // Function ShooterGame.AbilityRechargeCooldownComponent.GetTempChargeCooldownRemainingSeconds // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x38033b0
	float GetTempChargeCooldownFinishTimestamp(); // Function ShooterGame.AbilityRechargeCooldownComponent.GetTempChargeCooldownFinishTimestamp // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x3803380
	int32_t GetNumberOfChargesInUse(); // Function ShooterGame.AbilityRechargeCooldownComponent.GetNumberOfChargesInUse // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x3803330
	float GetCooldownSeconds(); // Function ShooterGame.AbilityRechargeCooldownComponent.GetCooldownSeconds // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x3803130
	float GetCooldownRemainingSeconds(); // Function ShooterGame.AbilityRechargeCooldownComponent.GetCooldownRemainingSeconds // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x3803100
	float GetCooldownFinishTimestamp(); // Function ShooterGame.AbilityRechargeCooldownComponent.GetCooldownFinishTimestamp // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x38030d0
	void ConfigureCooldown(struct FAgentAbilityCooldown AbilityConfig); // Function ShooterGame.AbilityRechargeCooldownComponent.ConfigureCooldown // (Native|Event|Public|BlueprintEvent) // @ game+0x3802e10
	void ClientUpdateCooldownValues(float ServerWorldTime, float NewCooldownFinishTimestamp, float NewTempChargeCooldownFinishTimestamp, int32_t NewChargesInUse, bool bNewCooldownPaused); // Function ShooterGame.AbilityRechargeCooldownComponent.ClientUpdateCooldownValues // (Final|Net|NetReliableNative|Event|Private|NetClient) // @ game+0x3802c50
	void ClientInitialize(struct FAgentAbilityCooldown AbilityConfig); // Function ShooterGame.AbilityRechargeCooldownComponent.ClientInitialize // (Final|Net|NetReliableNative|Event|Private|NetClient) // @ game+0x3802b20
	void ClearAllChargesInUse(); // Function ShooterGame.AbilityRechargeCooldownComponent.ClearAllChargesInUse // (Final|Native|Public|BlueprintCallable) // @ game+0x3802b00
	void AuthUpdateCooldownValuesForClients(); // Function ShooterGame.AbilityRechargeCooldownComponent.AuthUpdateCooldownValuesForClients // (Final|Net|NetReliableNative|Event|Private|NetServer) // @ game+0x38028f0
	void AuthStartTempChargeCooldown(); // Function ShooterGame.AbilityRechargeCooldownComponent.AuthStartTempChargeCooldown // (Final|BlueprintAuthorityOnly|Native|Public|BlueprintCallable) // @ game+0x38029a0
	void AuthStartCooldown(float CooldownPercentCredit); // Function ShooterGame.AbilityRechargeCooldownComponent.AuthStartCooldown // (Final|BlueprintAuthorityOnly|Native|Public|BlueprintCallable) // @ game+0x3802920
	void AuthReclaimInUseCharge(struct UEquippableEventBase* Event); // Function ShooterGame.AbilityRechargeCooldownComponent.AuthReclaimInUseCharge // (BlueprintAuthorityOnly|Native|Event|Public|BlueprintEvent) // @ game+0x38027d0
	void AuthInUseAbilityUsed(struct UEquippableEventBase* Event); // Function ShooterGame.AbilityRechargeCooldownComponent.AuthInUseAbilityUsed // (BlueprintAuthorityOnly|Native|Event|Public|BlueprintEvent) // @ game+0x3802620
	void AuthInUseAbilitySubobjectDestroyed(struct UEquippableEventBase* Event); // Function ShooterGame.AbilityRechargeCooldownComponent.AuthInUseAbilitySubobjectDestroyed // (BlueprintAuthorityOnly|Native|Event|Public|BlueprintEvent) // @ game+0x3802590
	void AuthInitialize(struct FAgentAbilityCooldown AbilityConfig); // Function ShooterGame.AbilityRechargeCooldownComponent.AuthInitialize // (Final|BlueprintAuthorityOnly|Native|Public|BlueprintCallable) // @ game+0x38026b0
	void AuthFreeUpInUseCharge(bool bChargeRecalled); // Function ShooterGame.AbilityRechargeCooldownComponent.AuthFreeUpInUseCharge // (Final|BlueprintAuthorityOnly|Native|Public|BlueprintCallable) // @ game+0x3802470
	void AuthClearAllCooldownTimers(); // Function ShooterGame.AbilityRechargeCooldownComponent.AuthClearAllCooldownTimers // (Final|BlueprintAuthorityOnly|Native|Public|BlueprintCallable) // @ game+0x2118460
};

// Class ShooterGame.ResourceComponent
// Size: 0x138 (Inherited: 0xe8)
struct UResourceComponent : UActorComponent {
	struct FMulticastInlineDelegate OnResourceChanged; // 0xe8(0x10)
	struct FMulticastInlineDelegate OnResourceConsumed; // 0xf8(0x10)
	struct FMulticastInlineDelegate OnPreResourceConsumed; // 0x108(0x10)
	char pad_118[0x4]; // 0x118(0x04)
	int32_t PredictedResourceAmount; // 0x11c(0x04)
	int32_t AuthResourceAmount; // 0x120(0x04)
	char pad_124[0x4]; // 0x124(0x04)
	struct UValueDisagreementTimer* ClientPredictedValueDisagreementTimer; // 0x128(0x08)
	struct UValueDisagreementTimer* CurrentStateDisagreementTimerClassOverride; // 0x130(0x08)

	int32_t Replenish(int32_t Units); // Function ShooterGame.ResourceComponent.Replenish // (Native|Public|BlueprintCallable) // @ game+0x3cd6bc0
	void OnRep_AuthResourceAmount(); // Function ShooterGame.ResourceComponent.OnRep_AuthResourceAmount // (Final|Native|Private) // @ game+0x3cd69d0
	void NotifyResourceChanged(); // Function ShooterGame.ResourceComponent.NotifyResourceChanged // (Native|Public|BlueprintCallable) // @ game+0x3cd68f0
	bool IsEmpty(); // Function ShooterGame.ResourceComponent.IsEmpty // (Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x39c4050
	int32_t GetMaxUnitsConsumable(); // Function ShooterGame.ResourceComponent.GetMaxUnitsConsumable // (Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x3b407f0
	int32_t GetDisplayChargeCount(); // Function ShooterGame.ResourceComponent.GetDisplayChargeCount // (Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x3cd6300
	bool Consume(int32_t Units); // Function ShooterGame.ResourceComponent.Consume // (Native|Public|BlueprintCallable) // @ game+0x3cd6170
	bool CanConsume(int32_t Units); // Function ShooterGame.ResourceComponent.CanConsume // (Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x3cd5f80
};

// Class ShooterGame.AbilityResourceComponent
// Size: 0x158 (Inherited: 0x138)
struct UAbilityResourceComponent : UResourceComponent {
	struct UPurchasedItemComponent* PurchasedItemComponent; // 0x138(0x08)
	struct UTexture* ShopImage; // 0x140(0x08)
	int32_t PipCost; // 0x148(0x04)
	int32_t ChargesToGrantOnPipCast; // 0x14c(0x04)
	char pad_150[0x8]; // 0x150(0x08)

	bool UsePipCasting(); // Function ShooterGame.AbilityResourceComponent.UsePipCasting // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x3804030
	bool HasPipsToCast(); // Function ShooterGame.AbilityResourceComponent.HasPipsToCast // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x38038f0
	void HandlePipResourceChanged(struct UResourceComponent* ResourceComponent); // Function ShooterGame.AbilityResourceComponent.HandlePipResourceChanged // (Final|Native|Protected) // @ game+0x3803860
	void HandlePipCastingGameRuleChanged(enum class EGameRuleBoolName GameRule, bool Enabled); // Function ShooterGame.AbilityResourceComponent.HandlePipCastingGameRuleChanged // (Final|Native|Protected) // @ game+0x3803790
	void HandleOwningShooterPlayerStateChanged(struct AShooterPlayerState* NewValue); // Function ShooterGame.AbilityResourceComponent.HandleOwningShooterPlayerStateChanged // (Final|Native|Protected) // @ game+0x3803700
	void HandleOwningShooterCharacterChanged(struct AAresItem* Item, struct AActor* PrevOwner, struct AActor* NewOwner); // Function ShooterGame.AbilityResourceComponent.HandleOwningShooterCharacterChanged // (Final|Native|Protected) // @ game+0x38035f0
	void HandleOwningEquippableOwnerChanged(struct AAresItem* Item, struct AActor* PrevOwner, struct AActor* NewOwner); // Function ShooterGame.AbilityResourceComponent.HandleOwningEquippableOwnerChanged // (Native|Protected) // @ game+0x38034e0
	int32_t GetPipCost(); // Function ShooterGame.AbilityResourceComponent.GetPipCost // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x3803360
	int32_t GetMaxUnitsConsumableWithResource(); // Function ShooterGame.AbilityResourceComponent.GetMaxUnitsConsumableWithResource // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x3803300
	int32_t GetMaxUnitsConsumableWithPips(); // Function ShooterGame.AbilityResourceComponent.GetMaxUnitsConsumableWithPips // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x38032d0
	int32_t GetChargesToGrantOnPipCast(); // Function ShooterGame.AbilityResourceComponent.GetChargesToGrantOnPipCast // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x38030b0
	bool ConsumeWithResource(int32_t Units); // Function ShooterGame.AbilityResourceComponent.ConsumeWithResource // (Final|Native|Public|BlueprintCallable) // @ game+0x3803010
	bool ConsumeWithPips(int32_t Units); // Function ShooterGame.AbilityResourceComponent.ConsumeWithPips // (Final|Native|Public|BlueprintCallable) // @ game+0x3802f70
	bool CanConsumeWithResource(int32_t Units); // Function ShooterGame.AbilityResourceComponent.CanConsumeWithResource // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x3802a60
	bool CanConsumeWithPips(int32_t Units); // Function ShooterGame.AbilityResourceComponent.CanConsumeWithPips // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x38029c0
};

// Class ShooterGame.AbilityStatisticsDelegateComponent
// Size: 0xf8 (Inherited: 0xe8)
struct UAbilityStatisticsDelegateComponent : UActorComponent {
	int32_t AuthCastIndex; // 0xe8(0x04)
	char pad_EC[0x4]; // 0xec(0x04)
	struct UGameStatisticsComponent* AuthGameStatisticsComponent; // 0xf0(0x08)

	struct UGameStatisticsComponent* LocateGameStatisticsComponent(struct AActor* CauserActor); // Function ShooterGame.AbilityStatisticsDelegateComponent.LocateGameStatisticsComponent // (Final|Native|Static|Private) // @ game+0x38039b0
	struct UGameStatisticsComponent* GetGameStatisticsComponentForCauser(struct AActor* CauserActor, int32_t& CastIndex); // Function ShooterGame.AbilityStatisticsDelegateComponent.GetGameStatisticsComponentForCauser // (Final|BlueprintAuthorityOnly|Native|Static|Public|HasOutParms|BlueprintCallable|BlueprintPure) // @ game+0x38031c0
	void AuthHandleSubActorBegunPlay(struct AActor* Actor); // Function ShooterGame.AbilityStatisticsDelegateComponent.AuthHandleSubActorBegunPlay // (Final|Native|Private) // @ game+0x3802500
	int32_t AuthFindCastIndexForActor(struct AActor* LookupActor); // Function ShooterGame.AbilityStatisticsDelegateComponent.AuthFindCastIndexForActor // (Final|BlueprintAuthorityOnly|Native|Static|Public|BlueprintCallable) // @ game+0x38023e0
	struct UGameStatisticsComponent* AuthCastAbilityForCauser(struct AActor* CauserActor, struct FVector AbilityLocation, int32_t& CastIndex); // Function ShooterGame.AbilityStatisticsDelegateComponent.AuthCastAbilityForCauser // (Final|BlueprintAuthorityOnly|Native|Static|Public|HasOutParms|HasDefaults|BlueprintCallable) // @ game+0x38021a0
};

// Class ShooterGame.AbilityTrackingComponent
// Size: 0x138 (Inherited: 0xe8)
struct UAbilityTrackingComponent : UActorComponent {
	struct TSet<struct AActor*> TrackedSubobjects; // 0xe8(0x50)

	struct TSet<struct AActor*> GetTrackedSubobjects(); // Function ShooterGame.AbilityTrackingComponent.GetTrackedSubobjects // (Final|Native|Public|BlueprintCallable) // @ game+0x3803410
};

// Class ShooterGame.AbilityTrackingDelegateComponent
// Size: 0xf0 (Inherited: 0xe8)
struct UAbilityTrackingDelegateComponent : UActorComponent {
	struct UAbilityTrackingComponent* AbilityTrackingComponent; // 0xe8(0x08)
};

// Class ShooterGame.AbilityUpgradeComponent
// Size: 0x120 (Inherited: 0xe8)
struct UAbilityUpgradeComponent : UActorComponent {
	struct TArray<int32_t> RankCost; // 0xe8(0x10)
	enum class EUpgradeCostType CostType; // 0xf8(0x01)
	char pad_F9[0x7]; // 0xf9(0x07)
	struct UTexture* ShopImage; // 0x100(0x08)
	struct FMulticastInlineDelegate OnRankChanged; // 0x108(0x10)
	int32_t CurrentRank; // 0x118(0x04)
	char pad_11C[0x4]; // 0x11c(0x04)

	void OnRep_CurrentRank(); // Function ShooterGame.AbilityUpgradeComponent.OnRep_CurrentRank // (Final|Native|Protected) // @ game+0x3803ef0
	int32_t GetMaxRank(); // Function ShooterGame.AbilityUpgradeComponent.GetMaxRank // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x38032a0
	int32_t GetCurrentRank(); // Function ShooterGame.AbilityUpgradeComponent.GetCurrentRank // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x3803190
	void CheckUltimateHighWaterMark(int32_t TotalAcquiredUltPoints); // Function ShooterGame.AbilityUpgradeComponent.CheckUltimateHighWaterMark // (Final|Native|Private) // @ game+0x3802860
	void AuthEquippableOwnerChanged(struct AAresItem* Item, struct AActor* PrevOwner, struct AActor* NewOwner); // Function ShooterGame.AbilityUpgradeComponent.AuthEquippableOwnerChanged // (Final|Native|Private) // @ game+0x38022d0
};

// Class ShooterGame.BasePowderedToast
// Size: 0xb0 (Inherited: 0x30)
struct UBasePowderedToast : UObject {
	struct FGameplayTag Channel; // 0x30(0x0c)
	struct FGameplayTag MagnitudeTag; // 0x3c(0x0c)
	char pad_48[0x8]; // 0x48(0x08)
	float UnlockMagnitude; // 0x50(0x04)
	char pad_54[0x3c]; // 0x54(0x3c)
	struct FGameplayTagContainer RequiredDescriptors; // 0x90(0x20)

	void OnPlayerControllerReadyForSubscribe(struct APawn* Pawn, struct AController* Controller); // Function ShooterGame.BasePowderedToast.OnPlayerControllerReadyForSubscribe // (Final|Native|Private) // @ game+0x39bde90
};

// Class ShooterGame.AbilityUseAchievement
// Size: 0xb0 (Inherited: 0xb0)
struct UAbilityUseAchievement : UBasePowderedToast {
};

// Class ShooterGame.Accolade
// Size: 0x3c8 (Inherited: 0x3b8)
struct AAccolade : AActor {
	struct AShooterPlayerState* OwningPlayer; // 0x3b8(0x08)
	int32_t Progress; // 0x3c0(0x04)
	char pad_3C4[0x4]; // 0x3c4(0x04)

	int32_t ConsumeProgress(); // Function ShooterGame.Accolade.ConsumeProgress // (Final|Native|Public) // @ game+0x3802f40
	void AuthRecordProgress(int32_t Amount); // Function ShooterGame.Accolade.AuthRecordProgress // (Final|Native|Public|BlueprintCallable) // @ game+0x3802860
	void AuthAssignPlayer(struct AShooterPlayerState* Player); // Function ShooterGame.Accolade.AuthAssignPlayer // (Final|Native|Public) // @ game+0x3802110
};

// Class ShooterGame.AccoladeComponent
// Size: 0xe8 (Inherited: 0xe8)
struct UAccoladeComponent : UActorComponent {
};

// Class ShooterGame.AccoladeDebugComponent
// Size: 0x118 (Inherited: 0xe8)
struct UAccoladeDebugComponent : UActorComponent {
	struct UAccoladeManagerComponent* AccoladeManagerComponent; // 0xe8(0x08)
	struct TArray<struct FAccoladeProgressEntry> AccoladeProgressEntries; // 0xf0(0x10)
	char pad_100[0x18]; // 0x100(0x18)

	void ServerShowPlayerAccolades(struct AShooterPlayerState* PlayerState); // Function ShooterGame.AccoladeDebugComponent.ServerShowPlayerAccolades // (Net|NetReliableNative|Event|Protected|NetServer) // @ game+0x29e8ae0
};

// Class ShooterGame.AccoladeManagerComponent
// Size: 0x200 (Inherited: 0xe8)
struct UAccoladeManagerComponent : UActorComponent {
	char pad_E8[0x70]; // 0xe8(0x70)
	struct UCharacterDataAsset* CurrentCharacter; // 0x158(0x08)
	struct TMap<struct TSoftClassPtr<UObject>, struct AAccolade*> SpawnedAccolades; // 0x160(0x50)
	struct TMap<struct TSoftClassPtr<UObject>, struct UAccoladeDataAsset*> AccoladeActorClassToDataAsset; // 0x1b0(0x50)

	void AuthSpawnAccolades(); // Function ShooterGame.AccoladeManagerComponent.AuthSpawnAccolades // (Final|Native|Protected) // @ game+0x2118460
	void AuthSetupOrTeardown(); // Function ShooterGame.AccoladeManagerComponent.AuthSetupOrTeardown // (Final|Native|Protected) // @ game+0x2118460
	void AuthHandleCharacterSwap(struct UCharacterDataAsset* NewCharacter); // Function ShooterGame.AccoladeManagerComponent.AuthHandleCharacterSwap // (Final|Native|Protected) // @ game+0x3802110
};

// Class ShooterGame.AccountXPBlueprintLibrary
// Size: 0x30 (Inherited: 0x30)
struct UAccountXPBlueprintLibrary : UBlueprintFunctionLibrary {

	bool AccountXPMatchViewData_Equals(struct FAccountXPMatchViewData& A, struct FAccountXPMatchViewData& B); // Function ShooterGame.AccountXPBlueprintLibrary.AccountXPMatchViewData_Equals // (Final|Native|Static|Private|HasOutParms|BlueprintCallable|BlueprintPure) // @ game+0x380aea0
};

// Class ShooterGame.InitSystem
// Size: 0x80 (Inherited: 0x30)
struct UInitSystem : UObject {
	struct TSet<struct UInitSystem*> Dependencies; // 0x30(0x50)
};

// Class ShooterGame.AccountXPManager
// Size: 0x108 (Inherited: 0x80)
struct UAccountXPManager : UInitSystem {
	struct FMulticastInlineDelegate OnAccountXPPlayerUpdated; // 0x80(0x10)
	struct UConfigManager* ConfigManager; // 0x90(0x08)
	struct URSOManager* RSOManager; // 0x98(0x08)
	struct UContentIndex* ContentIndex; // 0xa0(0x08)
	struct URMSManager* RMSManager; // 0xa8(0x08)
	struct UAccountXPService* AccountXPService; // 0xb0(0x08)
	struct UAccountXPViewModel* ViewModel; // 0xb8(0x08)
	int32_t LevelCheatOverride; // 0xc0(0x04)
	char pad_C4[0x44]; // 0xc4(0x44)

	void TriggerRefreshPlayer(); // Function ShooterGame.AccountXPManager.TriggerRefreshPlayer // (Final|Native|Private|BlueprintCallable) // @ game+0x380d0f0
	void SetAccountLevelCheat(int32_t Level); // Function ShooterGame.AccountXPManager.SetAccountLevelCheat // (Final|Native|Public) // @ game+0x3802860
	bool IsEnabled(); // Function ShooterGame.AccountXPManager.IsEnabled // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x380c710
	int32_t GetWinOfTheDayAP(); // Function ShooterGame.AccountXPManager.GetWinOfTheDayAP // (Final|Native|Public|BlueprintCallable|BlueprintPure) // @ game+0x380c3c0
	struct UAccountXPViewModel* GetViewModel(); // Function ShooterGame.AccountXPManager.GetViewModel // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x380c3a0
	int32_t GetLevelMaxXP(); // Function ShooterGame.AccountXPManager.GetLevelMaxXP // (Final|Native|Public|BlueprintCallable|BlueprintPure) // @ game+0x380bfe0
	struct UAccountXPManager* GET(struct UWorld* FromWorld); // Function ShooterGame.AccountXPManager.GET // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x380b8d0
};

// Class ShooterGame.AccountXPService
// Size: 0x38 (Inherited: 0x30)
struct UAccountXPService : UObject {
	struct UConfigManager* ConfigManager; // 0x30(0x08)
};

// Class ShooterGame.AccountXPViewModel
// Size: 0x90 (Inherited: 0x30)
struct UAccountXPViewModel : UObject {
	struct FMulticastInlineDelegate OnAccountXPLevelChanged; // 0x30(0x10)
	struct FMulticastInlineDelegate OnAccountXPXPChanged; // 0x40(0x10)
	struct FMulticastInlineDelegate OnNextTimeFirstWinAvailableChanged; // 0x50(0x10)
	struct FMulticastInlineDelegate OnHistoryChanged; // 0x60(0x10)
	int32_t Level; // 0x70(0x04)
	int32_t XP; // 0x74(0x04)
	struct FDateTime NextTimeFirstWinAvailable; // 0x78(0x08)
	struct TArray<struct FAccountXPMatch> History; // 0x80(0x10)

	int32_t GetXP(); // Function ShooterGame.AccountXPViewModel.GetXP // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x380c3f0
	enum class EAccountXPXPSourceID GetSourceEnum(struct FString StringSource); // Function ShooterGame.AccountXPViewModel.GetSourceEnum // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x380c2e0
	struct FAccountXPMatch GetMatch(struct FGuid matchID); // Function ShooterGame.AccountXPViewModel.GetMatch // (Final|Native|Public|HasDefaults|BlueprintCallable) // @ game+0x380c010
	int32_t GetLevel(); // Function ShooterGame.AccountXPViewModel.GetLevel // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x2c02250
	float GetCollectiveMultiplier(struct TArray<struct FAccountXPXPMultiplier> Multipliers); // Function ShooterGame.AccountXPViewModel.GetCollectiveMultiplier // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x380b9f0
	void AddMatch(struct FAccountXPMatch& Match); // Function ShooterGame.AccountXPViewModel.AddMatch // (Final|Native|Public|HasOutParms) // @ game+0x380b1c0
};

// Class ShooterGame.AchievementDebugVisualizer
// Size: 0x3b8 (Inherited: 0x3b8)
struct AAchievementDebugVisualizer : AActor {
};

// Class ShooterGame.AchievementsAdapter
// Size: 0xc0 (Inherited: 0x30)
struct UAchievementsAdapter : UObject {
	char pad_30[0x38]; // 0x30(0x38)
	struct TMap<struct TSoftClassPtr<UObject>, struct UPowderedToastDataAsset*> AchievementClassToDataAsset; // 0x68(0x50)
	char pad_B8[0x8]; // 0xb8(0x08)
};

// Class ShooterGame.AchievementsAdapterInterface
// Size: 0x30 (Inherited: 0x30)
struct UAchievementsAdapterInterface : UInterface {
};

// Class ShooterGame.AchievementsAdapterNoOp
// Size: 0x38 (Inherited: 0x30)
struct UAchievementsAdapterNoOp : UObject {
	char pad_30[0x8]; // 0x30(0x08)
};

// Class ShooterGame.AchievementsManagerSubsystem
// Size: 0x90 (Inherited: 0x38)
struct UAchievementsManagerSubsystem : UGameInstanceSubsystem {
	struct TScriptInterface<IAchievementsAdapterInterface> AchievementsAdapter; // 0x38(0x10)
	struct TArray<struct UBasePowderedToast*> AchievementList; // 0x48(0x10)
	char pad_58[0x8]; // 0x58(0x08)
	struct TWeakObjectPtr<struct AActor> AchievementDebugVisualizer; // 0x60(0x08)
	char pad_68[0x28]; // 0x68(0x28)

	void OnQueryAchievementsComplete(bool bWasSuccessful); // Function ShooterGame.AchievementsManagerSubsystem.OnQueryAchievementsComplete // (Final|Native|Private) // @ game+0x380c9b0
	void OnQueryAchievementAssetLoadingComplete(bool bWasSuccessful); // Function ShooterGame.AchievementsManagerSubsystem.OnQueryAchievementAssetLoadingComplete // (Final|Native|Private) // @ game+0x380c920
	void OnLocalPlayerConnectionStatusChanged(struct AAresPlayerStateBase* PlayerState, enum class EConnectionStatus OldStatus, enum class EConnectionStatus NewStatus); // Function ShooterGame.AchievementsManagerSubsystem.OnLocalPlayerConnectionStatusChanged // (Final|Native|Private) // @ game+0x380c810
	void OnGamePhaseChanged(enum class EAresGamePhase NewGamePhase, int32_t RoundNumber); // Function ShooterGame.AchievementsManagerSubsystem.OnGamePhaseChanged // (Final|Native|Private) // @ game+0x380c740
};

// Class ShooterGame.ActionTraits
// Size: 0xe0 (Inherited: 0x30)
struct UActionTraits : UObject {
	struct FName ActionName; // 0x30(0x0c)
	char pad_3C[0x4]; // 0x3c(0x04)
	struct FText ActionDisplayName; // 0x40(0x18)
	struct FText ActionDescription; // 0x58(0x18)
	enum class EActionSettingsContext SettingsContext; // 0x70(0x01)
	enum class EActionBindRestrictions BindRestriction; // 0x71(0x01)
	char pad_72[0x6]; // 0x72(0x06)
	struct TArray<struct FName> SharedInputCategories; // 0x78(0x10)
	float HoldStartThreshold; // 0x88(0x04)
	float DoubleTapThreshold; // 0x8c(0x04)
	struct TMap<enum class EActionChordKeyType, enum class EActionChordTapHoldType> TapHoldDefaults; // 0x90(0x50)
};

// Class ShooterGame.DefaultActionTraits
// Size: 0xe0 (Inherited: 0xe0)
struct UDefaultActionTraits : UActionTraits {
};

// Class ShooterGame.GamepadPresetDataAsset
// Size: 0x158 (Inherited: 0x38)
struct UGamepadPresetDataAsset : UDataAsset {
	struct FText PresetMapName; // 0x38(0x18)
	struct FText PresetMapDescription; // 0x50(0x18)
	struct TMap<struct FName, struct FActionChord> KeyMappings; // 0x68(0x50)
	struct TMap<enum class EAresBoolSettingName, bool> BoolSettingPresetOverrides; // 0xb8(0x50)
	struct TMap<enum class EAresIntSettingName, int32_t> IntSettingPresetOverrides; // 0x108(0x50)
};

// Class ShooterGame.GamepadPresetListAsset
// Size: 0x48 (Inherited: 0x38)
struct UGamepadPresetListAsset : UDataAsset {
	struct TArray<struct UGamepadPresetDataAsset*> KeyMappings; // 0x38(0x10)
};

// Class ShooterGame.ActionBindingsManager
// Size: 0x3e0 (Inherited: 0x80)
struct UActionBindingsManager : UInitSystem {
	struct FMulticastInlineDelegate ActionBindingChanged; // 0x80(0x10)
	struct TMap<struct FActionBindSetIdentifier, struct UActionBindSet*> actions; // 0x90(0x50)
	struct UActionTraitsManager* ActionTraitsManager; // 0xe0(0x08)
	struct UPlayerSettingsTelemetry* PlayerSettingsTelemetry; // 0xe8(0x08)
	struct UContentIndex* ContentIndex; // 0xf0(0x08)
	char pad_F8[0x58]; // 0xf8(0x58)
	struct FMulticastInlineDelegate OnConflictStatesUpdated; // 0x150(0x10)
	struct FMulticastInlineDelegate OnBindingsSwapped; // 0x160(0x10)
	char pad_170[0x258]; // 0x170(0x258)
	struct FMulticastInlineDelegate OnPresetUpdated; // 0x3c8(0x10)
	struct UDependencyBindingManager* DependencyBindingManager; // 0x3d8(0x08)

	void UpdateContextConflictStates(enum class EActionSettingsContext Context, struct FName Character); // Function ShooterGame.ActionBindingsManager.UpdateContextConflictStates // (Final|Native|Public|BlueprintCallable) // @ game+0x380d770
	void UpdateAllConflictStates(); // Function ShooterGame.ActionBindingsManager.UpdateAllConflictStates // (Final|Native|Public|BlueprintCallable) // @ game+0x380d750
	bool TryGetActionHoldTime(struct FName ActionName, float& OutHoldTime); // Function ShooterGame.ActionBindingsManager.TryGetActionHoldTime // (Final|Native|Public|HasOutParms|BlueprintCallable) // @ game+0x380d650
	struct UActionBindSet* TryGetActionBindSet(struct FName ActionName, enum class EActionBindSetAxisDirection AxisDirection); // Function ShooterGame.ActionBindingsManager.TryGetActionBindSet // (Final|Native|Public|BlueprintCallable) // @ game+0x380d110
	bool TryGetActionBindingV2(struct FName ActionName, enum class EActionBindSetAxisDirection AxisDirection, int32_t BindIndex, struct FActionChord& OutInput, bool bFallbackToNextBindIndex); // Function ShooterGame.ActionBindingsManager.TryGetActionBindingV2 // (Final|Native|Public|HasOutParms|BlueprintCallable) // @ game+0x380d450
	bool TryGetActionBinding(struct FName ActionName, enum class EActionBindSetAxisDirection AxisDirection, int32_t BindIndex, struct FInputChord& OutInput, bool bFallbackToNextBindIndex); // Function ShooterGame.ActionBindingsManager.TryGetActionBinding // (Final|Native|Public|HasOutParms|BlueprintCallable) // @ game+0x380d210
	void SwapConflictingKeys(struct TArray<enum class EActionSettingsContext> Contexts, struct FName Character, struct FKey& ReferenceKey, struct UActionBindSet* SourceActionBindSet); // Function ShooterGame.ActionBindingsManager.SwapConflictingKeys // (Final|Native|Public|HasOutParms|BlueprintCallable) // @ game+0x380ced0
	void SetPresetIndexForCharacter(struct FName Character, int32_t PresetIndex); // Function ShooterGame.ActionBindingsManager.SetPresetIndexForCharacter // (Final|Native|Public) // @ game+0x380cdf0
	void ResetGamepadMappings(struct FName CharacterName); // Function ShooterGame.ActionBindingsManager.ResetGamepadMappings // (Final|Native|Public|BlueprintCallable) // @ game+0x380cd50
	void ResetCustomBaseLayer(enum class EActionBindResetType ResetType); // Function ShooterGame.ActionBindingsManager.ResetCustomBaseLayer // (Final|Native|Public|BlueprintCallable) // @ game+0x380ccd0
	void ResetAllCharacterSpecificBindings(enum class EActionBindResetType ResetType); // Function ShooterGame.ActionBindingsManager.ResetAllCharacterSpecificBindings // (Final|Native|Public|BlueprintCallable) // @ game+0x380cc50
	void ResetAllBindingsForCharacter(struct FName CharacterName, enum class EActionBindResetType ResetType); // Function ShooterGame.ActionBindingsManager.ResetAllBindingsForCharacter // (Final|Native|Public|BlueprintCallable) // @ game+0x380cb60
	void ResetAllBindings(enum class EActionBindResetType ResetType); // Function ShooterGame.ActionBindingsManager.ResetAllBindings // (Final|Native|Public|BlueprintCallable) // @ game+0x380cae0
	void RemovePresetForCharacter(struct FName Character); // Function ShooterGame.ActionBindingsManager.RemovePresetForCharacter // (Final|Native|Public) // @ game+0x380ca40
	bool IsCharacterLayerAllowed(); // Function ShooterGame.ActionBindingsManager.IsCharacterLayerAllowed // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x380c6e0
	bool HasPendingCustomBaseBindings(); // Function ShooterGame.ActionBindingsManager.HasPendingCustomBaseBindings // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x380c6b0
	bool HasPendingBindingsForCharacter(struct FName Character); // Function ShooterGame.ActionBindingsManager.HasPendingBindingsForCharacter // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x380c600
	bool HasPendingBindingsForAnyCharacter(); // Function ShooterGame.ActionBindingsManager.HasPendingBindingsForAnyCharacter // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x380c5d0
	bool HasAnyPendingBindings(); // Function ShooterGame.ActionBindingsManager.HasAnyPendingBindings // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x380c5a0
	void HandleActionBindingChanged(struct UActionBindSet* ActionBindSet, int32_t BindIndex, enum class EActionBindChangeSource ChangeSource, struct FName Character); // Function ShooterGame.ActionBindingsManager.HandleActionBindingChanged // (Final|Native|Protected) // @ game+0x380c420
	int32_t GetPresetIndexForCharacter(struct FName Character); // Function ShooterGame.ActionBindingsManager.GetPresetIndexForCharacter // (Final|Native|Public) // @ game+0x380c230
	bool GetGamepadBindingV2(struct FName ActionName, struct FActionChord& OutActionChord, int32_t GamepadBindIndex); // Function ShooterGame.ActionBindingsManager.GetGamepadBindingV2 // (Final|Native|Public|HasOutParms|BlueprintCallable) // @ game+0x380be50
	bool GetGamepadBinding(struct FName ActionName, struct FInputChord& OutInputChord, int32_t GamepadBindIndex); // Function ShooterGame.ActionBindingsManager.GetGamepadBinding // (Final|Native|Public|HasOutParms|BlueprintCallable) // @ game+0x380bca0
	void GetConflictsForCharacter(struct FName Character, struct TArray<struct FConflictList>& OutConflicts); // Function ShooterGame.ActionBindingsManager.GetConflictsForCharacter // (Final|Native|Public|HasOutParms|BlueprintCallable|BlueprintPure|Const) // @ game+0x380bb70
	struct UActionBindingsManager* GetActionBindingsManager(struct UObject* WorldContextObject); // Function ShooterGame.ActionBindingsManager.GetActionBindingsManager // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x380b960
	bool DoesCharacterProfileExist(struct FName Character); // Function ShooterGame.ActionBindingsManager.DoesCharacterProfileExist // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x380b820
	void DeleteCharacterProfile(struct FName Character); // Function ShooterGame.ActionBindingsManager.DeleteCharacterProfile // (Final|Native|Public|BlueprintCallable) // @ game+0x380b780
	void DeleteAllCharacterProfiles(); // Function ShooterGame.ActionBindingsManager.DeleteAllCharacterProfiles // (Final|Native|Public|BlueprintCallable) // @ game+0x380b760
	void CopyCustomBaseToCharacterProfile(struct FName Character); // Function ShooterGame.ActionBindingsManager.CopyCustomBaseToCharacterProfile // (Final|Native|Public|BlueprintCallable) // @ game+0x380b6c0
	void CopyCustomBaseToAllCharacterProfiles(); // Function ShooterGame.ActionBindingsManager.CopyCustomBaseToAllCharacterProfiles // (Final|Native|Public|BlueprintCallable) // @ game+0x380b6a0
	bool CharacterHasNonDefaultPreset(struct FName Character); // Function ShooterGame.ActionBindingsManager.CharacterHasNonDefaultPreset // (Final|Native|Public) // @ game+0x380b5f0
	void BuildGamepadParentChildDependencies(struct FName CharacterName); // Function ShooterGame.ActionBindingsManager.BuildGamepadParentChildDependencies // (Final|Native|Protected) // @ game+0x380b550
	void ApplyPendingCustomBaseBindings(); // Function ShooterGame.ActionBindingsManager.ApplyPendingCustomBaseBindings // (Final|Native|Public|BlueprintCallable) // @ game+0x380b530
	void ApplyPendingBindingsForCharacter(struct FName Character); // Function ShooterGame.ActionBindingsManager.ApplyPendingBindingsForCharacter // (Final|Native|Public|BlueprintCallable) // @ game+0x380b490
	void ApplyGamepadPreset(struct UGamepadPresetDataAsset* Data, struct FName CharacterName, int32_t PresetIndex, struct UGamepadPresetDataAsset* PreviousData); // Function ShooterGame.ActionBindingsManager.ApplyGamepadPreset // (Final|Native|Public|BlueprintCallable) // @ game+0x380b310
	void ApplyAllPendingCharacterBindings(); // Function ShooterGame.ActionBindingsManager.ApplyAllPendingCharacterBindings // (Final|Native|Public|BlueprintCallable) // @ game+0x380b2f0
	void ApplyAllPendingBindings(); // Function ShooterGame.ActionBindingsManager.ApplyAllPendingBindings // (Final|Native|Public|BlueprintCallable) // @ game+0x380b2d0
	void AddCharacterProfile(struct FName Character, int32_t PresetIndex, bool bCopyFromCustomBase); // Function ShooterGame.ActionBindingsManager.AddCharacterProfile // (Final|Native|Public|BlueprintCallable) // @ game+0x380b090
};

// Class ShooterGame.ActionBindSet
// Size: 0x238 (Inherited: 0x30)
struct UActionBindSet : UObject {
	struct FMulticastInlineDelegate ActionBindingChanged; // 0x30(0x10)
	struct FMulticastInlineDelegate ActionBindConflictStateUpdated; // 0x40(0x10)
	char pad_50[0xb0]; // 0x50(0xb0)
	struct UActionTraits* Traits; // 0x100(0x08)
	struct UActionBindingsManager* ActionBindingsManager; // 0x108(0x08)
	struct UPlayerSettingsTelemetry* PlayerSettingsTelemetry; // 0x110(0x08)
	char pad_118[0x120]; // 0x118(0x120)

	void SetTapHoldTypeForAllCharacterBindings(int32_t BindIndex, enum class EActionChordTapHoldType NewTapHoldType, enum class EActionBindPendingMode PendingMode, enum class EActionBindChangeSource ChangeSource); // Function ShooterGame.ActionBindSet.SetTapHoldTypeForAllCharacterBindings // (Final|Native|Public|BlueprintCallable) // @ game+0x38168a0
	void SetBindingAtDefaultLayerV2(int32_t BindIndex, struct FActionChord& Key); // Function ShooterGame.ActionBindSet.SetBindingAtDefaultLayerV2 // (Final|Native|Public|HasOutParms) // @ game+0x3816780
	void SetBindingAtDefaultLayer(int32_t BindIndex, struct FInputChord& Key); // Function ShooterGame.ActionBindSet.SetBindingAtDefaultLayer // (Final|Native|Public|HasOutParms) // @ game+0x3816630
	void SetBindingAtCustomBaseLayerV2(int32_t BindIndex, struct FActionChord& Key, enum class EActionBindPendingMode PendingMode, enum class EActionBindChangeSource ChangeSource); // Function ShooterGame.ActionBindSet.SetBindingAtCustomBaseLayerV2 // (Final|Native|Public|HasOutParms|BlueprintCallable) // @ game+0x3816470
	void SetBindingAtCustomBaseLayer(int32_t BindIndex, struct FInputChord& Key, enum class EActionBindPendingMode PendingMode, enum class EActionBindChangeSource ChangeSource); // Function ShooterGame.ActionBindSet.SetBindingAtCustomBaseLayer // (Final|Native|Public|HasOutParms|BlueprintCallable) // @ game+0x3816290
	void SetBindingAtCharacterLayerV2(int32_t BindIndex, struct FActionChord& Key, struct FName Character, enum class EActionBindPendingMode PendingMode, enum class EActionBindChangeSource ChangeSource); // Function ShooterGame.ActionBindSet.SetBindingAtCharacterLayerV2 // (Final|Native|Public|HasOutParms|BlueprintCallable) // @ game+0x3816090
	void SetBindingAtCharacterLayer(int32_t BindIndex, struct FInputChord& Key, struct FName Character, enum class EActionBindPendingMode PendingMode, enum class EActionBindChangeSource ChangeSource); // Function ShooterGame.ActionBindSet.SetBindingAtCharacterLayer // (Final|Native|Public|HasOutParms|BlueprintCallable) // @ game+0x3815e50
	void ResetCustomBaseLayer(enum class EActionBindResetType ResetType); // Function ShooterGame.ActionBindSet.ResetCustomBaseLayer // (Final|Native|Public|BlueprintCallable) // @ game+0x3815dd0
	void ResetBinding(enum class EActionBindSetUserLayer LayerID, int32_t BindIndex, enum class EActionBindPendingMode PendingMode, struct FName CharacterPage); // Function ShooterGame.ActionBindSet.ResetBinding // (Final|Native|Protected|BlueprintCallable) // @ game+0x3815c50
	void ResetAllCharacterSpecificBindings(enum class EActionBindResetType ResetType); // Function ShooterGame.ActionBindSet.ResetAllCharacterSpecificBindings // (Final|Native|Public|BlueprintCallable) // @ game+0x3815bd0
	void ResetAllBindingsForCharacter(struct FName CharacterName, enum class EActionBindResetType ResetType); // Function ShooterGame.ActionBindSet.ResetAllBindingsForCharacter // (Final|Native|Public|BlueprintCallable) // @ game+0x3815ae0
	void ResetAllBindings(enum class EActionBindResetType ResetType); // Function ShooterGame.ActionBindSet.ResetAllBindings // (Final|Native|Public|BlueprintCallable) // @ game+0x3815a60
	void RemoveBindingAtCustomBaseLayer(int32_t BindIndex, enum class EActionBindPendingMode PendingMode, enum class EActionBindChangeSource ChangeSource); // Function ShooterGame.ActionBindSet.RemoveBindingAtCustomBaseLayer // (Final|Native|Public|BlueprintCallable) // @ game+0x3815950
	void RemoveBindingAtCharacterLayer(int32_t BindIndex, struct FName Character, enum class EActionBindPendingMode PendingMode, enum class EActionBindChangeSource ChangeSource); // Function ShooterGame.ActionBindSet.RemoveBindingAtCharacterLayer // (Final|Native|Public|BlueprintCallable) // @ game+0x38157d0
	bool IsAxisAction(); // Function ShooterGame.ActionBindSet.IsAxisAction // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x38157a0
	bool HasPendingCustomBaseBindingsAtIndex(int32_t BindIndex); // Function ShooterGame.ActionBindSet.HasPendingCustomBaseBindingsAtIndex // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x3815700
	bool HasPendingCustomBaseBindings(); // Function ShooterGame.ActionBindSet.HasPendingCustomBaseBindings // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x38156d0
	bool HasPendingBindingsForCharacterAtIndex(int32_t BindIndex, struct FName Character); // Function ShooterGame.ActionBindSet.HasPendingBindingsForCharacterAtIndex // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x38155e0
	bool HasPendingBindingsForCharacter(struct FName Character); // Function ShooterGame.ActionBindSet.HasPendingBindingsForCharacter // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x3815530
	bool HasPendingBindingsForAnyCharacterAtIndex(int32_t BindIndex); // Function ShooterGame.ActionBindSet.HasPendingBindingsForAnyCharacterAtIndex // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x3815490
	bool HasPendingBindingsForAnyCharacter(); // Function ShooterGame.ActionBindSet.HasPendingBindingsForAnyCharacter // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x3815460
	bool HasConflictForAnyCharacter(int32_t BindIndex); // Function ShooterGame.ActionBindSet.HasConflictForAnyCharacter // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x38153c0
	bool HasConflict(struct FName Character, int32_t BindIndex); // Function ShooterGame.ActionBindSet.HasConflict // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x38152d0
	bool HasAnyPendingBindingsAtIndex(int32_t BindIndex); // Function ShooterGame.ActionBindSet.HasAnyPendingBindingsAtIndex // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x3815230
	bool HasAnyPendingBindings(); // Function ShooterGame.ActionBindSet.HasAnyPendingBindings // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x3815200
	bool HasAnyBindingsOnLayer(enum class EActionBindSetUserLayer LayerID, enum class EActionBindPendingMode PendingMode, struct FName CharacterName); // Function ShooterGame.ActionBindSet.HasAnyBindingsOnLayer // (Final|Native|Public|BlueprintCallable) // @ game+0x38150d0
	struct FActionChord GetFunctionalBindingV2(int32_t BindIndex, enum class EActionBindPendingMode PendingMode, enum class EActionBindSetUserLayer& OutFoundLayer); // Function ShooterGame.ActionBindSet.GetFunctionalBindingV2 // (Final|Native|Public|HasOutParms|BlueprintCallable|BlueprintPure|Const) // @ game+0x3814f40
	struct FInputChord GetFunctionalBinding(int32_t BindIndex, enum class EActionBindPendingMode PendingMode, enum class EActionBindSetUserLayer& OutFoundLayer); // Function ShooterGame.ActionBindSet.GetFunctionalBinding // (Final|Native|Public|HasOutParms|BlueprintCallable|BlueprintPure|Const) // @ game+0x3814d70
	struct FActionChord GetBindingV2(int32_t BindIndex, enum class EActionBindPendingMode PendingMode, enum class EActionBindSetUserLayer& OutFoundLayer, bool bTryGetLocalCharacterBinding); // Function ShooterGame.ActionBindSet.GetBindingV2 // (Final|Native|Public|HasOutParms|BlueprintCallable|BlueprintPure|Const) // @ game+0x3814b90
	struct FActionChord GetBindingForCharacterV2(int32_t BindIndex, struct FName Character, enum class EActionBindPendingMode PendingMode, enum class EActionBindSetUserLayer& OutFoundLayer); // Function ShooterGame.ActionBindSet.GetBindingForCharacterV2 // (Final|Native|Public|HasOutParms|BlueprintCallable|BlueprintPure|Const) // @ game+0x38149c0
	struct FInputChord GetBindingForCharacter(int32_t BindIndex, struct FName Character, enum class EActionBindPendingMode PendingMode, enum class EActionBindSetUserLayer& OutFoundLayer); // Function ShooterGame.ActionBindSet.GetBindingForCharacter // (Final|Native|Public|HasOutParms|BlueprintCallable|BlueprintPure|Const) // @ game+0x38147c0
	struct FActionChord GetBindingAtLayerV2(enum class EActionBindSetUserLayer StartLayer, int32_t BindIndex, struct FName Character, enum class EActionBindPendingMode PendingMode, enum class EActionBindSetUserLayer& OutFoundLayer); // Function ShooterGame.ActionBindSet.GetBindingAtLayerV2 // (Final|Native|Public|HasOutParms|BlueprintCallable|BlueprintPure|Const) // @ game+0x38145b0
	struct FInputChord GetBindingAtLayer(enum class EActionBindSetUserLayer StartLayer, int32_t BindIndex, struct FName Character, enum class EActionBindPendingMode PendingMode, enum class EActionBindSetUserLayer& OutFoundLayer); // Function ShooterGame.ActionBindSet.GetBindingAtLayer // (Final|Native|Public|HasOutParms|BlueprintCallable|BlueprintPure|Const) // @ game+0x3814370
	struct FActionChord GetBindingAtDefaultLayerV2(int32_t BindIndex); // Function ShooterGame.ActionBindSet.GetBindingAtDefaultLayerV2 // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x3814290
	struct FInputChord GetBindingAtDefaultLayer(int32_t BindIndex); // Function ShooterGame.ActionBindSet.GetBindingAtDefaultLayer // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x3814170
	struct FActionChord GetBindingAtCustomBaseLayerV2(int32_t BindIndex, enum class EActionBindPendingMode PendingMode, enum class EActionBindSetUserLayer& OutFoundLayer); // Function ShooterGame.ActionBindSet.GetBindingAtCustomBaseLayerV2 // (Final|Native|Public|HasOutParms|BlueprintCallable|BlueprintPure|Const) // @ game+0x3813fe0
	struct FInputChord GetBindingAtCustomBaseLayer(int32_t BindIndex, enum class EActionBindPendingMode PendingMode, enum class EActionBindSetUserLayer& OutFoundLayer); // Function ShooterGame.ActionBindSet.GetBindingAtCustomBaseLayer // (Final|Native|Public|HasOutParms|BlueprintCallable|BlueprintPure|Const) // @ game+0x3813e10
	struct FActionChord GetBindingAtCharacterLayerV2(int32_t BindIndex, struct FName Character, enum class EActionBindPendingMode PendingMode, enum class EActionBindSetUserLayer& OutFoundLayer); // Function ShooterGame.ActionBindSet.GetBindingAtCharacterLayerV2 // (Final|Native|Public|HasOutParms|BlueprintCallable|BlueprintPure|Const) // @ game+0x3813c40
	struct FInputChord GetBindingAtCharacterLayer(int32_t BindIndex, struct FName Character, enum class EActionBindPendingMode PendingMode, enum class EActionBindSetUserLayer& OutFoundLayer); // Function ShooterGame.ActionBindSet.GetBindingAtCharacterLayer // (Final|Native|Public|HasOutParms|BlueprintCallable|BlueprintPure|Const) // @ game+0x3813a40
	struct FInputChord GetBinding(int32_t BindIndex, enum class EActionBindPendingMode PendingMode, enum class EActionBindSetUserLayer& OutFoundLayer, bool bTryGetLocalCharacterBinding); // Function ShooterGame.ActionBindSet.GetBinding // (Final|Native|Public|HasOutParms|BlueprintCallable|BlueprintPure|Const) // @ game+0x3813820
	enum class EActionBindSetAxisDirection GetAxisDirection(); // Function ShooterGame.ActionBindSet.GetAxisDirection // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x38137f0
	struct FName GetActionName(); // Function ShooterGame.ActionBindSet.GetActionName // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x38137b0
	bool AreBindRestrictionsMetAtCustomBaseLayer(); // Function ShooterGame.ActionBindSet.AreBindRestrictionsMetAtCustomBaseLayer // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x3813780
	void ApplyPendingCustomBaseBindings(); // Function ShooterGame.ActionBindSet.ApplyPendingCustomBaseBindings // (Final|Native|Public|BlueprintCallable) // @ game+0x3813760
	void ApplyPendingBindingsForCharacter(struct FName Character); // Function ShooterGame.ActionBindSet.ApplyPendingBindingsForCharacter // (Final|Native|Public|BlueprintCallable) // @ game+0x38136c0
	void ApplyAllPendingCharacterBindings(); // Function ShooterGame.ActionBindSet.ApplyAllPendingCharacterBindings // (Final|Native|Public|BlueprintCallable) // @ game+0x38136a0
	void ApplyAllPendingBindings(); // Function ShooterGame.ActionBindSet.ApplyAllPendingBindings // (Final|Native|Public|BlueprintCallable) // @ game+0x3813680
};

// Class ShooterGame.ActionTraitsManager
// Size: 0x90 (Inherited: 0x30)
struct UActionTraitsManager : UObject {
	struct TArray<struct UActionTraits*> ActionTraitClasses; // 0x30(0x10)
	char pad_40[0x50]; // 0x40(0x50)

	struct UActionTraits* TryGetActionTraits(struct FName ActionName); // Function ShooterGame.ActionTraitsManager.TryGetActionTraits // (Final|Native|Public|BlueprintCallable) // @ game+0x3816a00
};

// Class ShooterGame.AresViewModelBase
// Size: 0x48 (Inherited: 0x30)
struct UAresViewModelBase : UObject {
	struct FMulticastInlineDelegate OnHasValidDataChanged; // 0x30(0x10)
	bool bHasValidData; // 0x40(0x01)
	char pad_41[0x7]; // 0x41(0x07)

	void SetHasValidData(bool HasValidData); // Function ShooterGame.AresViewModelBase.SetHasValidData // (Final|Native|Protected|BlueprintCallable) // @ game+0x399c060
	void Reset(); // Function ShooterGame.AresViewModelBase.Reset // (Native|Event|Public|BlueprintCallable|BlueprintEvent) // @ game+0x399aeb0
	void RefreshBroadcast(); // Function ShooterGame.AresViewModelBase.RefreshBroadcast // (Native|Event|Public|BlueprintCallable|BlueprintEvent) // @ game+0x399bde0
	void OnViewModelCreated(); // Function ShooterGame.AresViewModelBase.OnViewModelCreated // (Native|Event|Protected|BlueprintEvent) // @ game+0x2543100
	struct UAresViewModelBase* MakeViewModel(struct UAresViewModelBase* ViewModelClass, struct UObject* Owner); // Function ShooterGame.AresViewModelBase.MakeViewModel // (Final|Native|Static|Public|BlueprintCallable) // @ game+0x399bb10
	bool HasValidData(); // Function ShooterGame.AresViewModelBase.HasValidData // (Final|Native|Public|BlueprintCallable|BlueprintPure) // @ game+0x399ae90
	struct APlayerController* GetOwningPlayer(); // Function ShooterGame.AresViewModelBase.GetOwningPlayer // (Final|Native|Protected|BlueprintCallable|BlueprintPure|Const) // @ game+0x399b070
	bool BP_HasValidData(); // Function ShooterGame.AresViewModelBase.BP_HasValidData // (Final|Native|Public|BlueprintCallable) // @ game+0x399ae90
};

// Class ShooterGame.ActiveContractsViewModel
// Size: 0x88 (Inherited: 0x48)
struct UActiveContractsViewModel : UAresViewModelBase {
	struct FMulticastInlineDelegate OnActiveBattlepassContractChanged; // 0x48(0x10)
	struct FMulticastInlineDelegate OnActiveEventpassContractChanged; // 0x58(0x10)
	struct UContractViewModel* ActiveBattlepassContract; // 0x68(0x08)
	struct UContractViewModel* ActiveEventpassContract; // 0x70(0x08)
	char pad_78[0x10]; // 0x78(0x10)

	void UpdateActiveEventpassContractWrapper(struct UContractViewModel* Contract); // Function ShooterGame.ActiveContractsViewModel.UpdateActiveEventpassContractWrapper // (Final|Native|Protected|BlueprintCallable) // @ game+0x381c850
	void UpdateActiveEventpassContract(); // Function ShooterGame.ActiveContractsViewModel.UpdateActiveEventpassContract // (Final|Native|Protected|BlueprintCallable) // @ game+0x381c830
	void SetActiveEventpassContract(struct UContractViewModel* NewActiveEventpassContract); // Function ShooterGame.ActiveContractsViewModel.SetActiveEventpassContract // (Final|Native|Protected|BlueprintCallable) // @ game+0x381c3f0
	void SetActiveBattlepassContract(struct UContractViewModel* NewActiveBattlepassContract); // Function ShooterGame.ActiveContractsViewModel.SetActiveBattlepassContract // (Final|Native|Protected|BlueprintCallable) // @ game+0x381c360
	void NavigateToEventpassScreen(); // Function ShooterGame.ActiveContractsViewModel.NavigateToEventpassScreen // (Final|Native|Protected|BlueprintCallable) // @ game+0x381c130
	void NavigateToBattlepassScreen(struct FWildcard FocusFreeRewards); // Function ShooterGame.ActiveContractsViewModel.NavigateToBattlepassScreen // (Final|Native|Protected|BlueprintCallable) // @ game+0x381c000
	void Init(); // Function ShooterGame.ActiveContractsViewModel.Init // (Final|Native|Public|BlueprintCallable) // @ game+0x381bfb0
	struct UContractViewModel* GetActiveEventpassContract(); // Function ShooterGame.ActiveContractsViewModel.GetActiveEventpassContract // (Final|Native|Protected|BlueprintCallable|BlueprintPure) // @ game+0x381ba00
	struct UContractViewModel* GetActiveBattlepassContract(); // Function ShooterGame.ActiveContractsViewModel.GetActiveBattlepassContract // (Final|Native|Protected|BlueprintCallable|BlueprintPure) // @ game+0x381b9e0
	void BindContractModelEvents(bool Bind); // Function ShooterGame.ActiveContractsViewModel.BindContractModelEvents // (Final|Native|Public|BlueprintCallable) // @ game+0x381b930
};

// Class ShooterGame.ActorCaptureComponent2D
// Size: 0xa10 (Inherited: 0xa00)
struct UActorCaptureComponent2D : USceneCaptureComponent2D {
	struct USceneComponent* RootComponent; // 0xa00(0x08)
	char pad_A08[0x8]; // 0xa08(0x08)

	void SetRootComponent(struct USceneComponent* Component); // Function ShooterGame.ActorCaptureComponent2D.SetRootComponent // (Final|Native|Public|BlueprintCallable) // @ game+0x381c6d0
	void RemoveComponentFromCapture(struct USceneComponent* AffectedComponent); // Function ShooterGame.ActorCaptureComponent2D.RemoveComponentFromCapture // (Final|Native|Protected) // @ game+0x381c2d0
	void HandleComponentTreeChanged(struct USceneComponent* AffectedComponent, bool bAttached); // Function ShooterGame.ActorCaptureComponent2D.HandleComponentTreeChanged // (Final|Native|Protected) // @ game+0x381bea0
	void AddComponentToCapture(struct USceneComponent* AffectedComponent); // Function ShooterGame.ActorCaptureComponent2D.AddComponentToCapture // (Final|Native|Protected) // @ game+0x381b810
};

// Class ShooterGame.StateComponent
// Size: 0xf8 (Inherited: 0xe8)
struct UStateComponent : UActorComponent {
	bool bAutoAddToStateMachine; // 0xe8(0x01)
	char pad_E9[0x7]; // 0xe9(0x07)
	struct UStateMachineComponent* OwningStateMachineComponent; // 0xf0(0x08)

	bool IsCurrentState(); // Function ShooterGame.StateComponent.IsCurrentState // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x3e1a560
	void CheckStateMachine(struct AActor* Owner); // Function ShooterGame.StateComponent.CheckStateMachine // (Final|Native|Private) // @ game+0x3802110
};

// Class ShooterGame.EquippableStateComponent
// Size: 0x1f0 (Inherited: 0xf8)
struct UEquippableStateComponent : UStateComponent {
	bool bEquippableUsedState; // 0xf8(0x01)
	bool bRequiresTick; // 0xf9(0x01)
	bool bRequiresReplication; // 0xfa(0x01)
	char pad_FB[0x5]; // 0xfb(0x05)
	struct FItemSlotBlocking EquipBlocking; // 0x100(0x18)
	struct FItemSlotBlocking ActivationInputBlocking; // 0x118(0x18)
	enum class EStateBehaviorOnUnequip UnequipBehavior; // 0x130(0x01)
	enum class EStateBehaviorOnUnpossess UnpossessBehavior; // 0x131(0x01)
	char pad_132[0x6]; // 0x132(0x06)
	struct UStateComponent* UnpossessState; // 0x138(0x08)
	struct UValueDisagreementTimer* ClientPredictedValueDisagreementTimerClassOverride; // 0x140(0x08)
	struct UValueDisagreementTimer* ClientPredictedValueDisagreementTimer; // 0x148(0x08)
	bool bOverrideFogOfWarWhileInState; // 0x150(0x01)
	char pad_151[0x3]; // 0x151(0x03)
	float FogOfWarAudibleDistance; // 0x154(0x04)
	float FogOfWarOutroTime; // 0x158(0x04)
	float FogOfWarMaxStateDuration; // 0x15c(0x04)
	bool bIsNotClientPredicted; // 0x160(0x01)
	char pad_161[0x8f]; // 0x161(0x8f)

	enum class EReplacementStateType ShouldUseReplacementState(); // Function ShooterGame.EquippableStateComponent.ShouldUseReplacementState // (Native|Event|Public|BlueprintEvent|Const) // @ game+0x3abe860
	bool ShouldUseFirstPersonPerspective(); // Function ShooterGame.EquippableStateComponent.ShouldUseFirstPersonPerspective // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x3abe830
	void SetUnpossessState(struct UStateComponent* State); // Function ShooterGame.EquippableStateComponent.SetUnpossessState // (Final|Native|Protected|BlueprintCallable) // @ game+0x3abe7a0
	void SetReplacementState(struct UScriptStateComponent* ReplacementState, enum class EReplacementStateType ReplacementCondition); // Function ShooterGame.EquippableStateComponent.SetReplacementState // (Final|Native|Public|BlueprintCallable) // @ game+0x3abe510
	struct UScriptStateComponent* GetReplacementState(enum class EReplacementStateType ReplacementType); // Function ShooterGame.EquippableStateComponent.GetReplacementState // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x3abda60
	struct AShooterPlayerController* GetOwningShooterPlayerController(); // Function ShooterGame.EquippableStateComponent.GetOwningShooterPlayerController // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x3abda30
	struct AShooterCharacter* GetOwningShooterCharacter(); // Function ShooterGame.EquippableStateComponent.GetOwningShooterCharacter // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x3abda00
	struct UEquippableStateMachineComponent* GetOwningEquippableStateMachineComponent(); // Function ShooterGame.EquippableStateComponent.GetOwningEquippableStateMachineComponent // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x3abd9d0
	struct AAresEquippable* GetOwningEquippable(); // Function ShooterGame.EquippableStateComponent.GetOwningEquippable // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x3abd9a0
	struct ACharacter* GetOwningCharacter(); // Function ShooterGame.EquippableStateComponent.GetOwningCharacter // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x3abd970
	struct AAresPlayerController* GetOwningAresPlayerController(); // Function ShooterGame.EquippableStateComponent.GetOwningAresPlayerController // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x3abd940
	void AuthSetOverrideFogOfWarWhileInState(bool bNewOverrideFogOfWarWhileInState); // Function ShooterGame.EquippableStateComponent.AuthSetOverrideFogOfWarWhileInState // (Final|BlueprintAuthorityOnly|Native|Public|BlueprintCallable) // @ game+0x3802470
};

// Class ShooterGame.ScriptStateComponent
// Size: 0x2f8 (Inherited: 0x1f0)
struct UScriptStateComponent : UEquippableStateComponent {
	char pad_1F0[0x8]; // 0x1f0(0x08)
	struct TArray<struct FEquippableStateBuffInfo> StateBuffs; // 0x1f8(0x10)
	struct FMulticastInlineDelegate OnStateEnter; // 0x208(0x10)
	struct FMulticastInlineDelegate OnStateExit; // 0x218(0x10)
	struct FMulticastInlineDelegate OnStateTick; // 0x228(0x10)
	struct TArray<struct FScriptStateEffectInfo> StateEffects; // 0x238(0x10)
	struct TArray<struct FMultiStateEffectRequest> MultiStateEffects; // 0x248(0x10)
	struct UStateComponent* ScriptNextState; // 0x258(0x08)
	struct UStateComponent* ScriptSuppressedState; // 0x260(0x08)
	struct UStateComponent* ScriptDisarmedState; // 0x268(0x08)
	struct TWeakObjectPtr<struct UObject> CustomContext; // 0x270(0x08)
	struct TArray<struct FActiveScriptStateEffect> StopOnEndStateEffects; // 0x278(0x10)
	struct TArray<struct FActiveScriptStateEffect> InterruptableStateEffects; // 0x288(0x10)
	struct TArray<struct FActiveScriptStateEffect> StopOnUnequipStateEffects; // 0x298(0x10)
	struct FQueuedStateTransition QueuedStateTransition; // 0x2a8(0x38)
	struct FMulticastInlineDelegate OnStateHandleInputAction; // 0x2e0(0x10)
	struct UStateTransitionContext* CurrentContext; // 0x2f0(0x08)

	void SetSuppressedState(struct UStateComponent* State); // Function ShooterGame.ScriptStateComponent.SetSuppressedState // (Final|Native|Public|BlueprintCallable) // @ game+0x3d14410
	struct UStateTransitionContext* SetNewContext(struct UStateTransitionContext* ContextType); // Function ShooterGame.ScriptStateComponent.SetNewContext // (Final|Native|Public|BlueprintCallable) // @ game+0x3d141e0
	void SetDisarmedState(struct UStateComponent* State); // Function ShooterGame.ScriptStateComponent.SetDisarmedState // (Final|Native|Public|BlueprintCallable) // @ game+0x3d14150
	void SetDefaultNextState(struct UStateComponent* State); // Function ShooterGame.ScriptStateComponent.SetDefaultNextState // (Final|Native|Public|BlueprintCallable) // @ game+0x3a74fd0
	void SetCustomContext(struct UObject* NewContext); // Function ShooterGame.ScriptStateComponent.SetCustomContext // (Final|Native|Public|BlueprintCallable) // @ game+0x3d14030
	void SetCurrentContext(struct UStateTransitionContext* NewContext); // Function ShooterGame.ScriptStateComponent.SetCurrentContext // (Final|Native|Public|BlueprintCallable) // @ game+0x3d13fa0
	void OnSyncToAuthValues(); // Function ShooterGame.ScriptStateComponent.OnSyncToAuthValues // (Event|Public|BlueprintEvent) // @ game+0x4282c30
	void InterruptStateEffects(); // Function ShooterGame.ScriptStateComponent.InterruptStateEffects // (Final|Native|Public|BlueprintCallable) // @ game+0x3d13ea0
	bool HasQueuedStateTransition(); // Function ShooterGame.ScriptStateComponent.HasQueuedStateTransition // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x3d13e60
	void GoToStateWithContext(struct UStateComponent* NewState, struct UStateTransitionContext* Context, float TimeUntilTransition); // Function ShooterGame.ScriptStateComponent.GoToStateWithContext // (Final|Native|Public|BlueprintCallable) // @ game+0x3d13bd0
	void GoToState(struct UStateComponent* NewState, float TimeUntilTransition); // Function ShooterGame.ScriptStateComponent.GoToState // (Final|Native|Public|BlueprintCallable) // @ game+0x3d13a70
	void GoToNextState(float TimeUntilTransition); // Function ShooterGame.ScriptStateComponent.GoToNextState // (Final|Native|Public|BlueprintCallable) // @ game+0x3d139d0
	struct UStateComponent* GetSuppressedState(); // Function ShooterGame.ScriptStateComponent.GetSuppressedState // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x3d139a0
	struct UStateComponent* GetDisarmedState(); // Function ShooterGame.ScriptStateComponent.GetDisarmedState // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x3d13940
	struct UStateComponent* GetDefaultNextState(); // Function ShooterGame.ScriptStateComponent.GetDefaultNextState // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x3d138e0
	struct UStateTransitionContext* GetCurrentContext(); // Function ShooterGame.ScriptStateComponent.GetCurrentContext // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x386faf0
};

// Class ShooterGame.RespondToEventStateComponent
// Size: 0x3e8 (Inherited: 0x2f8)
struct URespondToEventStateComponent : UScriptStateComponent {
	struct FMulticastInlineDelegate OnIgnoredResponseOutOfGameplay; // 0x2f8(0x10)
	struct TArray<struct FStateChangeInputResponse> StateChangeInputs; // 0x308(0x10)
	struct TArray<struct FTriggerEventInputResponse> TriggerEventInputs; // 0x318(0x10)
	struct FActorContextResponse StateChangeActorEvent; // 0x328(0x30)
	struct TArray<struct FEquippableInventoryEventResponse> StateChangesInventoryEvent; // 0x358(0x10)
	struct FEquippableResourceResponse StateChangeResourceAvailable; // 0x368(0x10)
	char pad_378[0x20]; // 0x378(0x20)
	struct TMap<struct UEquippableEventBase*, struct UStateComponent*> EquippableEventResponses; // 0x398(0x50)

	void UnsubscribeFromInventoryEvents(struct UAresInventory* Inventory); // Function ShooterGame.RespondToEventStateComponent.UnsubscribeFromInventoryEvents // (Final|Native|Private) // @ game+0x3cd7120
	void SubscribeToInventoryEvents(struct UAresInventory* Inventory); // Function ShooterGame.RespondToEventStateComponent.SubscribeToInventoryEvents // (Final|Native|Private) // @ game+0x3cd7090
	void ServerAcknowledgeResyncTimePassed(struct FNetworkedMovementTimestamp PassedResyncStateStartTimestamp); // Function ShooterGame.RespondToEventStateComponent.ServerAcknowledgeResyncTimePassed // (Final|Net|NetReliableNative|Event|Private|NetServer) // @ game+0x3cd6dc0
	bool RespondsToInput(enum class EAresEquippableInput InputEvent); // Function ShooterGame.RespondToEventStateComponent.RespondsToInput // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x3cd6d30
	void ResourceChanged(struct UResourceComponent* ResourceComponent); // Function ShooterGame.RespondToEventStateComponent.ResourceChanged // (Final|Native|Private) // @ game+0x3cd6ca0
	bool ProcessInventoryEventResponse(struct UAresInventory* Inventory, struct FEquippableInventoryEventResponse& Response); // Function ShooterGame.RespondToEventStateComponent.ProcessInventoryEventResponse // (Final|Native|Private|HasOutParms) // @ game+0x3cd6a30
	void OnRelevantEquippableEventEmitted(struct UEquippableEventBase* Event); // Function ShooterGame.RespondToEventStateComponent.OnRelevantEquippableEventEmitted // (Final|Native|Protected) // @ game+0x3cd6920
	void MulticastSetStateStartTimestamp(struct FNetworkedMovementTimestamp NewResyncStateStartTimestamp); // Function ShooterGame.RespondToEventStateComponent.MulticastSetStateStartTimestamp // (Final|Net|NetReliableNative|Event|NetMulticast|Private) // @ game+0x3cd67d0
	void MulticastForceRespondToActorEvent(); // Function ShooterGame.RespondToEventStateComponent.MulticastForceRespondToActorEvent // (Final|Net|NetReliableNative|Event|NetMulticast|Private) // @ game+0x3948730
	void HandleOwnerSet(struct AAresItem* Item, struct AActor* PrevOwner, struct AActor* NewOwner); // Function ShooterGame.RespondToEventStateComponent.HandleOwnerSet // (Final|Native|Private) // @ game+0x3cd65c0
	void HandleInventoryEvent(struct AAresEquippable* Equippable); // Function ShooterGame.RespondToEventStateComponent.HandleInventoryEvent // (Final|Native|Private) // @ game+0x3cd6530
	float GetStateElapsedTime(); // Function ShooterGame.RespondToEventStateComponent.GetStateElapsedTime // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x3cd6470
	struct UAresInventory* GetOwningInventory(); // Function ShooterGame.RespondToEventStateComponent.GetOwningInventory // (Final|Native|Private|Const) // @ game+0x3cd6380
	void ClearInputResponse(enum class EAresEquippableInput Input, enum class EAresEquippableInputAction InputAction, enum class EAresActivationInputType ActivationType); // Function ShooterGame.RespondToEventStateComponent.ClearInputResponse // (Final|Native|Public|BlueprintCallable) // @ game+0x3cd6060
	void ClearAllInputTriggeredEvents(); // Function ShooterGame.RespondToEventStateComponent.ClearAllInputTriggeredEvents // (Final|Native|Public|BlueprintCallable) // @ game+0x3cd6040
	void ClearAllInputResponses(); // Function ShooterGame.RespondToEventStateComponent.ClearAllInputResponses // (Final|Native|Public|BlueprintCallable) // @ game+0x3cd6020
	bool BP_RespondToInput(struct FTriggerInput InputResponse, bool bForceRespond); // Function ShooterGame.RespondToEventStateComponent.BP_RespondToInput // (Native|Event|Protected|BlueprintEvent) // @ game+0x3cd5ea0
	void BP_ActorEventTriggered(enum class EActorEvent Event); // Function ShooterGame.RespondToEventStateComponent.BP_ActorEventTriggered // (Event|Protected|BlueprintEvent) // @ game+0x4282c30
	void AddResponseToEquippableEvent(struct UEquippableEventBase* EventType, struct UStateComponent* ChangeToState); // Function ShooterGame.RespondToEventStateComponent.AddResponseToEquippableEvent // (Final|Native|Public|BlueprintCallable) // @ game+0x3cd5dd0
	void AddResponseToAnyEquipped(struct UStateComponent* ChangeToState, struct TArray<struct AAresEquippable*>& Equippables); // Function ShooterGame.RespondToEventStateComponent.AddResponseToAnyEquipped // (Final|Native|Public|HasOutParms|BlueprintCallable) // @ game+0x3cd5ce0
	void AddResponseToAllUnequipped(struct UStateComponent* ChangeToState, struct TArray<struct AAresEquippable*>& Equippables); // Function ShooterGame.RespondToEventStateComponent.AddResponseToAllUnequipped // (Final|Native|Public|HasOutParms|BlueprintCallable) // @ game+0x3cd5bf0
	void AddResourceAvailableResponse(struct UResourceComponent* Resource, struct UStateComponent* ChangeToState); // Function ShooterGame.RespondToEventStateComponent.AddResourceAvailableResponse // (Final|Native|Public|BlueprintCallable) // @ game+0x3cd5b20
	void AddNewInputTriggeredEvent(enum class EAresEquippableInput Input, enum class EAresEquippableInputAction InputAction, struct FDelegate Event, float ResponseDelay, bool bCanRespondOutOfGameplay, bool bCanRespondInSpawnZone); // Function ShooterGame.RespondToEventStateComponent.AddNewInputTriggeredEvent // (Final|Native|Public|BlueprintCallable) // @ game+0x3cd5910
	void AddNewInputResponse(enum class EAresEquippableInput Input, enum class EAresEquippableInputAction InputAction, struct UStateComponent* ChangeToState, float ResponseDelay, bool bCanRespondOutOfGameplay, bool bCanRespondWhileSuppressed, bool bCanRespondInSpawnZones, enum class EAresActivationInputType ActivationType); // Function ShooterGame.RespondToEventStateComponent.AddNewInputResponse // (Final|Native|Public|BlueprintCallable) // @ game+0x3cd5690
	void AddEquipResponse_Internal(enum class EEquipType EquipType, struct UStateComponent* ChangeToState, struct TArray<struct AAresEquippable*>& Equippables); // Function ShooterGame.RespondToEventStateComponent.AddEquipResponse_Internal // (Final|Native|Public|HasOutParms) // @ game+0x3cd5560
	void AddEquipResponse(enum class EEquipType EquipType, struct UStateComponent* ChangeToState); // Function ShooterGame.RespondToEventStateComponent.AddEquipResponse // (Final|Native|Public|BlueprintCallable) // @ game+0x3cd5490
	void AddActorContextResponse(enum class EActorEvent ActorEvent, enum class EActorCombination Combination, struct UStateComponent* ChangeToState); // Function ShooterGame.RespondToEventStateComponent.AddActorContextResponse // (Final|Native|Public|BlueprintCallable) // @ game+0x3cd5380
	void ActorKilled(struct UDamageResponse* DamageResponse); // Function ShooterGame.RespondToEventStateComponent.ActorKilled // (Final|Native|Private) // @ game+0x3cd52f0
	void ActorDestroyed(struct AActor* Actor); // Function ShooterGame.RespondToEventStateComponent.ActorDestroyed // (Final|Native|Private) // @ game+0x3cd5260
};

// Class ShooterGame.ActorLockonStateComponent
// Size: 0x418 (Inherited: 0x3e8)
struct UActorLockonStateComponent : URespondToEventStateComponent {
	float Radius; // 0x3e8(0x04)
	float ConeAngle; // 0x3ec(0x04)
	float ConePullBack; // 0x3f0(0x04)
	bool bTwoDimensionalCone; // 0x3f4(0x01)
	bool bCheckLineOfSight; // 0x3f5(0x01)
	enum class ECollisionChannel LineOfSightCollision; // 0x3f6(0x01)
	char pad_3F7[0x1]; // 0x3f7(0x01)
	float LockGracePeriod; // 0x3f8(0x04)
	char pad_3FC[0x4]; // 0x3fc(0x04)
	struct AActor* LockedOnTarget; // 0x400(0x08)
	struct UScriptStateComponent* LockLostState; // 0x408(0x08)
	char pad_410[0x8]; // 0x410(0x08)

	void SetLockLostState(struct UScriptStateComponent* NewLockLostState); // Function ShooterGame.ActorLockonStateComponent.SetLockLostState // (Final|Native|Public|BlueprintCallable) // @ game+0x381c5a0
	void MulticastLockLost(); // Function ShooterGame.ActorLockonStateComponent.MulticastLockLost // (Net|NetReliableNative|Event|NetMulticast|Protected) // @ game+0x381bfd0
	struct AActor* GetLockOnTarget(); // Function ShooterGame.ActorLockonStateComponent.GetLockOnTarget // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x381bbb0
	void BreakLockOnTarget(); // Function ShooterGame.ActorLockonStateComponent.BreakLockOnTarget // (Final|BlueprintAuthorityOnly|Native|Public|BlueprintCallable) // @ game+0x381b9c0
};

// Class ShooterGame.MinimapDisplayComponentDeprecated
// Size: 0x290 (Inherited: 0x290)
struct UMinimapDisplayComponentDeprecated : USceneComponent {
};

// Class ShooterGame.ActorMinimapDisplayComponentDeprecated
// Size: 0x290 (Inherited: 0x290)
struct UActorMinimapDisplayComponentDeprecated : UMinimapDisplayComponentDeprecated {
};

// Class ShooterGame.ActorStateComponent
// Size: 0x160 (Inherited: 0xf8)
struct UActorStateComponent : UStateComponent {
	struct FMulticastInlineDelegate OnStateEnter; // 0xf8(0x10)
	struct FMulticastInlineDelegate OnStateExit; // 0x108(0x10)
	struct UStateComponent* ActorNextState; // 0x118(0x08)
	struct FQueuedStateTransition QueuedStateTransition; // 0x120(0x38)
	struct UStateTransitionContext* CurrentContext; // 0x158(0x08)

	struct UStateTransitionContext* SetNewContext(struct UStateTransitionContext* ContextType); // Function ShooterGame.ActorStateComponent.SetNewContext // (Final|Native|Public|BlueprintCallable) // @ game+0x381c630
	void SetDefaultNextState(struct UStateComponent* State); // Function ShooterGame.ActorStateComponent.SetDefaultNextState // (Final|Native|Public|BlueprintCallable) // @ game+0x381c510
	void SetCurrentContext(struct UStateTransitionContext* NewContext); // Function ShooterGame.ActorStateComponent.SetCurrentContext // (Final|Native|Public|BlueprintCallable) // @ game+0x381c480
	bool HasQueuedStateTransition(); // Function ShooterGame.ActorStateComponent.HasQueuedStateTransition // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x381bf70
	void GoToStateWithContext(struct UStateComponent* NewState, struct UStateTransitionContext* Context, float TimeUntilTransition); // Function ShooterGame.ActorStateComponent.GoToStateWithContext // (Final|Native|Public|BlueprintCallable) // @ game+0x381bd80
	void GoToState(struct UStateComponent* NewState, float TimeUntilTransition); // Function ShooterGame.ActorStateComponent.GoToState // (Final|Native|Public|BlueprintCallable) // @ game+0x381bcb0
	void GoToNextState(float TimeUntilTransition); // Function ShooterGame.ActorStateComponent.GoToNextState // (Final|Native|Public|BlueprintCallable) // @ game+0x381bc30
	struct UStateComponent* GetDefaultNextState(); // Function ShooterGame.ActorStateComponent.GetDefaultNextState // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x381bb20
	struct UStateTransitionContext* GetCurrentContext(); // Function ShooterGame.ActorStateComponent.GetCurrentContext // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x381bad0
};

// Class ShooterGame.StateMachineComponent
// Size: 0x1e0 (Inherited: 0xe8)
struct UStateMachineComponent : UActorComponent {
	struct FMulticastInlineDelegate OnStateMachineReset; // 0xe8(0x10)
	struct FMulticastInlineDelegate OnStateAdded; // 0xf8(0x10)
	struct FMulticastInlineDelegate OnStateChanged; // 0x108(0x10)
	char pad_118[0x18]; // 0x118(0x18)
	struct TArray<struct UStateTransitionContext*> CachedTransitionContexts; // 0x130(0x10)
	struct TMap<struct UStateComponent*, struct FStateMetadata> States; // 0x140(0x50)
	struct FStateContext ClientPredictedCurrentState; // 0x190(0x18)
	struct FStateContext AuthCurrentState; // 0x1a8(0x18)
	float CurrentSubframeWorldTimeSeconds; // 0x1c0(0x04)
	char pad_1C4[0x4]; // 0x1c4(0x04)
	struct UStateComponent* StartingState; // 0x1c8(0x08)
	struct UValueDisagreementTimer* CurrentStateDisagreementTimer; // 0x1d0(0x08)
	struct UValueDisagreementTimer* CurrentStateDisagreementTimerClassOverride; // 0x1d8(0x08)

	void SetStartingState(struct UStateComponent* State); // Function ShooterGame.StateMachineComponent.SetStartingState // (Final|Native|Public|BlueprintCallable) // @ game+0x3e1a760
	void RemoveState(struct UStateComponent* State); // Function ShooterGame.StateMachineComponent.RemoveState // (Final|Native|Public|BlueprintCallable) // @ game+0x3e1a5b0
	void OnRep_AuthCurrentState(); // Function ShooterGame.StateMachineComponent.OnRep_AuthCurrentState // (Final|Native|Private) // @ game+0x3e1a590
	void InitializeStartingState(struct AActor* Owner); // Function ShooterGame.StateMachineComponent.InitializeStartingState // (Final|Native|Private) // @ game+0x3e1a4a0
	struct UStateComponent* GetStartingState(); // Function ShooterGame.StateMachineComponent.GetStartingState // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x3bd9fb0
	struct UStateComponent* GetCurrentState(); // Function ShooterGame.StateMachineComponent.GetCurrentState // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x3e1a230
	void ClientResetStateMachine(); // Function ShooterGame.StateMachineComponent.ClientResetStateMachine // (Final|Net|NetReliableNative|Event|NetMulticast|Private) // @ game+0x38028f0
	void AuthResetStateMachine(); // Function ShooterGame.StateMachineComponent.AuthResetStateMachine // (Final|BlueprintAuthorityOnly|Native|Public|BlueprintCallable) // @ game+0x2118460
	void AddState(struct UStateComponent* State); // Function ShooterGame.StateMachineComponent.AddState // (Final|Native|Public|BlueprintCallable) // @ game+0x3e19eb0
};

// Class ShooterGame.ActorStateMachineComponent
// Size: 0x230 (Inherited: 0x1e0)
struct UActorStateMachineComponent : UStateMachineComponent {
	char pad_1E0[0x48]; // 0x1e0(0x48)
	bool bStateMachineEnabled; // 0x228(0x01)
	char pad_229[0x7]; // 0x229(0x07)

	struct AActor* GetOwningActor(); // Function ShooterGame.ActorStateMachineComponent.GetOwningActor // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x381bbe0
};

// Class ShooterGame.ActorTargetingStateComponent
// Size: 0x4b0 (Inherited: 0x3e8)
struct UActorTargetingStateComponent : URespondToEventStateComponent {
	struct FMulticastInlineDelegate OnActorSelected; // 0x3e8(0x10)
	struct FMulticastInlineDelegate OnInvalidActor; // 0x3f8(0x10)
	struct FMulticastInlineDelegate OnActorTargetedLocally; // 0x408(0x10)
	struct FClassInclusionExclusionFilter ActorFilter; // 0x418(0x50)
	enum class EAresTeamTargeting TeamFilter; // 0x468(0x01)
	bool bPawnsOnly; // 0x469(0x01)
	char pad_46A[0x2]; // 0x46a(0x02)
	float Radius; // 0x46c(0x04)
	float ConfirmationGraceAmount; // 0x470(0x04)
	enum class ECollisionChannel SearchCollision; // 0x474(0x01)
	char pad_475[0x3]; // 0x475(0x03)
	float ConeAngle; // 0x478(0x04)
	float ConeYawAngle; // 0x47c(0x04)
	float ConePitchAngle; // 0x480(0x04)
	float ConePullBack; // 0x484(0x04)
	bool bTwoDimensionalCone; // 0x488(0x01)
	bool bCheckLineOfSight; // 0x489(0x01)
	enum class ECollisionChannel LineOfSightCollision; // 0x48a(0x01)
	bool bTargetOnRemoteClients; // 0x48b(0x01)
	char pad_48C[0x4]; // 0x48c(0x04)
	struct AActor* CurrentActorTarget; // 0x490(0x08)
	bool bDrawDebugTargeting; // 0x498(0x01)
	char pad_499[0x17]; // 0x499(0x17)

	struct AActor* GetCurrentTarget(); // Function ShooterGame.ActorTargetingStateComponent.GetCurrentTarget // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x381bb00
	float GetActorScore(struct AActor* Actor); // Function ShooterGame.ActorTargetingStateComponent.GetActorScore // (Native|Event|Public|BlueprintEvent) // @ game+0x381ba20
	void AddCancelTargetingResponse(enum class EAresEquippableInput Input, enum class EAresEquippableInputAction InputAction, struct UStateComponent* ChangeToState, float ResponseDelay, bool bCanRespondOutOfGameplay, bool bCanRespondWhileSuppressed); // Function ShooterGame.ActorTargetingStateComponent.AddCancelTargetingResponse // (Final|Native|Public|BlueprintCallable) // @ game+0x381b620
	bool ActorIsValid(struct AActor* Actor); // Function ShooterGame.ActorTargetingStateComponent.ActorIsValid // (Native|Event|Public|BlueprintEvent) // @ game+0x381b570
};

// Class ShooterGame.VisibilityComponent
// Size: 0x188 (Inherited: 0xe8)
struct UVisibilityComponent : UActorComponent {
	char pad_E8[0x8]; // 0xe8(0x08)
	struct FMulticastInlineDelegate OnOwnerEnteredTeamSight; // 0xf0(0x10)
	struct FMulticastInlineDelegate OnOwnerExitedTeamSight; // 0x100(0x10)
	bool bSeenByResult; // 0x110(0x01)
	char pad_111[0x7]; // 0x111(0x07)
	struct TArray<struct AShooterCharacter*> CharactersWithVisibility; // 0x118(0x10)
	enum class EEnemyVisibilityOption EnemyVisibility; // 0x128(0x01)
	char pad_129[0x7]; // 0x129(0x07)
	struct FMulticastInlineDelegate CanBeSeenByCharacterOverride; // 0x130(0x10)
	char pad_140[0x20]; // 0x140(0x20)
	float VisibilityLostTime; // 0x160(0x04)
	char pad_164[0x4]; // 0x164(0x04)
	struct FTimerHandle ExitVisibilityTimerHandle; // 0x168(0x08)
	char pad_170[0x18]; // 0x170(0x18)

	bool HasTeamSight(struct AActor* TargetActor); // Function ShooterGame.VisibilityComponent.HasTeamSight // (Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x3e8b500
	bool HasAllianceSight(enum class EAresAlliance Alliance); // Function ShooterGame.VisibilityComponent.HasAllianceSight // (Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x3e8b460
	float GetVisibilityLostTime(); // Function ShooterGame.VisibilityComponent.GetVisibilityLostTime // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x273ec00
	bool GetUseTeamVisibilityData(); // Function ShooterGame.VisibilityComponent.GetUseTeamVisibilityData // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x3c8fa50
	float GetLastTimeVisibleToEnemy(); // Function ShooterGame.VisibilityComponent.GetLastTimeVisibleToEnemy // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x3e8b050
	struct FVector GetLastLocationVisibleToEnemy(); // Function ShooterGame.VisibilityComponent.GetLastLocationVisibleToEnemy // (Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const) // @ game+0x3e8b020
	struct FVector GetLastFacingVisibleToEnemy(); // Function ShooterGame.VisibilityComponent.GetLastFacingVisibleToEnemy // (Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const) // @ game+0x3e8aff0
	bool CanBeSeenByCharacterDefault(struct AShooterCharacter* Character); // Function ShooterGame.VisibilityComponent.CanBeSeenByCharacterDefault // (Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x39c3a30
	bool CanBeSeenByCharacter(struct AShooterCharacter* Character); // Function ShooterGame.VisibilityComponent.CanBeSeenByCharacter // (Final|Native|Public|BlueprintCallable) // @ game+0x3e8ae20
	void AuthUnregisterForUpdate(); // Function ShooterGame.VisibilityComponent.AuthUnregisterForUpdate // (Final|BlueprintAuthorityOnly|Native|Public|BlueprintCallable) // @ game+0x2118460
	void AuthRegisterForUpdate(); // Function ShooterGame.VisibilityComponent.AuthRegisterForUpdate // (Final|BlueprintAuthorityOnly|Native|Public|BlueprintCallable) // @ game+0x2118460
};

// Class ShooterGame.ActorVisibilityComponent
// Size: 0x188 (Inherited: 0x188)
struct UActorVisibilityComponent : UVisibilityComponent {
};

// Class ShooterGame.ActorVisualizationComponent
// Size: 0x1a8 (Inherited: 0xe8)
struct UActorVisualizationComponent : UActorComponent {
	char pad_E8[0x8]; // 0xe8(0x08)
	bool bPawnsOnly; // 0xf0(0x01)
	char pad_F1[0x7]; // 0xf1(0x07)
	struct FClassInclusionExclusionFilter ActorFilter; // 0xf8(0x50)
	enum class EAresTeamTargeting TeamFilter; // 0x148(0x01)
	char pad_149[0x7]; // 0x149(0x07)
	struct FEmbeddedEffectInfo VisualizationEffect; // 0x150(0x30)
	bool bVisualizationActiveInitially; // 0x180(0x01)
	char pad_181[0x17]; // 0x181(0x17)
	struct TArray<struct AActor*> PendingVisualizedActors; // 0x198(0x10)

	void StopVisualization(); // Function ShooterGame.ActorVisualizationComponent.StopVisualization // (Final|Native|Public|BlueprintCallable) // @ game+0x381c810
	void StartVisualization(); // Function ShooterGame.ActorVisualizationComponent.StartVisualization // (Final|Native|Public|BlueprintCallable) // @ game+0x381c7f0
	void SetVisualization(bool bVisualization); // Function ShooterGame.ActorVisualizationComponent.SetVisualization // (Final|Native|Public|BlueprintCallable) // @ game+0x381c760
	void OnPlayerSpawn(struct AShooterPlayerState* PlayerState, struct APawn* Pawn); // Function ShooterGame.ActorVisualizationComponent.OnPlayerSpawn // (Final|Native|Private) // @ game+0x381c1e0
	void OnActorSpawned(struct AActor* NewActor); // Function ShooterGame.ActorVisualizationComponent.OnActorSpawned // (Final|Native|Private) // @ game+0x381c150
};

// Class ShooterGame.AresBasePrimaryDataAsset
// Size: 0x50 (Inherited: 0x38)
struct UAresBasePrimaryDataAsset : UPrimaryDataAsset {
	struct FGuid UUID; // 0x38(0x10)
	bool bHideIfNotOwned; // 0x48(0x01)
	bool bBaseContent; // 0x49(0x01)
	char pad_4A[0x6]; // 0x4a(0x06)

	enum class EAresContentType GetContentType(); // Function ShooterGame.AresBasePrimaryDataAsset.GetContentType // (Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x2bbc400
};

// Class ShooterGame.ActRankBorderDataAsset
// Size: 0x80 (Inherited: 0x50)
struct UActRankBorderDataAsset : UAresBasePrimaryDataAsset {
	struct TSoftClassPtr<UObject> UIData; // 0x50(0x30)
};

// Class ShooterGame.BaseContentUIData
// Size: 0x90 (Inherited: 0x30)
struct UBaseContentUIData : UObject {
	struct FText DisplayName; // 0x30(0x18)
	struct FText DisplayNameAllCaps; // 0x48(0x18)
	struct UTexture* DisplayIcon; // 0x60(0x08)
	struct FWidgetTransform IconTransform; // 0x68(0x1c)
	struct TWeakObjectPtr<struct UObject> WorldContext; // 0x84(0x08)
	char pad_8C[0x4]; // 0x8c(0x04)

	void SetDisplayName(struct FText NewName); // Function ShooterGame.BaseContentUIData.SetDisplayName // (Final|Native|Public|BlueprintCallable) // @ game+0x3a33520
	void SetDisplayIcon(struct UTexture* NewIcon); // Function ShooterGame.BaseContentUIData.SetDisplayIcon // (Final|Native|Public|BlueprintCallable) // @ game+0x3a33490
	struct UUserWidget* MakeNewDetailedInfoWidget(); // Function ShooterGame.BaseContentUIData.MakeNewDetailedInfoWidget // (Event|Public|BlueprintEvent) // @ game+0x4282c30
	struct FText GetDisplayNameAllCaps(); // Function ShooterGame.BaseContentUIData.GetDisplayNameAllCaps // (Final|Native|Public|BlueprintCallable|BlueprintPure) // @ game+0x3a32830
	struct UUserWidget* GetDetailedInfoWidget(struct UObject* WorldContextObject); // Function ShooterGame.BaseContentUIData.GetDetailedInfoWidget // (Final|BlueprintCosmetic|Native|Public|BlueprintCallable) // @ game+0x3a32790
	struct FText GetDescription(); // Function ShooterGame.BaseContentUIData.GetDescription // (Native|Public|Const) // @ game+0x3a32750
};

// Class ShooterGame.ActRankBorderUIData
// Size: 0x98 (Inherited: 0x90)
struct UActRankBorderUIData : UBaseContentUIData {
	struct UTexture* SmallIcon; // 0x90(0x08)
};

// Class ShooterGame.AFKDetectionComponent
// Size: 0x170 (Inherited: 0xe8)
struct UAFKDetectionComponent : UActorComponent {
	struct FMulticastInlineDelegate OnAFKStatusChanged; // 0xe8(0x10)
	struct FMulticastInlineDelegate OnAwayPenaltyStateChanged; // 0xf8(0x10)
	struct FMulticastInlineDelegate OnDidLeaveSpawnChanged; // 0x108(0x10)
	struct FMulticastInlineDelegate OnDidMove; // 0x118(0x10)
	struct FShooterGameTimeMarker AuthLastPlayerInputTimestamp; // 0x128(0x0c)
	struct FShooterGameTimeMarker AuthDisconnectedSinceTimestamp; // 0x134(0x0c)
	struct FShooterGameTimeMarker AuthLastPlayerChangedRegionTimestamp; // 0x140(0x0c)
	bool bIsPenalizedForBeingAway; // 0x14c(0x01)
	bool bIsAFK; // 0x14d(0x01)
	bool bDidLeaveSpawn; // 0x14e(0x01)
	char pad_14F[0x1]; // 0x14f(0x01)
	struct AShooterPlayerState* OwningShooterPlayer; // 0x150(0x08)
	struct AShooterGameState* GameState; // 0x158(0x08)
	char pad_160[0x10]; // 0x160(0x10)

	void ServerHandleClientInputHeartbeat(); // Function ShooterGame.AFKDetectionComponent.ServerHandleClientInputHeartbeat // (Net|NetReliableNative|Event|Protected|NetServer) // @ game+0x38028f0
	void OnRep_IsPenalizedForBeingAway(); // Function ShooterGame.AFKDetectionComponent.OnRep_IsPenalizedForBeingAway // (Final|Native|Protected) // @ game+0x381c2b0
	bool GetIsPenalizedForBeingAway(); // Function ShooterGame.AFKDetectionComponent.GetIsPenalizedForBeingAway // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x381bb90
	bool GetIsAFK(); // Function ShooterGame.AFKDetectionComponent.GetIsAFK // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x381bb70
	bool GetDidLeaveSpawn(); // Function ShooterGame.AFKDetectionComponent.GetDidLeaveSpawn // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x381bb50
	void AuthSimulatePlayerInputReceived(); // Function ShooterGame.AFKDetectionComponent.AuthSimulatePlayerInputReceived // (Final|Native|Public|BlueprintCallable) // @ game+0x2118460
	bool AuthShouldEndGameEarlyForDisconnects(struct UObject* WorldContextObject); // Function ShooterGame.AFKDetectionComponent.AuthShouldEndGameEarlyForDisconnects // (Final|BlueprintAuthorityOnly|Native|Static|Protected|BlueprintCallable|BlueprintPure) // @ game+0x381b8a0
	void AuthHandleSpawnedCharacterChanged(struct AShooterCharacter* NewCharacter); // Function ShooterGame.AFKDetectionComponent.AuthHandleSpawnedCharacterChanged // (Final|Native|Protected) // @ game+0x3802110
	void AuthHandlePlayerInputReceived(); // Function ShooterGame.AFKDetectionComponent.AuthHandlePlayerInputReceived // (Final|Native|Public) // @ game+0x2118460
	void AuthHandleConnectionStatusChanged(struct AAresPlayerStateBase* Player, enum class EConnectionStatus OldStatus, enum class EConnectionStatus NewStatus); // Function ShooterGame.AFKDetectionComponent.AuthHandleConnectionStatusChanged // (Final|Native|Protected) // @ game+0x380c810
	void AuthHandleCalloutRegionChanged(struct AAresCalloutRegion* NewRegion); // Function ShooterGame.AFKDetectionComponent.AuthHandleCalloutRegionChanged // (Final|Native|Protected) // @ game+0x3802110
};

// Class ShooterGame.IdleTimeAFKDetectionComponent
// Size: 0x178 (Inherited: 0x170)
struct UIdleTimeAFKDetectionComponent : UAFKDetectionComponent {
	float PlayerAFKInactivityThreshold; // 0x170(0x04)
	char pad_174[0x4]; // 0x174(0x04)

	float GetPlayerAFKInactivityThreshold(); // Function ShooterGame.IdleTimeAFKDetectionComponent.GetPlayerAFKInactivityThreshold // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x381bc10
};

// Class ShooterGame.RoundBasedAFKDetectionComponent
// Size: 0x188 (Inherited: 0x170)
struct URoundBasedAFKDetectionComponent : UAFKDetectionComponent {
	int32_t RoundsAFKThreshold; // 0x170(0x04)
	char pad_174[0x14]; // 0x174(0x14)
};

// Class ShooterGame.AgentViewModel
// Size: 0x60 (Inherited: 0x48)
struct UAgentViewModel : UAresViewModelBase {
	struct FMulticastInlineDelegate OnLargeDisplayImageChanged; // 0x48(0x10)
	struct UTexture* LargeDisplayImage; // 0x58(0x08)

	void SetLargeDisplayImage(struct UTexture* NewLargeDisplayImage); // Function ShooterGame.AgentViewModel.SetLargeDisplayImage // (Final|Native|Protected|BlueprintCallable) // @ game+0x3823ec0
	void OnCharacterHandleLoaded(struct UCharacterHandle* InCharacterHandle); // Function ShooterGame.AgentViewModel.OnCharacterHandleLoaded // (Final|Native|Private) // @ game+0x3823400
	void InitFromCharacterHandle(struct UCharacterHandle* InCharacterHandle); // Function ShooterGame.AgentViewModel.InitFromCharacterHandle // (Final|Native|Public|BlueprintCallable) // @ game+0x3823070
	struct UTexture* GetLargeDisplayImage(); // Function ShooterGame.AgentViewModel.GetLargeDisplayImage // (Final|Native|Protected|BlueprintCallable|BlueprintPure) // @ game+0x3822ee0
};

// Class ShooterGame.AIAimPriorityComponent
// Size: 0x1e0 (Inherited: 0xe8)
struct UAIAimPriorityComponent : UActorComponent {
	struct TMap<enum class EAIAimTargetType, float> TargetPriorityMap; // 0xe8(0x50)
	char pad_138[0x50]; // 0x138(0x50)
	struct TSet<enum class EAIAimTargetType> DisabledTargets; // 0x188(0x50)
	char pad_1D8[0x8]; // 0x1d8(0x08)

	void SetTargetEnabled(enum class EAIAimTargetType TargetType, bool bEnabled); // Function ShooterGame.AIAimPriorityComponent.SetTargetEnabled // (Final|Native|Public|BlueprintCallable) // @ game+0x3824020
	void SetPriority(enum class EAIAimTargetType TargetType, float Priority); // Function ShooterGame.AIAimPriorityComponent.SetPriority // (Final|Native|Public|BlueprintCallable) // @ game+0x3823f50
	void SetAllPriorities(struct TMap<enum class EAIAimTargetType, float> PriorityMap); // Function ShooterGame.AIAimPriorityComponent.SetAllPriorities // (Final|Native|Public|BlueprintCallable) // @ game+0x3823c20
	void SetAimTarget(enum class EAIAimTargetType TargetType, struct FAIAimTargetInfo AimPriorityInfo); // Function ShooterGame.AIAimPriorityComponent.SetAimTarget // (Final|Native|Public|BlueprintCallable) // @ game+0x3823b30
	bool GetPriority(enum class EAIAimTargetType TargetType, float& OutPriority); // Function ShooterGame.AIAimPriorityComponent.GetPriority // (Final|Native|Public|HasOutParms|BlueprintCallable) // @ game+0x3822f90
	enum class EAIAimTargetType GetNextTargetType(enum class EAIAimTargetType TargetType); // Function ShooterGame.AIAimPriorityComponent.GetNextTargetType // (Final|Native|Public|BlueprintCallable) // @ game+0x3822f00
	struct FAIAimTargetInfo GetHighestPriorityTarget(enum class EAIAimTargetType& OutAimTargetType); // Function ShooterGame.AIAimPriorityComponent.GetHighestPriorityTarget // (Final|Native|Public|HasOutParms|BlueprintCallable) // @ game+0x3822e20
	void ClearPriority(enum class EAIAimTargetType TargetType); // Function ShooterGame.AIAimPriorityComponent.ClearPriority // (Final|Native|Public|BlueprintCallable) // @ game+0x3822580
	void ClearAllPriorities(); // Function ShooterGame.AIAimPriorityComponent.ClearAllPriorities // (Final|Native|Public|BlueprintCallable) // @ game+0x3822560
	void ClearAimTarget(enum class EAIAimTargetType TargetType); // Function ShooterGame.AIAimPriorityComponent.ClearAimTarget // (Final|Native|Public|BlueprintCallable) // @ game+0x38224e0
};

// Class ShooterGame.AIBehaviorMarkup
// Size: 0x3c0 (Inherited: 0x3b8)
struct AAIBehaviorMarkup : AActor {
	struct UBehaviorTree* BehaviorTree; // 0x3b8(0x08)

	struct UBehaviorTree* GetBehaviorTree(); // Function ShooterGame.AIBehaviorMarkup.GetBehaviorTree // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x3822ba0
};

// Class ShooterGame.AIBehaviorMarkupPrecondition_Delayed
// Size: 0x190 (Inherited: 0xe8)
struct UAIBehaviorMarkupPrecondition_Delayed : UActorComponent {
	char pad_E8[0xa8]; // 0xe8(0xa8)

	void StartPreconditionTimer(struct AAIController* AIController, float PreconditionDelay, bool bOverrideExistingTimer); // Function ShooterGame.AIBehaviorMarkupPrecondition_Delayed.StartPreconditionTimer // (Final|Native|Public|BlueprintCallable) // @ game+0x38240f0
	void FailPrecondition(struct AAIController* AIController); // Function ShooterGame.AIBehaviorMarkupPrecondition_Delayed.FailPrecondition // (Final|Native|Public|BlueprintCallable) // @ game+0x38229a0
};

// Class ShooterGame.AIBehaviorMarkupPrecondition_MaxNumEquippableActivation
// Size: 0x158 (Inherited: 0xe8)
struct UAIBehaviorMarkupPrecondition_MaxNumEquippableActivation : UActorComponent {
	char pad_E8[0x8]; // 0xe8(0x08)
	int32_t MaxNumActivation; // 0xf0(0x04)
	bool bRequireActivationSuccess; // 0xf4(0x01)
	bool bClearOnRoundStart; // 0xf5(0x01)
	char pad_F6[0x62]; // 0xf6(0x62)

	void OnRoundStart(int32_t RoundNumber); // Function ShooterGame.AIBehaviorMarkupPrecondition_MaxNumEquippableActivation.OnRoundStart // (Final|Native|Private) // @ game+0x38236c0
	void OnEquippableActivationComplete(struct UAIEquippableActivationComponent* EquippableActivationComponent, bool bSuccess); // Function ShooterGame.AIBehaviorMarkupPrecondition_MaxNumEquippableActivation.OnEquippableActivationComplete // (Final|Native|Private) // @ game+0x3823490
};

// Class ShooterGame.AIBehaviorMarkupPreconditionInterface
// Size: 0x30 (Inherited: 0x30)
struct UAIBehaviorMarkupPreconditionInterface : UInterface {

	bool IsPreconditionMet(struct AAIController* AIController, struct APawn* Pawn); // Function ShooterGame.AIBehaviorMarkupPreconditionInterface.IsPreconditionMet // (Native|Event|Public|BlueprintCallable|BlueprintEvent|BlueprintPure|Const) // @ game+0x3823190
};

// Class ShooterGame.AIEquippableActivationComponent
// Size: 0x150 (Inherited: 0xe8)
struct UAIEquippableActivationComponent : UActorComponent {
	struct FMulticastInlineDelegate OnActivationComplete; // 0xe8(0x10)
	struct TSoftClassPtr<UObject> EquippableClass; // 0xf8(0x30)
	struct AController* OwningController; // 0x128(0x08)
	struct AShooterCharacter* OwningShooterCharacter; // 0x130(0x08)
	struct UAresInventory* Inventory; // 0x138(0x08)
	bool bAborted; // 0x140(0x01)
	char pad_141[0xf]; // 0x141(0x0f)

	bool UnequipEquippable(); // Function ShooterGame.AIEquippableActivationComponent.UnequipEquippable // (Final|Native|Public|BlueprintCallable) // @ game+0x3824210
	void SetEquippableClass(struct TSoftClassPtr<UObject> InEquippableClass); // Function ShooterGame.AIEquippableActivationComponent.SetEquippableClass // (Final|Native|Public|BlueprintCallable) // @ game+0x3823d90
	void PerformActivation(); // Function ShooterGame.AIEquippableActivationComponent.PerformActivation // (Native|Event|Protected|BlueprintCallable|BlueprintEvent) // @ game+0x38028f0
	void OnNewPawn(struct APawn* NewPawn); // Function ShooterGame.AIEquippableActivationComponent.OnNewPawn // (Final|Native|Private) // @ game+0x3823630
	bool IsEquipped(); // Function ShooterGame.AIEquippableActivationComponent.IsEquipped // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x3823160
	void InstantActivateEquippable(); // Function ShooterGame.AIEquippableActivationComponent.InstantActivateEquippable // (Final|Native|Public|BlueprintCallable) // @ game+0x3823100
	struct TSoftClassPtr<UObject> GetEquippableClass(); // Function ShooterGame.AIEquippableActivationComponent.GetEquippableClass // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x3822d40
	struct AAresEquippable* GetEquippable(); // Function ShooterGame.AIEquippableActivationComponent.GetEquippable // (Final|Native|Protected|BlueprintCallable|BlueprintPure|Const) // @ game+0x3822bd0
	bool EquipEquippable(); // Function ShooterGame.AIEquippableActivationComponent.EquipEquippable // (Final|Native|Public|BlueprintCallable) // @ game+0x3822970
	bool CanUseEquippable(); // Function ShooterGame.AIEquippableActivationComponent.CanUseEquippable // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x38224b0
	void ActivateOnceEquipped(); // Function ShooterGame.AIEquippableActivationComponent.ActivateOnceEquipped // (Final|Native|Private) // @ game+0x38222d0
	void ActivateEquippable(); // Function ShooterGame.AIEquippableActivationComponent.ActivateEquippable // (Final|Native|Public|BlueprintCallable) // @ game+0x38222b0
	void Abort(); // Function ShooterGame.AIEquippableActivationComponent.Abort // (Native|Event|Public|BlueprintCallable|BlueprintEvent) // @ game+0x38221f0
};

// Class ShooterGame.AIEquippableActivationMarkupComponent
// Size: 0x140 (Inherited: 0xe8)
struct UAIEquippableActivationMarkupComponent : UActorComponent {
	char pad_E8[0x8]; // 0xe8(0x08)
	struct FMulticastInlineDelegate OnConfigureForActivation; // 0xf0(0x10)
	struct FMulticastInlineDelegate OnActivationComplete; // 0x100(0x10)
	struct TSoftClassPtr<UObject> EquippableClass; // 0x110(0x30)

	void OnEquippableActivationComplete(struct UAIEquippableActivationComponent* EquippableActivationComponent, bool bSuccess); // Function ShooterGame.AIEquippableActivationMarkupComponent.OnEquippableActivationComplete // (Final|Native|Private) // @ game+0x3823560
	struct TSoftClassPtr<UObject> GetEquippableClass(); // Function ShooterGame.AIEquippableActivationMarkupComponent.GetEquippableClass // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x3822db0
	struct UAIEquippableActivationComponent* GetEquippableActivationComponent(struct AAIController* AIController); // Function ShooterGame.AIEquippableActivationMarkupComponent.GetEquippableActivationComponent // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x3822ca0
	struct AAresEquippable* GetEquippable(struct APawn* Pawn); // Function ShooterGame.AIEquippableActivationMarkupComponent.GetEquippable // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x3822c00
	void ConfigureAndActivateEquippable(struct AAIController* AIController, bool bInstantActivation); // Function ShooterGame.AIEquippableActivationMarkupComponent.ConfigureAndActivateEquippable // (Final|Native|Public|BlueprintCallable|Const) // @ game+0x3822600
	void AbortEquippableActivation(struct AAIController* AIController); // Function ShooterGame.AIEquippableActivationMarkupComponent.AbortEquippableActivation // (Final|Native|Public|BlueprintCallable|Const) // @ game+0x3822220
};

// Class ShooterGame.AIFiringStateTuningComponent
// Size: 0xe8 (Inherited: 0xe8)
struct UAIFiringStateTuningComponent : UActorComponent {

	float PredictProjectileDamage(struct FVector& FiringLocation, struct FVector& AttackVector, struct FProjectileTuning& ProjectileTuning, struct FHitResult& OutHitResult); // Function ShooterGame.AIFiringStateTuningComponent.PredictProjectileDamage // (Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable) // @ game+0x3823750
	void OnPlayerCharacterHit(float Damage); // Function ShooterGame.AIFiringStateTuningComponent.OnPlayerCharacterHit // (Event|Public|BlueprintEvent) // @ game+0x4282c30
	void ModifyShotTrajectories(struct FVector& FiringLocation, struct TArray<struct FVector>& AttackVectors, struct FProjectileTuning& ProjectileTuning); // Function ShooterGame.AIFiringStateTuningComponent.ModifyShotTrajectories // (Native|Event|Public|HasOutParms|HasDefaults|BlueprintEvent) // @ game+0x3823270
	void ForceAttackVectorsToMiss(struct FVector& FiringLocation, struct TArray<struct FVector>& AttackVectors, struct FProjectileTuning& ProjectileTuning); // Function ShooterGame.AIFiringStateTuningComponent.ForceAttackVectorsToMiss // (Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable) // @ game+0x3822a30
};

// Class ShooterGame.EquippableListAsset
// Size: 0x48 (Inherited: 0x38)
struct UEquippableListAsset : UDataAsset {
	struct TArray<struct TSoftClassPtr<UObject>> Equippables; // 0x38(0x10)
};

// Class ShooterGame.AimToolsTuningComponent
// Size: 0x1b8 (Inherited: 0xe8)
struct UAimToolsTuningComponent : UActorComponent {
	struct UCurveFloat* MagnetDistanceCurve; // 0xe8(0x08)
	struct UCurveFloat* MagnetVelocityCurve; // 0xf0(0x08)
	struct UCurveFloat* MagnetRampUpCurve; // 0xf8(0x08)
	struct UCurveFloat* SnapDistanceCurveHorizontal; // 0x100(0x08)
	struct UCurveFloat* SnapDistanceCurveVertical; // 0x108(0x08)
	struct UCurveFloat* SnapAngleCurveHorizontal; // 0x110(0x08)
	struct UCurveFloat* SnapAngleCurveVertical; // 0x118(0x08)
	struct UCurveFloat* HeadshotSnapDistanceCurve; // 0x120(0x08)
	struct UCurveFloat* HeadshotSnapAngleCurve; // 0x128(0x08)
	struct UEquippableListAsset* MagnetizedAbilities; // 0x130(0x08)
	struct UEquippableListAsset* AimSnapExcludedWeapons; // 0x138(0x08)
	struct UEquippableListAsset* AimSnapExcludedWhileZoomedWeapons; // 0x140(0x08)
	struct UEquippableListAsset* AimSnapIncludedAbilities; // 0x148(0x08)
	struct UCurveFloat* DeployablesSnapAngleScaleCurve; // 0x150(0x08)
	struct TMap<struct TSoftClassPtr<UObject>, struct FSnapTargetTypeTunables> TargetTypeMap; // 0x158(0x50)
	struct TArray<struct TSoftClassPtr<UObject>> BaseScalingClasses; // 0x1a8(0x10)

	bool IsAimTouchActive(); // Function ShooterGame.AimToolsTuningComponent.IsAimTouchActive // (Native|Public|BlueprintCallable) // @ game+0x3823120
};

// Class ShooterGame.RespondsToHearingDetectionInterface
// Size: 0x30 (Inherited: 0x30)
struct URespondsToHearingDetectionInterface : UInterface {

	void RespondToDetection(struct TArray<struct AActor*>& InDetectingActors, struct FAINoiseEvent& InEvent, struct FNoiseEventTagData& InDecodedData); // Function ShooterGame.RespondsToHearingDetectionInterface.RespondToDetection // (Native|Event|Public|HasOutParms|BlueprintEvent) // @ game+0x3823940
};

// Class ShooterGame.AISense_OcclusionHearing
// Size: 0xf8 (Inherited: 0xf8)
struct UAISense_OcclusionHearing : UAISense_Hearing {

	struct FName EncodeNoiseEventTagDataToTag(struct FNoiseEventTagData& InData); // Function ShooterGame.AISense_OcclusionHearing.EncodeNoiseEventTagDataToTag // (Final|Native|Static|Public|HasOutParms|BlueprintCallable) // @ game+0x3822840
	bool DecodeTagToNoiseEventTagData(struct FName& InTag, struct FNoiseEventTagData& OutData); // Function ShooterGame.AISense_OcclusionHearing.DecodeTagToNoiseEventTagData // (Final|Native|Static|Public|HasOutParms|BlueprintCallable) // @ game+0x38226d0
	void AuthReportNoiseEvent(struct UObject* WorldContextObject, struct FNoiseEventData& EventData, struct AActor* Instigator, struct FVector& Location); // Function ShooterGame.AISense_OcclusionHearing.AuthReportNoiseEvent // (Final|Native|Static|Public|HasOutParms|HasDefaults|BlueprintCallable) // @ game+0x38222f0
};

// Class ShooterGame.AISenseConfig_OcclusionHearing
// Size: 0x68 (Inherited: 0x68)
struct UAISenseConfig_OcclusionHearing : UAISenseConfig_Hearing {
};

// Class ShooterGame.AITargetData
// Size: 0xf0 (Inherited: 0xe8)
struct UAITargetData : UActorComponent {
	bool bIsPriorityTarget; // 0xe8(0x01)
	bool bIsShootableFlash; // 0xe9(0x01)
	char pad_EA[0x6]; // 0xea(0x06)
};

// Class ShooterGame.AIUpdateMovementAimTargetComponent
// Size: 0xf0 (Inherited: 0xe8)
struct UAIUpdateMovementAimTargetComponent : UActorComponent {
	enum class EAIAimTargetType MovementTargetType; // 0xe8(0x01)
	char pad_E9[0x7]; // 0xe9(0x07)
};

// Class ShooterGame.AllPawnsTargetingStateComponent
// Size: 0x2f8 (Inherited: 0x2f8)
struct UAllPawnsTargetingStateComponent : UScriptStateComponent {
};

// Class ShooterGame.DesignableUserWidget
// Size: 0x2c8 (Inherited: 0x2c8)
struct UDesignableUserWidget : UUserWidget {

	void SynchronizeWidget(struct UWidget* Widget); // Function ShooterGame.DesignableUserWidget.SynchronizeWidget // (Final|Native|Static|Public|BlueprintCallable) // @ game+0x3a8fb10
	void OnSynchronizeProperties(); // Function ShooterGame.DesignableUserWidget.OnSynchronizeProperties // (Native|Event|Public|BlueprintEvent) // @ game+0x39a1040
};

// Class ShooterGame.CoordinatedHUDElement
// Size: 0x2d8 (Inherited: 0x2c8)
struct UCoordinatedHUDElement : UDesignableUserWidget {
	bool bShowMouseWhenVisible; // 0x2c8(0x01)
	bool bCaptureMouseWhenVisible; // 0x2c9(0x01)
	bool bCaptureMouseWhenOverridden; // 0x2ca(0x01)
	char pad_2CB[0x1]; // 0x2cb(0x01)
	int32_t AllowedGameInputWhileVisible; // 0x2cc(0x04)
	int32_t AllowedGameInputWhileShowingMouse; // 0x2d0(0x04)
	bool bNeedsFocus; // 0x2d4(0x01)
	char pad_2D5[0x3]; // 0x2d5(0x03)

	void SetHUDModel(struct UCoordinatedHUDModel* HUDModel); // Function ShooterGame.CoordinatedHUDElement.SetHUDModel // (Native|Event|Public|BlueprintCallable|BlueprintEvent) // @ game+0x382d5c0
	void SetCoordinatedShooterUIModel(struct UCoordinatedShooterUIModel* CoordinatedShooterUIModel); // Function ShooterGame.CoordinatedHUDElement.SetCoordinatedShooterUIModel // (Event|Public|BlueprintCallable|BlueprintEvent) // @ game+0x4282c30
};

// Class ShooterGame.AllyEdgeIndicatorHUD
// Size: 0x348 (Inherited: 0x2d8)
struct UAllyEdgeIndicatorHUD : UCoordinatedHUDElement {
	char pad_2D8[0x18]; // 0x2d8(0x18)
	struct FMulticastInlineDelegate OnAllyEnterRange; // 0x2f0(0x10)
	struct FMulticastInlineDelegate OnAllyExitRange; // 0x300(0x10)
	struct FMulticastInlineDelegate OnAllyDeath; // 0x310(0x10)
	float RelevantRangeModifier; // 0x320(0x04)
	char pad_324[0x4]; // 0x324(0x04)
	struct TArray<struct UHUDPlayerModel*> TrackedHUDPlayerModelsList; // 0x328(0x10)
	struct UCoordinatedHUDModel* HUDModel; // 0x338(0x08)
	struct APlayerState* CurrentlyTrackedPlayerState; // 0x340(0x08)

	void SetHUDModel_Implementation(struct UCoordinatedHUDModel* InHUDModel); // Function ShooterGame.AllyEdgeIndicatorHUD.SetHUDModel_Implementation // (Final|Native|Private) // @ game+0x382d5c0
	void RemoveTrackedPlayer(struct UHUDPlayerModel* PlayerHUDModel, bool Died); // Function ShooterGame.AllyEdgeIndicatorHUD.RemoveTrackedPlayer // (Final|Native|Private) // @ game+0x382d2f0
	void OnPlayerDeath(struct UDamageResponse* Response); // Function ShooterGame.AllyEdgeIndicatorHUD.OnPlayerDeath // (Final|Native|Private) // @ game+0x382d1b0
	void OnHUDPlayerModelListUpdated(); // Function ShooterGame.AllyEdgeIndicatorHUD.OnHUDPlayerModelListUpdated // (Final|Native|Private) // @ game+0x382cff0
	void OnHUDModelSet(struct UCoordinatedHUDModel* InHUDModel); // Function ShooterGame.AllyEdgeIndicatorHUD.OnHUDModelSet // (Event|Protected|BlueprintEvent) // @ game+0x4282c30
	struct TArray<struct UHUDPlayerModel*> GetAllAlliesInRange(); // Function ShooterGame.AllyEdgeIndicatorHUD.GetAllAlliesInRange // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x382ca10
	void CheckForAndHandleTrackedPlayerChange(struct AAresPlayerStateBase* PlayerState); // Function ShooterGame.AllyEdgeIndicatorHUD.CheckForAndHandleTrackedPlayerChange // (Final|Native|Private) // @ game+0x382c870
	void AddTrackedPlayer(struct UHUDPlayerModel* PlayerHUDModel); // Function ShooterGame.AllyEdgeIndicatorHUD.AddTrackedPlayer // (Final|Native|Private) // @ game+0x382c410
};

// Class ShooterGame.AmmoComponent
// Size: 0x158 (Inherited: 0x138)
struct UAmmoComponent : UResourceComponent {
	bool bInfiniteReserveAmmo; // 0x138(0x01)
	char pad_139[0x3]; // 0x139(0x03)
	int32_t Ammo; // 0x13c(0x04)
	int32_t MaxAmmo; // 0x140(0x04)
	char pad_144[0x4]; // 0x144(0x04)
	struct UAmmoComponent* ReserveComponent; // 0x148(0x08)
	bool bInBeginPlay; // 0x150(0x01)
	char pad_151[0x7]; // 0x151(0x07)

	void UpdateMaxAmmo(int32_t NewMax); // Function ShooterGame.AmmoComponent.UpdateMaxAmmo // (Final|Native|Public|BlueprintCallable) // @ game+0x382db40
	void SetReserveComponent(struct UAmmoComponent* AmmoComponent); // Function ShooterGame.AmmoComponent.SetReserveComponent // (Final|Native|Public|BlueprintCallable) // @ game+0x382d990
	void SetMaxReserveAmmo(bool bInfiniteReserve, int32_t NewMax); // Function ShooterGame.AmmoComponent.SetMaxReserveAmmo // (Final|Native|Public|BlueprintCallable) // @ game+0x382d650
	void Reload(int32_t ReloadAmount); // Function ShooterGame.AmmoComponent.Reload // (Final|Native|Public|BlueprintCallable) // @ game+0x382d260
	void OnRep_MaxAmmoValue(); // Function ShooterGame.AmmoComponent.OnRep_MaxAmmoValue // (Final|Native|Private) // @ game+0x382d240
	void OnRep_bInfiniteReserveAmmoValue(); // Function ShooterGame.AmmoComponent.OnRep_bInfiniteReserveAmmoValue // (Final|Native|Private) // @ game+0x382d240
	struct UAmmoComponent* GetReserveComponent(); // Function ShooterGame.AmmoComponent.GetReserveComponent // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x382cd60
	int32_t GetMaxAmmo(); // Function ShooterGame.AmmoComponent.GetMaxAmmo // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x382cd30
	int32_t GetAmmo(); // Function ShooterGame.AmmoComponent.GetAmmo // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x3803300
	void FullReload(); // Function ShooterGame.AmmoComponent.FullReload // (Final|Native|Public|BlueprintCallable) // @ game+0x382c990
	bool CanReload(); // Function ShooterGame.AmmoComponent.CanReload // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x382c840
};

// Class ShooterGame.AnimatableUserWidget
// Size: 0x2e0 (Inherited: 0x2c8)
struct UAnimatableUserWidget : UDesignableUserWidget {
	char pad_2C8[0x8]; // 0x2c8(0x08)
	struct FMulticastInlineDelegate OnScopedCueEvent; // 0x2d0(0x10)

	void BroadcastCueEvent(struct FScopedAnimationCueSource_ScopedCueEventData& EventData); // Function ShooterGame.AnimatableUserWidget.BroadcastCueEvent // (Final|Native|Protected|HasOutParms|BlueprintCallable) // @ game+0x382c7a0
	void BP_BroadcastNewCueEvent(struct FName CueName, struct FName ScopeName); // Function ShooterGame.AnimatableUserWidget.BP_BroadcastNewCueEvent // (Final|Native|Protected|BlueprintCallable) // @ game+0x382c540
};

// Class ShooterGame.ZoomComponent
// Size: 0x528 (Inherited: 0xe8)
struct UZoomComponent : UActorComponent {
	char pad_E8[0x8]; // 0xe8(0x08)
	struct FMulticastInlineDelegate OnZoomInStarted; // 0xf0(0x10)
	struct FMulticastInlineDelegate OnZoomInCompleted; // 0x100(0x10)
	struct FMulticastInlineDelegate OnUnZoomStarted; // 0x110(0x10)
	struct FMulticastInlineDelegate OnUnZoomCompleted; // 0x120(0x10)
	struct FMulticastInlineDelegate OnZoomTransitionStatusChanged; // 0x130(0x10)
	struct FMulticastInlineDelegate OnCosmeticZoomInPercent; // 0x140(0x10)
	struct FMulticastInlineDelegate OnZoomCooldownCompleted; // 0x150(0x10)
	struct FZoomTransitionSettings ZoomTransitionSettings; // 0x160(0x14)
	char pad_174[0x4]; // 0x174(0x04)
	struct UCurveFloat* ZoomInCurve; // 0x178(0x08)
	struct UCurveFloat* ZoomOutCurve; // 0x180(0x08)
	struct FRuntimeFloatCurve FoVInitialZoomInCurve; // 0x188(0x88)
	struct FRuntimeFloatCurve FoVSubsequentZoomInCurve; // 0x210(0x88)
	struct FRuntimeFloatCurve FoVZoomOutCurve; // 0x298(0x88)
	struct FRuntimeFloatCurve FoV1PInitialZoomInCurve; // 0x320(0x88)
	struct FRuntimeFloatCurve FoV1PSubsequentZoomInCurve; // 0x3a8(0x88)
	struct FRuntimeFloatCurve FoV1PZoomOutCurve; // 0x430(0x88)
	struct TArray<struct FZoomLevelInfo> ZoomLevelInfo; // 0x4b8(0x10)
	struct FZoomTransition AuthZoomTransition; // 0x4c8(0x24)
	struct FZoomTransition ClientPredictedZoomTransition; // 0x4ec(0x24)
	struct FTimerHandle ZoomTimer[0x3]; // 0x510(0x18)

	void SetZoomMultiplierForIndex(int32_t ZoomIndex, float NewMultiplier); // Function ShooterGame.ZoomComponent.SetZoomMultiplierForIndex // (Final|Native|Public|BlueprintCallable) // @ game+0x3ea98d0
	void SetZoomFovForIndex(int32_t ZoomIndex, float NewFov); // Function ShooterGame.ZoomComponent.SetZoomFovForIndex // (Final|Native|Public|BlueprintCallable) // @ game+0x3ea9800
	void SetTransitionSettings(struct FZoomTransitionSettings& InTransitionSettings); // Function ShooterGame.ZoomComponent.SetTransitionSettings // (Final|Native|Public|HasOutParms|BlueprintCallable) // @ game+0x3ea9480
	void OnZoomTransitionTimerCompleted(); // Function ShooterGame.ZoomComponent.OnZoomTransitionTimerCompleted // (Final|Native|Private) // @ game+0x3ea8ec0
	void OnZoomCooldownTimerCompleted(); // Function ShooterGame.ZoomComponent.OnZoomCooldownTimerCompleted // (Final|Native|Private) // @ game+0x3ea8ce0
	void OnRep_ZoomTransition(); // Function ShooterGame.ZoomComponent.OnRep_ZoomTransition // (Final|Native|Private) // @ game+0x3ea8cc0
	void OnCosmeticZoomInPercentTriggerTimerCompleted(); // Function ShooterGame.ZoomComponent.OnCosmeticZoomInPercentTriggerTimerCompleted // (Final|Native|Private) // @ game+0x3ea8bb0
	bool IsZoomTransitioning(); // Function ShooterGame.ZoomComponent.IsZoomTransitioning // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x3ea8ac0
	bool IsZoomOnCooldown(); // Function ShooterGame.ZoomComponent.IsZoomOnCooldown // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x3ea8a90
	bool IsZoomingOut(); // Function ShooterGame.ZoomComponent.IsZoomingOut // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x3ea8b80
	bool IsZoomingIn(); // Function ShooterGame.ZoomComponent.IsZoomingIn // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x3ea8b50
	bool IsZoomedOut(); // Function ShooterGame.ZoomComponent.IsZoomedOut // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x3ea8b20
	bool IsZoomed(); // Function ShooterGame.ZoomComponent.IsZoomed // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x3ea8af0
	int32_t GetTargetZoomLevel(); // Function ShooterGame.ZoomComponent.GetTargetZoomLevel // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x3ea8790
	int32_t GetNumZoomLevels(); // Function ShooterGame.ZoomComponent.GetNumZoomLevels // (Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x3ea8750
	int32_t GetCurrentZoomLevel(); // Function ShooterGame.ZoomComponent.GetCurrentZoomLevel // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x3ea86e0
};

// Class ShooterGame.AnimatedZoomComponent
// Size: 0x538 (Inherited: 0x528)
struct UAnimatedZoomComponent : UZoomComponent {
	float WorldFOVMin; // 0x528(0x04)
	float WorldFOVMax; // 0x52c(0x04)
	float Mesh1PFOVMin; // 0x530(0x04)
	float Mesh1PFOVMax; // 0x534(0x04)
};

// Class ShooterGame.ProgressModel
// Size: 0x30 (Inherited: 0x30)
struct UProgressModel : UInterface {

	void UnbindProgressStateChanged(struct FDelegate& Delegate); // Function ShooterGame.ProgressModel.UnbindProgressStateChanged // (Native|Public|HasOutParms|BlueprintCallable|Const) // @ game+0x3b92070
	void UnbindProgressCompleted(struct FDelegate& Delegate); // Function ShooterGame.ProgressModel.UnbindProgressCompleted // (Native|Public|HasOutParms|BlueprintCallable|Const) // @ game+0x3ca8290
	struct FProgressModelState GetProgressState(); // Function ShooterGame.ProgressModel.GetProgressState // (Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x3ca7830
	void BindProgressStateChanged(struct FDelegate& Delegate); // Function ShooterGame.ProgressModel.BindProgressStateChanged // (Native|Public|HasOutParms|BlueprintCallable|Const) // @ game+0x396cff0
	void BindProgressCompleted(struct FDelegate& Delegate); // Function ShooterGame.ProgressModel.BindProgressCompleted // (Native|Public|HasOutParms|BlueprintCallable|Const) // @ game+0x3bf3b30
};

// Class ShooterGame.AnimationConductorNode
// Size: 0x30 (Inherited: 0x30)
struct UAnimationConductorNode : UProgressModel {

	void StartAnimation(); // Function ShooterGame.AnimationConductorNode.StartAnimation // (Native|Public|BlueprintCallable) // @ game+0x382da50
	void SkipAnimation(); // Function ShooterGame.AnimationConductorNode.SkipAnimation // (Native|Public|BlueprintCallable) // @ game+0x382da20
	void SetDebugLogging(bool bNewValue, enum class EAnimationConductorNodePropagationMode PropagationMode); // Function ShooterGame.AnimationConductorNode.SetDebugLogging // (Native|Public|BlueprintCallable) // @ game+0x382d450
	void ResetAnimation(enum class EAnimationConductorNodeResetType ResetType); // Function ShooterGame.AnimationConductorNode.ResetAnimation // (Native|Public|BlueprintCallable) // @ game+0x382d3c0
};

// Class ShooterGame.ProgressModelBase
// Size: 0x58 (Inherited: 0x30)
struct UProgressModelBase : UObject {
	char pad_30[0x28]; // 0x30(0x28)

	void BroadcastProgressStateChanged(); // Function ShooterGame.ProgressModelBase.BroadcastProgressStateChanged // (Final|Native|Protected|BlueprintCallable) // @ game+0x3ca7270
	void BroadcastProgressCompleted(); // Function ShooterGame.ProgressModelBase.BroadcastProgressCompleted // (Final|Native|Protected|BlueprintCallable) // @ game+0x3ca7250
};

// Class ShooterGame.NumericProgressModelBase
// Size: 0x70 (Inherited: 0x58)
struct UNumericProgressModelBase : UProgressModelBase {
	char pad_58[0x18]; // 0x58(0x18)

	void BroadcastProgressValueChanged(); // Function ShooterGame.NumericProgressModelBase.BroadcastProgressValueChanged // (Final|Native|Protected|BlueprintCallable) // @ game+0x3bf2ec0
};

// Class ShooterGame.ManualNumericProgressModelBase
// Size: 0x88 (Inherited: 0x70)
struct UManualNumericProgressModelBase : UNumericProgressModelBase {
	char pad_70[0x18]; // 0x70(0x18)

	void BP_SetProgressValueMaximum(int64_t NewValue); // Function ShooterGame.ManualNumericProgressModelBase.BP_SetProgressValueMaximum // (Final|Native|Protected|BlueprintCallable) // @ game+0x3ba2a90
	void BP_SetProgressValueCurrent(int64_t NewValue); // Function ShooterGame.ManualNumericProgressModelBase.BP_SetProgressValueCurrent // (Final|Native|Protected|BlueprintCallable) // @ game+0x3ba2a00
	void BP_SetProgressValue(struct FNumericProgressValue& NewValue); // Function ShooterGame.ManualNumericProgressModelBase.BP_SetProgressValue // (Final|Native|Protected|HasOutParms|BlueprintCallable) // @ game+0x3ba2960
	void BP_SetProgressState(struct FProgressModelState NewValue); // Function ShooterGame.ManualNumericProgressModelBase.BP_SetProgressState // (Final|Native|Protected|BlueprintCallable) // @ game+0x3ba28e0
	void BP_CompleteProgress(); // Function ShooterGame.ManualNumericProgressModelBase.BP_CompleteProgress // (Final|Native|Protected|BlueprintCallable) // @ game+0x3ba28c0
	void BP_ClearProgressValue(); // Function ShooterGame.ManualNumericProgressModelBase.BP_ClearProgressValue // (Final|Native|Protected|BlueprintCallable) // @ game+0x3ba28a0
};

// Class ShooterGame.AnimationConductorNodeBase
// Size: 0xa8 (Inherited: 0x88)
struct UAnimationConductorNodeBase : UManualNumericProgressModelBase {
	char pad_88[0x20]; // 0x88(0x20)

	void BP_BroadcastNewCueEvent(struct FName CueName); // Function ShooterGame.AnimationConductorNodeBase.BP_BroadcastNewCueEvent // (Final|Native|Protected|BlueprintCallable) // @ game+0x382c640
	void BP_BroadcastCueEvent(struct FAnimationCueSource_CueEventData& EventData); // Function ShooterGame.AnimationConductorNodeBase.BP_BroadcastCueEvent // (Final|Native|Protected|HasOutParms|BlueprintCallable) // @ game+0x382c4a0
};

// Class ShooterGame.AnimationConductorNodeBlueprintLibrary
// Size: 0x30 (Inherited: 0x30)
struct UAnimationConductorNodeBlueprintLibrary : UBlueprintFunctionLibrary {

	void DumpToLog(struct TScriptInterface<IAnimationConductorNode> Target); // Function ShooterGame.AnimationConductorNodeBlueprintLibrary.DumpToLog // (Final|Native|Static|Public|BlueprintCallable) // @ game+0x382c900
};

// Class ShooterGame.AnimationCueSource
// Size: 0x30 (Inherited: 0x30)
struct UAnimationCueSource : UInterface {

	void UnbindOnCueEvent(struct FDelegate& Delegate); // Function ShooterGame.AnimationCueSource.UnbindOnCueEvent // (Native|Event|Public|HasOutParms|BlueprintCallable|BlueprintEvent) // @ game+0x382da80
	void BindOnCueEvent(struct FDelegate& Delegate); // Function ShooterGame.AnimationCueSource.BindOnCueEvent // (Native|Event|Public|HasOutParms|BlueprintCallable|BlueprintEvent) // @ game+0x382c6e0
};

// Class ShooterGame.AnimationCueSourceBlueprintLibrary
// Size: 0x30 (Inherited: 0x30)
struct UAnimationCueSourceBlueprintLibrary : UBlueprintFunctionLibrary {

	struct FScopedAnimationCueSource_ScopedCueEventData MakeNewScopedCueEventData(struct FName InCueName, struct FName InScopeName); // Function ShooterGame.AnimationCueSourceBlueprintLibrary.MakeNewScopedCueEventData // (Final|Native|Static|Public|BlueprintCallable) // @ game+0x382ce40
	struct FAnimationCueSource_CueEventData MakeNewCueEventData(struct FName InCueName); // Function ShooterGame.AnimationCueSourceBlueprintLibrary.MakeNewCueEventData // (Final|Native|Static|Public|BlueprintCallable) // @ game+0x382cd90
};

// Class ShooterGame.AnimationStateComponent
// Size: 0xc30 (Inherited: 0xe8)
struct UAnimationStateComponent : UActorComponent {
	char pad_E8[0x18]; // 0xe8(0x18)
	struct FAnimationStateParams AnimationStateParams; // 0x100(0x1e8)
	struct FAnimationAssetsGun1P AnimationAssetsGun1P; // 0x2e8(0x48)
	struct FAnimationAssetsGun1P CosmeticAnimationAssetsGun1P; // 0x330(0x48)
	struct FBoneTransformAim3P BoneTransformAim3P; // 0x378(0x74)
	char pad_3EC[0x1]; // 0x3ec(0x01)
	bool bIsOnRope; // 0x3ed(0x01)
	bool bGlideActive; // 0x3ee(0x01)
	bool bIsMeleeAttacking; // 0x3ef(0x01)
	bool bForceAnimSlot1PNoBlend; // 0x3f0(0x01)
	bool bForceAnimSlotUpperBody3PNoBlend; // 0x3f1(0x01)
	bool bForceAnimSlotLowerBody3PNoBlend; // 0x3f2(0x01)
	char pad_3F3[0x1]; // 0x3f3(0x01)
	float MaxErrorDegrees; // 0x3f4(0x04)
	char pad_3F8[0x4]; // 0x3f8(0x04)
	float ErrorAnimationInterpolationRate; // 0x3fc(0x04)
	float WeaponInaccuracySpring1PStiffness; // 0x400(0x04)
	float WeaponInaccuracySpring1PDampening; // 0x404(0x04)
	float DefaultHitReactionBlendTime; // 0x408(0x04)
	float HitReactionAlpha; // 0x40c(0x04)
	bool bHitReactionTriggeredThisFrame; // 0x410(0x01)
	char pad_411[0x3]; // 0x411(0x03)
	float CrouchLowerBodyMontageAlpha; // 0x414(0x04)
	float CrouchSplitterTranslationScale; // 0x418(0x04)
	float RopeSpineBlendWeightScale; // 0x41c(0x04)
	bool bDisableSplitBodyRotation; // 0x420(0x01)
	char pad_421[0x43]; // 0x421(0x43)
	float AnimDynamicsBlendTime; // 0x464(0x04)
	float AimModeBlendTime; // 0x468(0x04)
	float IkBlendTime; // 0x46c(0x04)
	float FootIKMaxActorPullDownDistance; // 0x470(0x04)
	float FootIKActorPullDownInterpRate; // 0x474(0x04)
	float FootIKRootScalar; // 0x478(0x04)
	char pad_47C[0x4]; // 0x47c(0x04)
	struct UCurveFloat* FootIKEnableCurve; // 0x480(0x08)
	float AnimSlotBlendTime; // 0x488(0x04)
	float Idle1PBlendTime; // 0x48c(0x04)
	float Run1PBlendTime; // 0x490(0x04)
	float Walk1PBlendTime; // 0x494(0x04)
	float Crouch1PBlendTime; // 0x498(0x04)
	float CrouchIdle1PBlendTime; // 0x49c(0x04)
	float CrouchWalk1PBlendTime; // 0x4a0(0x04)
	float StandUp1PBlendTime; // 0x4a4(0x04)
	float Jump1PBlendTime; // 0x4a8(0x04)
	float JumpLand1PBlendTime; // 0x4ac(0x04)
	float BoneTransformAimPitchAngleLimit; // 0x4b0(0x04)
	float BoneTransformAimPitchMultiplier; // 0x4b4(0x04)
	float BoneTransformAimYawMultiplier; // 0x4b8(0x04)
	float Spine1AimRotationScale; // 0x4bc(0x04)
	float Spine2AimRotationScale; // 0x4c0(0x04)
	float Spine3AimRotationScale; // 0x4c4(0x04)
	float Spine4AimRotationScale; // 0x4c8(0x04)
	float NeckAimRotationScale; // 0x4cc(0x04)
	float HeadAimRotationScale; // 0x4d0(0x04)
	float LeftClavicleAimRotationScale; // 0x4d4(0x04)
	float RightClavicleAimRotationScale; // 0x4d8(0x04)
	float AimSpring1PTargetRotationScale; // 0x4dc(0x04)
	float RecentlyFiredTime; // 0x4e0(0x04)
	float MinCounterStrafeAngle; // 0x4e4(0x04)
	bool bCanGlide; // 0x4e8(0x01)
	char pad_4E9[0x7]; // 0x4e9(0x07)
	struct TMap<struct UAnimSlot1P*, struct UAnimationAsset*> Anims1P; // 0x4f0(0x50)
	struct TMap<struct UAnimSlotUpperBody3P*, struct UAnimationAsset*> AnimsUpperBody3P; // 0x540(0x50)
	struct TMap<struct UAnimSlotLowerBody3P*, struct UAnimationAsset*> AnimsLowerBody3P; // 0x590(0x50)
	struct TMap<struct UAnimSlot1P*, struct UAnimationAsset*> OverrideAnims1P; // 0x5e0(0x50)
	struct TMap<struct UAnimSlotUpperBody3P*, struct UAnimationAsset*> OverrideAnimsUpperBody3P; // 0x630(0x50)
	struct TMap<struct UAnimSlotLowerBody3P*, struct UAnimationAsset*> OverrideAnimsLowerBody3P; // 0x680(0x50)
	struct TArray<struct UBlendSpace*> HeadHitReactions3P; // 0x6d0(0x10)
	struct TArray<struct UBlendSpace*> BodyHitReactions3P; // 0x6e0(0x10)
	struct TArray<struct UBlendSpace*> LegHitReactions3P; // 0x6f0(0x10)
	struct TMap<struct UAnimSlotFace3P*, struct UAnimSequence*> AnimsFace3P; // 0x700(0x50)
	struct TArray<struct UAnimSequence*> FaceFidgets3P; // 0x750(0x10)
	float FaceFidgetDelayMin; // 0x760(0x04)
	float FaceFidgetDelayMax; // 0x764(0x04)
	float FaceFidgetDelayLength; // 0x768(0x04)
	float FaceFidgetDelayTimer; // 0x76c(0x04)
	float FaceFidgetPlayLength; // 0x770(0x04)
	float FaceFidgetPlayTimer; // 0x774(0x04)
	struct FAlphaBlend ZoomedModeAlphaBlend; // 0x778(0x30)
	bool bDisabled; // 0x7a8(0x01)
	char pad_7A9[0x7]; // 0x7a9(0x07)
	struct FTransform GunToScopeTransform; // 0x7b0(0x30)
	struct UCurveFloat* ADSWeaponRecoveryCurve; // 0x7e0(0x08)
	char pad_7E8[0x160]; // 0x7e8(0x160)
	struct FAnimationSlotArray UpperBodyAimOffsets; // 0x948(0x18)
	struct FAnimationSlotArray LowerBodyAimOffsets; // 0x960(0x18)
	struct FVector ReticlePosition; // 0x978(0x0c)
	bool bHasReticlePosition; // 0x984(0x01)
	char pad_985[0x3]; // 0x985(0x03)
	struct FName ADSIdleRefBoneName; // 0x988(0x0c)
	char pad_994[0x9c]; // 0x994(0x9c)
	struct AAresEquippable* LastEquippable; // 0xa30(0x08)
	char pad_A38[0x8]; // 0xa38(0x08)
	struct UAnimMovementStateMachine* MovementStateMachine; // 0xa40(0x08)
	bool bLastFirstPerson; // 0xa48(0x01)
	char pad_A49[0x3]; // 0xa49(0x03)
	float LastActorYaw; // 0xa4c(0x04)
	float LastTimeFired; // 0xa50(0x04)
	int32_t UpdateRateLimitingDisable3PRefCount; // 0xa54(0x04)
	bool bCachedEnableUpdateRateOptimizations; // 0xa58(0x01)
	char pad_A59[0x3]; // 0xa59(0x03)
	int32_t FaceLayerDisableRefCount; // 0xa5c(0x04)
	int32_t CharacterIsFiringRefCount; // 0xa60(0x04)
	char pad_A64[0x4]; // 0xa64(0x04)
	struct UNetworkedRandomNumberGeneratorComponent* NetworkedRandomNumberGeneratorComponent; // 0xa68(0x08)
	float ADSKickBackDistance; // 0xa70(0x04)
	char pad_A74[0xc]; // 0xa74(0x0c)
	struct FTransform ADSIdleRefTransform; // 0xa80(0x30)
	bool bEnteredClientRelevancy; // 0xab0(0x01)
	bool bJustRespawned; // 0xab1(0x01)
	char pad_AB2[0x17e]; // 0xab2(0x17e)

	void SetOverrideAnimationUpperBody3P(struct UAnimSlotUpperBody3P* Slot, struct UAnimationAsset* AnimAsset); // Function ShooterGame.AnimationStateComponent.SetOverrideAnimationUpperBody3P // (Final|Native|Public|BlueprintCallable) // @ game+0x382d8c0
	void SetOverrideAnimationLowerBody3P(struct UAnimSlotLowerBody3P* Slot, struct UAnimationAsset* AnimAsset); // Function ShooterGame.AnimationStateComponent.SetOverrideAnimationLowerBody3P // (Final|Native|Public|BlueprintCallable) // @ game+0x382d7f0
	void SetOverrideAnimation1P(struct UAnimSlot1P* Slot, struct UAnimationAsset* AnimAsset); // Function ShooterGame.AnimationStateComponent.SetOverrideAnimation1P // (Final|Native|Public|BlueprintCallable) // @ game+0x382d720
	void SetDisableMontageSpineBlendWeight(bool Disable); // Function ShooterGame.AnimationStateComponent.SetDisableMontageSpineBlendWeight // (Final|Native|Public|BlueprintCallable) // @ game+0x382d530
	void OnMontageStart(struct UAnimMontage* Montage); // Function ShooterGame.AnimationStateComponent.OnMontageStart // (Final|Native|Private) // @ game+0x382d120
	void OnMeshVisibilityUpdated(struct AShooterCharacter* Character, bool bFirstPersonVisible, bool bThirdPersonVisible); // Function ShooterGame.AnimationStateComponent.OnMeshVisibilityUpdated // (Final|Native|Private) // @ game+0x382d010
	void OnClientBecomeRelevant(struct AActor* OwningActor); // Function ShooterGame.AnimationStateComponent.OnClientBecomeRelevant // (Final|Native|Public) // @ game+0x382cf60
	float GetIKAlpha(struct FName& BoneName); // Function ShooterGame.AnimationStateComponent.GetIKAlpha // (Final|Native|Public|HasOutParms|BlueprintCallable|BlueprintPure|Const) // @ game+0x382cc80
	int32_t GetAnimationUpperBody3PActiveIndex(struct UAnimSlotUpperBody3P* Slot); // Function ShooterGame.AnimationStateComponent.GetAnimationUpperBody3PActiveIndex // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x382cbe0
	int32_t GetAnimationLowerBody3PActiveIndex(struct UAnimSlotLowerBody3P* Slot); // Function ShooterGame.AnimationStateComponent.GetAnimationLowerBody3PActiveIndex // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x382cb40
	struct UAnimationAsset* GetAnimationGun1P(struct UAnimSlotGun1P* Slot); // Function ShooterGame.AnimationStateComponent.GetAnimationGun1P // (Final|Native|Public|BlueprintCallable|BlueprintPure) // @ game+0x382caa0
	int32_t GetAimOffsetUpperBody3PActiveIndex(); // Function ShooterGame.AnimationStateComponent.GetAimOffsetUpperBody3PActiveIndex // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x382c9f0
	int32_t GetAimOffsetLowerBody3PLastValidActiveIndex(); // Function ShooterGame.AnimationStateComponent.GetAimOffsetLowerBody3PLastValidActiveIndex // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x382c9d0
	int32_t GetAimOffsetLowerBody3PActiveIndex(); // Function ShooterGame.AnimationStateComponent.GetAimOffsetLowerBody3PActiveIndex // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x382c9b0
};

// Class ShooterGame.AnimDynamicStateInfo
// Size: 0x30 (Inherited: 0x30)
struct UAnimDynamicStateInfo : UInterface {
};

// Class ShooterGame.AnimMovementStateMachine
// Size: 0xe8 (Inherited: 0x30)
struct UAnimMovementStateMachine : UObject {
	char pad_30[0xb8]; // 0x30(0xb8)
};

// Class ShooterGame.AnimNotifyState_AnimDynamic
// Size: 0x38 (Inherited: 0x38)
struct UAnimNotifyState_AnimDynamic : UAnimNotifyState {
};

// Class ShooterGame.AnimNotifyState_BoneTransformAim
// Size: 0x50 (Inherited: 0x38)
struct UAnimNotifyState_BoneTransformAim : UAnimNotifyState {
	struct FBoneReference ConstraintBone; // 0x38(0x14)
	char pad_4C[0x4]; // 0x4c(0x04)
};

// Class ShooterGame.AnimNotifyState_CanInterruptDeathReaction
// Size: 0x38 (Inherited: 0x38)
struct UAnimNotifyState_CanInterruptDeathReaction : UAnimNotifyState {
};

// Class ShooterGame.AnimNotifyState_CanTransition
// Size: 0x40 (Inherited: 0x38)
struct UAnimNotifyState_CanTransition : UAnimNotifyState {
	enum class EAnimMovementStateMachineState FromState; // 0x38(0x01)
	char pad_39[0x7]; // 0x39(0x07)
};

// Class ShooterGame.AnimNotifyState_CharacterIsFiring
// Size: 0x38 (Inherited: 0x38)
struct UAnimNotifyState_CharacterIsFiring : UAnimNotifyState {
};

// Class ShooterGame.AnimNotifyState_DisableAnimUpdateRateOptimizations
// Size: 0x40 (Inherited: 0x38)
struct UAnimNotifyState_DisableAnimUpdateRateOptimizations : UAnimNotifyState {
	bool Disabled; // 0x38(0x01)
	char pad_39[0x7]; // 0x39(0x07)
};

// Class ShooterGame.AnimNotifyState_DisableFaceLayer
// Size: 0x38 (Inherited: 0x38)
struct UAnimNotifyState_DisableFaceLayer : UAnimNotifyState {
};

// Class ShooterGame.AnimNotifyState_EquippableCharacterAltAnims
// Size: 0x38 (Inherited: 0x38)
struct UAnimNotifyState_EquippableCharacterAltAnims : UAnimNotifyState {
};

// Class ShooterGame.AnimNotifyState_IKEnabled
// Size: 0x50 (Inherited: 0x38)
struct UAnimNotifyState_IKEnabled : UAnimNotifyState {
	struct FBoneReference Bone; // 0x38(0x14)
	bool Enabled; // 0x4c(0x01)
	char pad_4D[0x3]; // 0x4d(0x03)
};

// Class ShooterGame.AnimSlot
// Size: 0x38 (Inherited: 0x38)
struct UAnimSlot : UDataAsset {
};

// Class ShooterGame.AnimSlot1P
// Size: 0x38 (Inherited: 0x38)
struct UAnimSlot1P : UAnimSlot {
};

// Class ShooterGame.AnimSlotFace3P
// Size: 0x38 (Inherited: 0x38)
struct UAnimSlotFace3P : UAnimSlot {
};

// Class ShooterGame.AnimSlotGun1P
// Size: 0x38 (Inherited: 0x38)
struct UAnimSlotGun1P : UAnimSlot {
};

// Class ShooterGame.AnimSlotLowerBody3P
// Size: 0x38 (Inherited: 0x38)
struct UAnimSlotLowerBody3P : UAnimSlot {
};

// Class ShooterGame.AnimSlotUpperBody3P
// Size: 0x38 (Inherited: 0x38)
struct UAnimSlotUpperBody3P : UAnimSlot {
};

// Class ShooterGame.StateTransitionContext
// Size: 0x30 (Inherited: 0x30)
struct UStateTransitionContext : UObject {

	void Reset(); // Function ShooterGame.StateTransitionContext.Reset // (Native|Event|Public|BlueprintEvent) // @ game+0x399aeb0
	void OnReset(); // Function ShooterGame.StateTransitionContext.OnReset // (Event|Public|BlueprintEvent) // @ game+0x4282c30
	bool IsValueDisagreement(struct UStateTransitionContext* Rhs); // Function ShooterGame.StateTransitionContext.IsValueDisagreement // (Native|Event|Public|BlueprintEvent) // @ game+0x3a11d80
	struct FString GetDebugString(); // Function ShooterGame.StateTransitionContext.GetDebugString // (Native|Event|Public|BlueprintEvent) // @ game+0x3e202a0
};

// Class ShooterGame.AnimTriggeredStateContinueTransitionContext
// Size: 0x30 (Inherited: 0x30)
struct UAnimTriggeredStateContinueTransitionContext : UStateTransitionContext {
};

// Class ShooterGame.AnimTriggeredStateComponent
// Size: 0x408 (Inherited: 0x3e8)
struct UAnimTriggeredStateComponent : URespondToEventStateComponent {
	struct UAnimMontage* TriggeringAnimation; // 0x3e8(0x08)
	struct TArray<struct FNotifyTriggerType> NotifyTriggers; // 0x3f0(0x10)
	char pad_400[0x8]; // 0x400(0x08)

	void AddManualTrigger(float TriggerTime, struct UScriptStateComponent* TriggeredState, bool bReturningState); // Function ShooterGame.AnimTriggeredStateComponent.AddManualTrigger // (Final|Native|Public|BlueprintCallable) // @ game+0x3837e30
	void AddAnimationTrigger(struct TSoftClassPtr<UObject> NotifyType, struct UScriptStateComponent* TriggeredState, bool bReturningState); // Function ShooterGame.AnimTriggeredStateComponent.AddAnimationTrigger // (Final|Native|Public|BlueprintCallable) // @ game+0x3837950
};

// Class ShooterGame.AntiAddictionManager
// Size: 0x110 (Inherited: 0x80)
struct UAntiAddictionManager : UInitSystem {
	struct FMulticastInlineDelegate OnAntiAddictionWarningNotification; // 0x80(0x10)
	char pad_90[0x28]; // 0x90(0x28)
	struct UAntiAddictionService* AntiAddictionService; // 0xb8(0x08)
	struct UNotificationManager* NotificationManager; // 0xc0(0x08)
	struct UConfigManager* ConfigManager; // 0xc8(0x08)
	struct URMSManager* RMSManager; // 0xd0(0x08)
	struct FText ShutdownText; // 0xd8(0x18)
	char pad_F0[0x20]; // 0xf0(0x20)

	bool IsShutdown(); // Function ShooterGame.AntiAddictionManager.IsShutdown // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x38394f0
	bool IsRestricted(); // Function ShooterGame.AntiAddictionManager.IsRestricted // (Final|Native|Public|Const) // @ game+0x38394c0
	struct FText GetShutdownText(); // Function ShooterGame.AntiAddictionManager.GetShutdownText // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x3838c80
	struct UAntiAddictionManager* GetAntiAddictionManager(struct UObject* WorldContextObject); // Function ShooterGame.AntiAddictionManager.GetAntiAddictionManager // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x38383e0
};

// Class ShooterGame.AntiAddictionService
// Size: 0xc0 (Inherited: 0x30)
struct UAntiAddictionService : UObject {
	struct URiotGamesApiClient* RiotGamesApiClient; // 0x30(0x08)
	struct UConfigManager* ConfigManager; // 0x38(0x08)
	char pad_40[0x10]; // 0x40(0x10)
	struct FString AntiAddictionShutdownResource; // 0x50(0x10)
	struct FString AntiAddictionPlayTimeResource; // 0x60(0x10)
	struct FString AntiAddictionWarningResource; // 0x70(0x10)
	struct FString AntiAddictionDisableMatchmakingResource; // 0x80(0x10)
	struct FString AntiAddictionHopeHeartbeatResource; // 0x90(0x10)
	struct FString AntiAddictionHopeWarningResource; // 0xa0(0x10)
	struct FString AntiAddictionHopeShutdownResource; // 0xb0(0x10)
};

// Class ShooterGame.AntiAddictionSessionManager
// Size: 0x38 (Inherited: 0x30)
struct UAntiAddictionSessionManager : UObject {
	struct UPlatformSessionManager* PlatformSessionManager; // 0x30(0x08)

	void HandleAntiAddictionTokenUpdate(struct FAntiAddictionToken AntiAddictionToken); // Function ShooterGame.AntiAddictionSessionManager.HandleAntiAddictionTokenUpdate // (Final|Native|Private) // @ game+0x3838ff0
};

// Class ShooterGame.ApplicationRepairManager
// Size: 0xa0 (Inherited: 0x80)
struct UApplicationRepairManager : UInitSystem {
	struct UApplicationRepairService* ApplicationRepairService; // 0x80(0x08)
	char pad_88[0x18]; // 0x88(0x18)
};

// Class ShooterGame.ApplicationRepairService
// Size: 0x38 (Inherited: 0x30)
struct UApplicationRepairService : UObject {
	struct URiotGamesApiClient* RiotGamesApiClient; // 0x30(0x08)
};

// Class ShooterGame.BaseProjectileEffectComponent
// Size: 0xf8 (Inherited: 0xe8)
struct UBaseProjectileEffectComponent : UActorComponent {
	char pad_E8[0x8]; // 0xe8(0x08)
	enum class EProjectileEventType TriggeringEvent; // 0xf0(0x01)
	bool bCanBeDisarmed; // 0xf1(0x01)
	char pad_F2[0x6]; // 0xf2(0x06)

	void OnProjectileStop(); // Function ShooterGame.BaseProjectileEffectComponent.OnProjectileStop // (Final|Native|Private) // @ game+0x39bdf80
	void OnProjectileDisarmed(); // Function ShooterGame.BaseProjectileEffectComponent.OnProjectileDisarmed // (Final|Native|Private) // @ game+0x39bdf60
	void OnEventTriggered(); // Function ShooterGame.BaseProjectileEffectComponent.OnEventTriggered // (Event|Protected|BlueprintEvent) // @ game+0x4282c30
	void OnEntranceHit(struct FHitResult& LastHitResult, struct FHitResult& EntranceHit); // Function ShooterGame.BaseProjectileEffectComponent.OnEntranceHit // (Final|Native|Private|HasOutParms) // @ game+0x39bdc60
	void OnActorDestroyed(struct AActor* DestroyedActor); // Function ShooterGame.BaseProjectileEffectComponent.OnActorDestroyed // (Final|Native|Private) // @ game+0x39bda70
};

// Class ShooterGame.ApplyBuffHitScanEffectComponent
// Size: 0x118 (Inherited: 0xf8)
struct UApplyBuffHitScanEffectComponent : UBaseProjectileEffectComponent {
	struct FEquippableStateBuffInfo BuffInfo; // 0xf8(0x20)
};

// Class ShooterGame.TimedStateComponent
// Size: 0x420 (Inherited: 0x3e8)
struct UTimedStateComponent : URespondToEventStateComponent {
	float TimerLength; // 0x3e8(0x04)
	char pad_3EC[0x4]; // 0x3ec(0x04)
	struct TArray<struct FGameplayAttribute> TimerModifingAttributes; // 0x3f0(0x10)
	bool bMovementSyncedTimer; // 0x400(0x01)
	char pad_401[0x1f]; // 0x401(0x1f)

	void TimerExpired(); // Function ShooterGame.TimedStateComponent.TimerExpired // (Native|Protected) // @ game+0x381bfd0
	void SetTimerPaused(bool bPaused); // Function ShooterGame.TimedStateComponent.SetTimerPaused // (Final|Native|Public|BlueprintCallable) // @ game+0x3e5ede0
	void SetTimer(float NewTime); // Function ShooterGame.TimedStateComponent.SetTimer // (Final|Native|Public|BlueprintCallable) // @ game+0x3e5ed60
	float GetTimerModifier(); // Function ShooterGame.TimedStateComponent.GetTimerModifier // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x3e5e3e0
	float GetTimeRemaining(); // Function ShooterGame.TimedStateComponent.GetTimeRemaining // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x3e5e3b0
};

// Class ShooterGame.ApplyBuffStateComponent
// Size: 0x430 (Inherited: 0x420)
struct UApplyBuffStateComponent : UTimedStateComponent {
	struct UAresGameplayBuff* BuffClass; // 0x420(0x08)
	float BuffLevel; // 0x428(0x04)
	bool bRemoveBuffOnStateEnd; // 0x42c(0x01)
	char pad_42D[0x3]; // 0x42d(0x03)
};

// Class ShooterGame.ApplyBuffToTargetsStateComponent
// Size: 0x308 (Inherited: 0x2f8)
struct UApplyBuffToTargetsStateComponent : UScriptStateComponent {
	struct UAresGameplayBuff* BuffClass; // 0x2f8(0x08)
	float BuffLevel; // 0x300(0x04)
	char pad_304[0x4]; // 0x304(0x04)
};

// Class ShooterGame.ApplyBuffWhileOverlappingComponent
// Size: 0x108 (Inherited: 0xe8)
struct UApplyBuffWhileOverlappingComponent : UActorComponent {
	struct UAresGameplayBuff* BuffClass; // 0xe8(0x08)
	float BuffLevel; // 0xf0(0x04)
	enum class EApplyBuffTarget ApplyBuffTarget; // 0xf4(0x01)
	char pad_F5[0xb]; // 0xf5(0x0b)
	struct AActor* OtherActor; // 0x100(0x08)

	void AuthSetOtherActor(struct AActor* OtherActor); // Function ShooterGame.ApplyBuffWhileOverlappingComponent.AuthSetOtherActor // (Final|BlueprintAuthorityOnly|Native|Public|BlueprintCallable) // @ game+0x3802110
	void AuthHandleEndOverlap(struct AActor* OverlappedActor, struct AActor* OtherActor); // Function ShooterGame.ApplyBuffWhileOverlappingComponent.AuthHandleEndOverlap // (Final|Native|Private) // @ game+0x3838280
	void AuthHandleBeginOverlap(struct AActor* OverlappedActor, struct AActor* OtherActor); // Function ShooterGame.ApplyBuffWhileOverlappingComponent.AuthHandleBeginOverlap // (Final|Native|Private) // @ game+0x3838280
};

// Class ShooterGame.ApplyContinuousForceModuleToTargetStateComponent
// Size: 0x318 (Inherited: 0x2f8)
struct UApplyContinuousForceModuleToTargetStateComponent : UScriptStateComponent {
	struct UForceModule* ForceModule; // 0x2f8(0x08)
	float Duration; // 0x300(0x04)
	char pad_304[0x4]; // 0x304(0x04)
	struct UForceModuleManagerComponent* TargetForceManager; // 0x308(0x08)
	struct FForceModuleHandle ModuleHandle; // 0x310(0x08)

	void OnModuleEnd(struct UForceModuleManagerComponent* Manager, struct FForceModuleHandle Handle); // Function ShooterGame.ApplyContinuousForceModuleToTargetStateComponent.OnModuleEnd // (Final|Native|Private) // @ game+0x3839520
	void MulticastModuleExpired(); // Function ShooterGame.ApplyContinuousForceModuleToTargetStateComponent.MulticastModuleExpired // (Final|Net|NetReliableNative|Event|NetMulticast|Private) // @ game+0x2730870
};

// Class ShooterGame.ApplyForceModuleStateComponent
// Size: 0x440 (Inherited: 0x420)
struct UApplyForceModuleStateComponent : UTimedStateComponent {
	struct UForceModule* Module; // 0x420(0x08)
	struct AActor* SourceActor; // 0x428(0x08)
	char pad_430[0x8]; // 0x430(0x08)
	struct UForceModuleManagerComponent* TargetForceManager; // 0x438(0x08)

	void RemoteClientModuleEnd(); // Function ShooterGame.ApplyForceModuleStateComponent.RemoteClientModuleEnd // (Net|NetReliableNative|Event|NetMulticast|Protected) // @ game+0x38396c0
	void OnModuleEnd(struct UForceModuleManagerComponent* Manager, struct FForceModuleHandle Handle); // Function ShooterGame.ApplyForceModuleStateComponent.OnModuleEnd // (Final|Native|Protected) // @ game+0x38395f0
	struct FForceModuleHandle GetForceModuleHandle(); // Function ShooterGame.ApplyForceModuleStateComponent.GetForceModuleHandle // (Final|Native|Public|BlueprintCallable|BlueprintPure) // @ game+0x38388c0
	struct UForceModule* GetForceModule(); // Function ShooterGame.ApplyForceModuleStateComponent.GetForceModule // (Final|Native|Public|BlueprintCallable|BlueprintPure) // @ game+0x3838890
	void AuthSetSourceActor(struct AActor* NewSource); // Function ShooterGame.ApplyForceModuleStateComponent.AuthSetSourceActor // (Final|BlueprintAuthorityOnly|Native|Public|BlueprintCallable) // @ game+0x3838350
};

// Class ShooterGame.ApplyForceToTargetsStateComponent
// Size: 0x308 (Inherited: 0x2f8)
struct UApplyForceToTargetsStateComponent : UScriptStateComponent {
	struct UForceModule* ForceModule; // 0x2f8(0x08)
	float Duration; // 0x300(0x04)
	char pad_304[0x4]; // 0x304(0x04)
};

// Class ShooterGame.ArchiveUIData
// Size: 0xa8 (Inherited: 0x90)
struct UArchiveUIData : UBaseContentUIData {
	struct FText Description; // 0x90(0x18)
};

// Class ShooterGame.ArchiveDataAsset
// Size: 0x90 (Inherited: 0x50)
struct UArchiveDataAsset : UAresBasePrimaryDataAsset {
	struct TSoftClassPtr<UObject> UIData; // 0x50(0x30)
	struct TArray<struct TSoftClassPtr<UObject>> AccordContracts; // 0x80(0x10)
};

// Class ShooterGame.AresAbilitySystemComponent
// Size: 0x1590 (Inherited: 0x1340)
struct UAresAbilitySystemComponent : UAbilitySystemComponent {
	char pad_1340[0x58]; // 0x1340(0x58)
	struct TArray<struct FGameplayAttribute> TrackedAttributes; // 0x1398(0x10)
	struct TMap<struct FGameplayAttribute, float> AttributeChangedTimeMap; // 0x13a8(0x50)
	struct TMap<struct FGameplayAttribute, struct FAttributeValueChangeDelegateList> AttributeChangedEvents; // 0x13f8(0x50)
	struct UAresAttributeSet* CachedAttributeSet; // 0x1448(0x08)
	struct TArray<struct FGameplayTag> TrackedTags; // 0x1450(0x10)
	struct TMap<struct FGameplayTag, float> TagChangedTimeMap; // 0x1460(0x50)
	struct TMap<struct FGameplayTag, struct FTagValueChangeDelegateList> TagChangedEvents; // 0x14b0(0x50)
	struct TArray<struct FDeferredTagChangedEntry> DeferredTagChangedEventsToRemove; // 0x1500(0x10)
	struct FTagValueChangeDelegateList AnyTagChangedEvents; // 0x1510(0x18)
	struct TArray<struct FDelegate> DeferredAnyTagChangedEvents; // 0x1528(0x10)
	struct TMap<struct FGameplayTag, struct FTagImmunityChangeDelegateList> TagImmunityChangedEvents; // 0x1538(0x50)
	char pad_1588[0x8]; // 0x1588(0x08)

	void SpecificTagValueChanged(struct FGameplayTag& Tag, int32_t Count); // Function ShooterGame.AresAbilitySystemComponent.SpecificTagValueChanged // (Final|Native|Private|HasOutParms) // @ game+0x3839c80
	void RemoveTagImmunityChangeEvent(struct FGameplayTag Tag, struct FDelegate& Event); // Function ShooterGame.AresAbilitySystemComponent.RemoveTagImmunityChangeEvent // (Final|Native|Public|HasOutParms|BlueprintCallable) // @ game+0x3839b60
	void RemoveTagChangeEvent(struct FGameplayTag Tag, struct FDelegate& Event); // Function ShooterGame.AresAbilitySystemComponent.RemoveTagChangeEvent // (Final|Native|Public|HasOutParms|BlueprintCallable) // @ game+0x3839a40
	void RemoveAttributeChangeEvent(struct FGameplayAttribute Attribute, struct FDelegate& Event); // Function ShooterGame.AresAbilitySystemComponent.RemoveAttributeChangeEvent // (Final|Native|Public|HasOutParms|BlueprintCallable) // @ game+0x38397d0
	void RemoveAnyTagChangeEvent(struct FDelegate& Event); // Function ShooterGame.AresAbilitySystemComponent.RemoveAnyTagChangeEvent // (Final|Native|Public|HasOutParms|BlueprintCallable) // @ game+0x3839710
	void RemoveAllActiveEffects(); // Function ShooterGame.AresAbilitySystemComponent.RemoveAllActiveEffects // (Final|BlueprintAuthorityOnly|Native|Public|BlueprintCallable) // @ game+0x38396f0
	void HandlePeriodicGameplayEffectExecuteOnSelf(struct UAbilitySystemComponent* Source, struct FGameplayEffectSpec& SpecExecuted, struct FActiveGameplayEffectHandle ActiveHandle); // Function ShooterGame.AresAbilitySystemComponent.HandlePeriodicGameplayEffectExecuteOnSelf // (Final|Native|Private|HasOutParms) // @ game+0x3839360
	void HandleGameplayEffectRemovedFromSelf(struct FActiveGameplayEffect& ActiveEffect); // Function ShooterGame.AresAbilitySystemComponent.HandleGameplayEffectRemovedFromSelf // (Final|Native|Private|HasOutParms) // @ game+0x3839250
	void HandleGameplayEffectAppliedToSelf(struct UAbilitySystemComponent* Source, struct FGameplayEffectSpec& SpecExecuted, struct FActiveGameplayEffectHandle ActiveHandle); // Function ShooterGame.AresAbilitySystemComponent.HandleGameplayEffectAppliedToSelf // (Final|Native|Private|HasOutParms) // @ game+0x38390f0
	float GetTimeSinceTrackedTagChanged(struct FGameplayTag Tag); // Function ShooterGame.AresAbilitySystemComponent.GetTimeSinceTrackedTagChanged // (Final|Native|Public|BlueprintCallable) // @ game+0x3838f40
	float GetTimeSinceTrackedAttributeChanged(struct FGameplayAttribute Attribute); // Function ShooterGame.AresAbilitySystemComponent.GetTimeSinceTrackedAttributeChanged // (Final|Native|Public|BlueprintCallable) // @ game+0x3838d30
	struct TArray<struct FActiveGameplayEffectHandle> GetGameplayEffectsByInstigator(struct UGameplayEffect* EffectType, struct AActor* Instigator); // Function ShooterGame.AresAbilitySystemComponent.GetGameplayEffectsByInstigator // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x3838b70
	struct TArray<struct FActiveGameplayEffectHandle> GetGameplayEffectsByCauser(struct UGameplayEffect* EffectType, struct AActor* Causer); // Function ShooterGame.AresAbilitySystemComponent.GetGameplayEffectsByCauser // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x3838a60
	struct AActor* GetGameplayEffectInstigator(struct FActiveGameplayEffectHandle& Handle); // Function ShooterGame.AresAbilitySystemComponent.GetGameplayEffectInstigator // (Final|Native|Public|HasOutParms|BlueprintCallable|BlueprintPure|Const) // @ game+0x38389b0
	struct AActor* GetGameplayEffectCauser(struct FActiveGameplayEffectHandle& Handle); // Function ShooterGame.AresAbilitySystemComponent.GetGameplayEffectCauser // (Final|Native|Public|HasOutParms|BlueprintCallable|BlueprintPure|Const) // @ game+0x3838900
	float GetFloatAttribute(struct FGameplayAttribute Attribute); // Function ShooterGame.AresAbilitySystemComponent.GetFloatAttribute // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x3838680
	bool GetBoolAttribute(struct FGameplayAttribute Attribute); // Function ShooterGame.AresAbilitySystemComponent.GetBoolAttribute // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x3838470
	void AnyTagValueChanged(struct FGameplayTag& Tag, int32_t Count); // Function ShooterGame.AresAbilitySystemComponent.AnyTagValueChanged // (Final|Native|Private|HasOutParms) // @ game+0x3838190
	void AddTagImmunityChangeEvent(struct FGameplayTag Tag, struct FDelegate& Event); // Function ShooterGame.AresAbilitySystemComponent.AddTagImmunityChangeEvent // (Final|Native|Public|HasOutParms|BlueprintCallable) // @ game+0x3838070
	void AddTagChangeEvent(struct FGameplayTag Tag, struct FDelegate& Event); // Function ShooterGame.AresAbilitySystemComponent.AddTagChangeEvent // (Final|Native|Public|HasOutParms|BlueprintCallable) // @ game+0x3837f50
	void AddAttributeChangeEvent(struct FGameplayAttribute Attribute, struct FDelegate& Event); // Function ShooterGame.AresAbilitySystemComponent.AddAttributeChangeEvent // (Final|Native|Public|HasOutParms|BlueprintCallable) // @ game+0x3837bc0
	void AddAnyTagChangeEvent(struct FDelegate& Event); // Function ShooterGame.AresAbilitySystemComponent.AddAnyTagChangeEvent // (Final|Native|Public|HasOutParms|BlueprintCallable) // @ game+0x3837b00
};

// Class ShooterGame.AresAbilitySystemGlobals
// Size: 0x2f8 (Inherited: 0x2f8)
struct UAresAbilitySystemGlobals : UAbilitySystemGlobals {
};

// Class ShooterGame.AccoladeDataAsset
// Size: 0xb0 (Inherited: 0x50)
struct UAccoladeDataAsset : UAresBasePrimaryDataAsset {
	struct TSoftClassPtr<UObject> Accolade; // 0x50(0x30)
	struct TSoftClassPtr<UObject> Character; // 0x80(0x30)
};

// Class ShooterGame.PowderedToastDataAsset
// Size: 0x90 (Inherited: 0x50)
struct UPowderedToastDataAsset : UAresBasePrimaryDataAsset {
	struct FString PowderedToastID; // 0x50(0x10)
	struct TSoftClassPtr<UObject> PowderedToastAsset; // 0x60(0x30)
};

// Class ShooterGame.AresTouchWidget
// Size: 0x960 (Inherited: 0x2c8)
struct UAresTouchWidget : UUserWidget {
	char pad_2C8[0x8]; // 0x2c8(0x08)
	uint32_t SwipeOptions; // 0x2d0(0x04)
	char pad_2D4[0x4]; // 0x2d4(0x04)
	struct FMulticastInlineDelegate OnSwipe; // 0x2d8(0x10)
	struct FAresTouchHoldGestureProperties HoldGestureProperties; // 0x2e8(0x0c)
	bool bUseDoubleTap; // 0x2f4(0x01)
	char pad_2F5[0x3]; // 0x2f5(0x03)
	struct FAresTouchDoubleTapGestureProperties DoubleTapGestureProperties; // 0x2f8(0x14)
	bool bVisibilityCustomizable; // 0x30c(0x01)
	char pad_30D[0x3]; // 0x30d(0x03)
	struct FMulticastInlineDelegate OnSelectStateChanged; // 0x310(0x10)
	struct FMulticastInlineDelegate OnWidgetMoved; // 0x320(0x10)
	struct FMulticastInlineDelegate OnWidgetEditPressed; // 0x330(0x10)
	struct FMulticastInlineDelegate OnWidgetEditReleased; // 0x340(0x10)
	struct FMulticastInlineDelegate OnWidgetScaleChanged; // 0x350(0x10)
	struct FMulticastInlineDelegate OnWidgetOpacityChanged; // 0x360(0x10)
	struct UAresTouchBounds* TouchBounds; // 0x370(0x08)
	struct UImage* EditOutline; // 0x378(0x08)
	struct UScaleBox* UserDefinedScaleBox; // 0x380(0x08)
	bool bIsDirty; // 0x388(0x01)
	bool bHiddenByGameFeatureToggle; // 0x389(0x01)
	char ForwardingInputChannel; // 0x38a(0x01)
	char ReceivingForwardedInputChannel; // 0x38b(0x01)
	bool bCheckBoundsForForwardedTouchScreenPresses; // 0x38c(0x01)
	bool bActivateTouchOnTouchEnter; // 0x38d(0x01)
	bool bReleaseOnTouchLeave; // 0x38e(0x01)
	char pad_38F[0x9]; // 0x38f(0x09)
	struct FLinearColor EditModeDisabledColor; // 0x398(0x10)
	struct TWeakObjectPtr<struct UAresTouchScreen> ParentTouchScreen; // 0x3a8(0x08)
	struct UAresTouchComponent* TouchComponent; // 0x3b0(0x08)
	char pad_3B8[0x228]; // 0x3b8(0x228)
	bool bOverrideUserDefinedVisibility; // 0x5e0(0x01)
	enum class EWidgetVisibilityState InternalVisibilityState; // 0x5e1(0x01)
	enum class EWidgetEnabledState InternalEnabledState; // 0x5e2(0x01)
	char pad_5E3[0x5d]; // 0x5e3(0x5d)
	bool ForceVisible; // 0x640(0x01)
	char pad_641[0x7]; // 0x641(0x07)
	struct UAresTouchHoldGesture* HoldGesture; // 0x648(0x08)
	struct UAresTouchDoubleTapGesture* DoubleTapGesture; // 0x650(0x08)
	bool bRefreshOnTouchModeChanged; // 0x658(0x01)
	bool bSelectedForEdit; // 0x659(0x01)
	enum class EAresTouchWidgetDisabledInputMode DisabledInputMode; // 0x65a(0x01)
	enum class EAresTouchWidgetMode EditTouchMode; // 0x65b(0x01)
	enum class EAresTouchTrackingMode TouchTrackingMode; // 0x65c(0x01)
	char pad_65D[0x3]; // 0x65d(0x03)
	struct FAresUIPropertyMap TouchWidgetDefaultProperties; // 0x660(0x2d0)
	struct UAresUIPropertyRegistry* TouchWidgetProperties; // 0x930(0x08)
	char pad_938[0x28]; // 0x938(0x28)

	void UnregisterGesture(struct UAresTouchGesture* TouchGesture); // Function ShooterGame.AresTouchWidget.UnregisterGesture // (Final|BlueprintCosmetic|Native|Public|BlueprintCallable) // @ game+0x3984cb0
	void SetWheelPassthroughEnabled(bool bEnable); // Function ShooterGame.AresTouchWidget.SetWheelPassthroughEnabled // (Final|BlueprintCosmetic|Native|Public|BlueprintCallable) // @ game+0x3984c20
	void SetUserDefinedVisibilityState(enum class EWidgetVisibilityState InVisibilityState); // Function ShooterGame.AresTouchWidget.SetUserDefinedVisibilityState // (Final|BlueprintCosmetic|Native|Public|BlueprintCallable) // @ game+0x3984ba0
	void SetUserDefinedScale(float InScale); // Function ShooterGame.AresTouchWidget.SetUserDefinedScale // (Final|BlueprintCosmetic|Native|Public|BlueprintCallable) // @ game+0x3984b20
	void SetUserDefinedOpacity(float InOpacity); // Function ShooterGame.AresTouchWidget.SetUserDefinedOpacity // (Final|BlueprintCosmetic|Native|Public|BlueprintCallable) // @ game+0x3984aa0
	void SetTouchTrackingMode(enum class EAresTouchTrackingMode InTouchTrackingMode); // Function ShooterGame.AresTouchWidget.SetTouchTrackingMode // (Final|Native|Public|BlueprintCallable) // @ game+0x3984a20
	void SetTouchEnabled(bool InTouchEnabled); // Function ShooterGame.AresTouchWidget.SetTouchEnabled // (BlueprintCosmetic|Native|Public|BlueprintCallable) // @ game+0x3984980
	void SetSlotName(struct FName& InSlotName); // Function ShooterGame.AresTouchWidget.SetSlotName // (Final|BlueprintCosmetic|Native|Public|HasOutParms|BlueprintCallable) // @ game+0x39848e0
	void SetInternalVisibilityState(enum class EWidgetVisibilityState InVisibilityState); // Function ShooterGame.AresTouchWidget.SetInternalVisibilityState // (Final|BlueprintCosmetic|Native|Public|BlueprintCallable) // @ game+0x3984860
	void SetInternalEnabledState(enum class EWidgetEnabledState InEnabledState); // Function ShooterGame.AresTouchWidget.SetInternalEnabledState // (Final|BlueprintCosmetic|Native|Public|BlueprintCallable) // @ game+0x39847e0
	void SetInputChannelReceivingEnabled(enum class FAresTouchWidgetInputChannel InputChannel, bool bEnable); // Function ShooterGame.AresTouchWidget.SetInputChannelReceivingEnabled // (Final|Native|Protected|BlueprintCallable) // @ game+0x3984710
	void SetInputChannelPassthroughEnabled(enum class FAresTouchWidgetInputChannel InputChannel, bool bEnable); // Function ShooterGame.AresTouchWidget.SetInputChannelPassthroughEnabled // (Final|Native|Protected|BlueprintCallable) // @ game+0x3984640
	void SetHiddenByGameFeatureToggle(bool Value); // Function ShooterGame.AresTouchWidget.SetHiddenByGameFeatureToggle // (Final|Native|Public|BlueprintCallable) // @ game+0x39845b0
	void SetFloatLayoutSetting(enum class EWidgetLayoutSettingName Setting, float Value); // Function ShooterGame.AresTouchWidget.SetFloatLayoutSetting // (Final|BlueprintCosmetic|Native|Public|BlueprintCallable) // @ game+0x39844e0
	void SetDisabledInputMode(enum class EAresTouchWidgetDisabledInputMode NewDisabledInputMode); // Function ShooterGame.AresTouchWidget.SetDisabledInputMode // (Final|Native|Public|BlueprintCallable) // @ game+0x3984460
	void SetBoolLayoutWeaponOverride(enum class EWidgetLayoutSettingName Setting, bool Value, struct FString WeaponName); // Function ShooterGame.AresTouchWidget.SetBoolLayoutWeaponOverride // (Final|BlueprintCosmetic|Native|Public|BlueprintCallable) // @ game+0x39842e0
	void SetBoolLayoutSetting(enum class EWidgetLayoutSettingName Setting, bool Value); // Function ShooterGame.AresTouchWidget.SetBoolLayoutSetting // (Final|BlueprintCosmetic|Native|Public|BlueprintCallable) // @ game+0x3984210
	void SetAimPassthroughEnabled(bool bEnable); // Function ShooterGame.AresTouchWidget.SetAimPassthroughEnabled // (Final|BlueprintCosmetic|Native|Public|BlueprintCallable) // @ game+0x3984180
	void SetActivateTouchOnTouchEnter(bool bEnable); // Function ShooterGame.AresTouchWidget.SetActivateTouchOnTouchEnter // (Final|BlueprintCosmetic|Native|Public|BlueprintCallable) // @ game+0x39840f0
	void SetActivateTouchEnterIndex(enum class ETouchIndex TouchIndex); // Function ShooterGame.AresTouchWidget.SetActivateTouchEnterIndex // (Final|BlueprintCosmetic|Native|Public|BlueprintCallable) // @ game+0x3984070
	void SaveLayoutForCurrentPreset(struct FWidgetLayout& WidgetLayout); // Function ShooterGame.AresTouchWidget.SaveLayoutForCurrentPreset // (Final|BlueprintCosmetic|Native|Public|HasOutParms|BlueprintCallable) // @ game+0x3983f20
	void SaveCurrentLayout(); // Function ShooterGame.AresTouchWidget.SaveCurrentLayout // (Final|BlueprintCosmetic|Native|Public|BlueprintCallable) // @ game+0x3983f00
	void ResetTouchState(); // Function ShooterGame.AresTouchWidget.ResetTouchState // (Final|Native|Public|BlueprintCallable) // @ game+0x3983ee0
	void ResetGestureState(); // Function ShooterGame.AresTouchWidget.ResetGestureState // (Final|Native|Protected|BlueprintCallable) // @ game+0x3983ec0
	void RegisterWithTouchScreen(struct UAresTouchScreen* InTouchScreen); // Function ShooterGame.AresTouchWidget.RegisterWithTouchScreen // (BlueprintCosmetic|Native|Public|BlueprintCallable) // @ game+0x3983e30
	void RegisterGesture(struct UAresTouchGesture* TouchGesture); // Function ShooterGame.AresTouchWidget.RegisterGesture // (Final|BlueprintCosmetic|Native|Public|BlueprintCallable) // @ game+0x3983da0
	void RefreshTouchModeVisuals(); // Function ShooterGame.AresTouchWidget.RefreshTouchModeVisuals // (Final|Native|Protected|BlueprintCallable) // @ game+0x3983d80
	void RefreshSlateVisibility(); // Function ShooterGame.AresTouchWidget.RefreshSlateVisibility // (Final|BlueprintCosmetic|Native|Protected|BlueprintCallable) // @ game+0x3983d60
	void RefreshImpl(); // Function ShooterGame.AresTouchWidget.RefreshImpl // (Native|Event|Protected|BlueprintEvent) // @ game+0x3983d30
	void RefreshEnabledState(); // Function ShooterGame.AresTouchWidget.RefreshEnabledState // (Final|BlueprintCosmetic|Native|Protected|BlueprintCallable) // @ game+0x3983d10
	void Refresh(); // Function ShooterGame.AresTouchWidget.Refresh // (Final|Native|Protected|BlueprintCallable) // @ game+0x3983cf0
	struct UAresTouchComponent* RebuildTouchComponent(); // Function ShooterGame.AresTouchWidget.RebuildTouchComponent // (Native|Event|Protected|BlueprintEvent) // @ game+0x3983cb0
	void OnTouchReset(); // Function ShooterGame.AresTouchWidget.OnTouchReset // (Event|Protected|BlueprintEvent) // @ game+0x4282c30
	void OnTouchModeChange(enum class EAresTouchMode NewTouchMode); // Function ShooterGame.AresTouchWidget.OnTouchModeChange // (Native|Event|Protected|BlueprintEvent) // @ game+0x3983c20
	void OnScaleChanged(float NewScale); // Function ShooterGame.AresTouchWidget.OnScaleChanged // (Event|Public|BlueprintEvent) // @ game+0x4282c30
	void OnPresetChange(); // Function ShooterGame.AresTouchWidget.OnPresetChange // (Final|BlueprintCosmetic|Native|Public|BlueprintCallable) // @ game+0x3983c00
	void OnOpacityChanged(float NewOpacity); // Function ShooterGame.AresTouchWidget.OnOpacityChanged // (Event|Public|BlueprintEvent) // @ game+0x4282c30
	void OnInitializeDefaultValues(); // Function ShooterGame.AresTouchWidget.OnInitializeDefaultValues // (Native|Event|Public|BlueprintEvent) // @ game+0x3983bd0
	void OnHoldStart(struct FAresTouchHoldGestureData GestureData); // Function ShooterGame.AresTouchWidget.OnHoldStart // (BlueprintCosmetic|Event|Public|BlueprintEvent) // @ game+0x4282c30
	void OnHoldEnd(struct FAresTouchHoldGestureData GestureData); // Function ShooterGame.AresTouchWidget.OnHoldEnd // (BlueprintCosmetic|Event|Public|BlueprintEvent) // @ game+0x4282c30
	void OnHoldChargeInterrupted(struct FAresTouchHoldGestureData GestureData); // Function ShooterGame.AresTouchWidget.OnHoldChargeInterrupted // (BlueprintCosmetic|Event|Public|BlueprintEvent) // @ game+0x4282c30
	void OnDoubleTapStart(struct FAresTouchDoubleTapGestureData GestureData); // Function ShooterGame.AresTouchWidget.OnDoubleTapStart // (BlueprintCosmetic|Event|Public|BlueprintEvent) // @ game+0x4282c30
	void OnDoubleTapHoldStart(struct FAresTouchHoldGestureData GestureData); // Function ShooterGame.AresTouchWidget.OnDoubleTapHoldStart // (BlueprintCosmetic|Event|Public|BlueprintEvent) // @ game+0x4282c30
	void OnDoubleTapHoldChargeInterrupted(struct FAresTouchHoldGestureData GestureData); // Function ShooterGame.AresTouchWidget.OnDoubleTapHoldChargeInterrupted // (BlueprintCosmetic|Event|Public|BlueprintEvent) // @ game+0x4282c30
	void OnDoubleTapEnd(struct FAresTouchDoubleTapGestureData GestureData); // Function ShooterGame.AresTouchWidget.OnDoubleTapEnd // (BlueprintCosmetic|Event|Public|BlueprintEvent) // @ game+0x4282c30
	void OnComponentSelectStateChanged(bool bSelected); // Function ShooterGame.AresTouchWidget.OnComponentSelectStateChanged // (Native|Event|Protected|BlueprintEvent) // @ game+0x38e1440
	void OnComponentEditReleased(); // Function ShooterGame.AresTouchWidget.OnComponentEditReleased // (Native|Protected) // @ game+0x38396c0
	void OnComponentEditPressed(); // Function ShooterGame.AresTouchWidget.OnComponentEditPressed // (Native|Protected) // @ game+0x3983ba0
	void OnComponentEditMoved(struct FVector2D ScreenDelta); // Function ShooterGame.AresTouchWidget.OnComponentEditMoved // (Native|Protected|HasDefaults) // @ game+0x3983b10
	void OnCharacterHUDAnimationFinished(); // Function ShooterGame.AresTouchWidget.OnCharacterHUDAnimationFinished // (Native|Event|Public|BlueprintEvent) // @ game+0x3948730
	void LoadWidgetLayoutFromSettings(); // Function ShooterGame.AresTouchWidget.LoadWidgetLayoutFromSettings // (Final|BlueprintCosmetic|Native|Public|BlueprintCallable) // @ game+0x3983af0
	bool IsWheelPassthroughEnabled(); // Function ShooterGame.AresTouchWidget.IsWheelPassthroughEnabled // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x3983ac0
	bool IsInputChannelReceivingEnabled(enum class FAresTouchWidgetInputChannel InputChannel); // Function ShooterGame.AresTouchWidget.IsInputChannelReceivingEnabled // (Final|Native|Protected|BlueprintCallable|BlueprintPure|Const) // @ game+0x3983a30
	bool IsInputChannelPassthroughEnabled(enum class FAresTouchWidgetInputChannel InputChannel); // Function ShooterGame.AresTouchWidget.IsInputChannelPassthroughEnabled // (Final|Native|Protected|BlueprintCallable|BlueprintPure|Const) // @ game+0x39839a0
	bool IsInCharacterHUD(); // Function ShooterGame.AresTouchWidget.IsInCharacterHUD // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x3983970
	bool IsHandlingForwardedInputIndex(enum class ETouchIndex TouchIndex); // Function ShooterGame.AresTouchWidget.IsHandlingForwardedInputIndex // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x39838e0
	bool IsHandlingForwardedInput(); // Function ShooterGame.AresTouchWidget.IsHandlingForwardedInput // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x39838b0
	bool IsAimPassthroughEnabled(); // Function ShooterGame.AresTouchWidget.IsAimPassthroughEnabled // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x3983880
	void InitializeDefaultLayout(enum class EWidgetVisibilityState DefaultVisibilityState, bool bAllowForPreset, struct FWidgetLayoutSettingOverrides SettingOverrides, float Scale); // Function ShooterGame.AresTouchWidget.InitializeDefaultLayout // (Final|BlueprintCosmetic|Native|Public|BlueprintCallable) // @ game+0x3983520
	void HandleTouchRelease(struct FAresTouchEventInfo& TouchInfo); // Function ShooterGame.AresTouchWidget.HandleTouchRelease // (Native|Event|Protected|HasOutParms|BlueprintCallable|BlueprintEvent) // @ game+0x39833b0
	bool HandleTouchPress(struct FAresTouchEventInfo& TouchInfo); // Function ShooterGame.AresTouchWidget.HandleTouchPress // (Native|Event|Protected|HasOutParms|BlueprintCallable|BlueprintEvent) // @ game+0x3983230
	void HandleTouchMove(struct FAresTouchEventInfo& TouchInfo); // Function ShooterGame.AresTouchWidget.HandleTouchMove // (Native|Event|Protected|HasOutParms|BlueprintCallable|BlueprintEvent) // @ game+0x39830c0
	void HandleTouchExit(struct FAresTouchEventInfo& TouchInfo); // Function ShooterGame.AresTouchWidget.HandleTouchExit // (Native|Event|Protected|HasOutParms|BlueprintCallable|BlueprintEvent) // @ game+0x3982f50
	void HandleTouchEnter(struct FAresTouchEventInfo& TouchInfo); // Function ShooterGame.AresTouchWidget.HandleTouchEnter // (Native|Event|Protected|HasOutParms|BlueprintCallable|BlueprintEvent) // @ game+0x3982de0
	enum class EWidgetVisibilityState GetVisibilityState(); // Function ShooterGame.AresTouchWidget.GetVisibilityState // (Final|BlueprintCosmetic|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x3982db0
	struct FWidgetLayout GetUserDefinedLayout(); // Function ShooterGame.AresTouchWidget.GetUserDefinedLayout // (Final|BlueprintCosmetic|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x3982cc0
	struct UAresUIPropertyRegistry* GetTouchWidgetProperties(); // Function ShooterGame.AresTouchWidget.GetTouchWidgetProperties // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x3982ca0
	enum class EAresTouchTrackingMode GetTouchTrackingMode(); // Function ShooterGame.AresTouchWidget.GetTouchTrackingMode // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x3982c70
	struct UAresTouchComponent* GetTouchComponent(); // Function ShooterGame.AresTouchWidget.GetTouchComponent // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x3982c50
	struct FName GetSlotName(); // Function ShooterGame.AresTouchWidget.GetSlotName // (Final|BlueprintCosmetic|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x3982c10
	bool GetSettingWeaponOverride(enum class EWidgetLayoutSettingName SettingName, bool& OutValue, struct FString OverrideWeaponPath); // Function ShooterGame.AresTouchWidget.GetSettingWeaponOverride // (Final|BlueprintCosmetic|Native|Public|HasOutParms|BlueprintCallable) // @ game+0x3982a90
	struct UAresTouchScreen* GetParentTouchScreen(); // Function ShooterGame.AresTouchWidget.GetParentTouchScreen // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x3982a50
	struct FVector2D GetLocalCenterCoordinates(); // Function ShooterGame.AresTouchWidget.GetLocalCenterCoordinates // (Native|Event|Protected|HasDefaults|BlueprintEvent|Const) // @ game+0x3982a00
	bool GetHiddenByGameFeatureToggle(); // Function ShooterGame.AresTouchWidget.GetHiddenByGameFeatureToggle // (Final|Native|Public|BlueprintCallable) // @ game+0x39829d0
	bool GetFloatLayoutSetting(enum class EWidgetLayoutSettingName SettingName, float& OutValue); // Function ShooterGame.AresTouchWidget.GetFloatLayoutSetting // (Final|BlueprintCosmetic|Native|Public|HasOutParms|BlueprintCallable) // @ game+0x39828f0
	enum class EWidgetEnabledState GetEnabledState(); // Function ShooterGame.AresTouchWidget.GetEnabledState // (Final|BlueprintCosmetic|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x39828c0
	struct FWidgetLayout GetDefaultLayout(); // Function ShooterGame.AresTouchWidget.GetDefaultLayout // (Final|Native|Protected|BlueprintCallable|BlueprintPure|Const) // @ game+0x3982740
	bool GetBoolLayoutSetting(enum class EWidgetLayoutSettingName SettingName, bool& OutValue, bool UseOverrides, struct FString OverrideWeaponPath); // Function ShooterGame.AresTouchWidget.GetBoolLayoutSetting // (Final|BlueprintCosmetic|Native|Public|HasOutParms|BlueprintCallable) // @ game+0x3982560
	void ForwardedOnTouchPress(struct FAresTouchEventInfo& TouchInfo, char InputChannel); // Function ShooterGame.AresTouchWidget.ForwardedOnTouchPress // (Final|Native|Protected|HasOutParms) // @ game+0x39823c0
	void ForwardedOnTouchMoved(struct FAresTouchEventInfo& TouchInfo, char InputChannel); // Function ShooterGame.AresTouchWidget.ForwardedOnTouchMoved // (Final|Native|Protected|HasOutParms) // @ game+0x3982220
	void ForwardedOnTouchEnded(struct FAresTouchEventInfo& TouchInfo, char InputChannel); // Function ShooterGame.AresTouchWidget.ForwardedOnTouchEnded // (Final|Native|Protected|HasOutParms) // @ game+0x3982080
	void ForceVisibilityUpdate(); // Function ShooterGame.AresTouchWidget.ForceVisibilityUpdate // (Final|Native|Protected|BlueprintCallable) // @ game+0x3982060
	bool DoesHaveAnyActiveTouches(); // Function ShooterGame.AresTouchWidget.DoesHaveAnyActiveTouches // (Final|Native|Public|BlueprintCallable) // @ game+0x3982030
	void ClearActivateTouchEnterIndex(); // Function ShooterGame.AresTouchWidget.ClearActivateTouchEnterIndex // (Final|BlueprintCosmetic|Native|Public|BlueprintCallable) // @ game+0x3982010
	void ApplyBoolLayoutWeaponOverrides(); // Function ShooterGame.AresTouchWidget.ApplyBoolLayoutWeaponOverrides // (Final|BlueprintCosmetic|Native|Public|BlueprintCallable) // @ game+0x3981ff0
};

// Class ShooterGame.AresActionButton
// Size: 0xa10 (Inherited: 0x960)
struct UAresActionButton : UAresTouchWidget {
	struct FMulticastInlineDelegate OnEngage; // 0x960(0x10)
	struct FMulticastInlineDelegate OnDisengage; // 0x970(0x10)
	struct FMulticastInlineDelegate OnClick; // 0x980(0x10)
	struct FMulticastInlineDelegate OnButtonPressed; // 0x990(0x10)
	struct FMulticastInlineDelegate OnButtonReleased; // 0x9a0(0x10)
	struct FMulticastInlineDelegate OnButtonEntered; // 0x9b0(0x10)
	struct FMulticastInlineDelegate OnButtonExited; // 0x9c0(0x10)
	struct FMulticastInlineDelegate OnButtonMoved; // 0x9d0(0x10)
	struct FMulticastInlineDelegate OnButtonReset; // 0x9e0(0x10)
	bool bEngaged; // 0x9f0(0x01)
	char pad_9F1[0x3]; // 0x9f1(0x03)
	struct FName ActionMappingName; // 0x9f4(0x0c)
	bool bFireOnRelease; // 0xa00(0x01)
	enum class EActionButtonActivationMode ActivationMode; // 0xa01(0x01)
	enum class EActionButtonStateTransitionMethod StateTransitionMethod; // 0xa02(0x01)
	char pad_A03[0xd]; // 0xa03(0x0d)

	void SimulateTap(); // Function ShooterGame.AresActionButton.SimulateTap // (Native|Public|BlueprintCallable) // @ game+0x38419c0
	void SetStateTransitionMethod(enum class EActionButtonStateTransitionMethod InStateTransitionMethod); // Function ShooterGame.AresActionButton.SetStateTransitionMethod // (Final|BlueprintCosmetic|Native|Public|BlueprintCallable) // @ game+0x3841940
	void SetSelfHandlesTouchEngageVisualsEnabled(bool bInIsEnabled); // Function ShooterGame.AresActionButton.SetSelfHandlesTouchEngageVisualsEnabled // (Final|Native|Public|BlueprintCallable) // @ game+0x38418b0
	void SetSelfHandlesTouchEngageEnabled(bool bInIsEnabled); // Function ShooterGame.AresActionButton.SetSelfHandlesTouchEngageEnabled // (Final|Native|Public|BlueprintCallable) // @ game+0x3841820
	void OnTouchComponentReleased(struct FAresTouchTrackingData TouchData); // Function ShooterGame.AresActionButton.OnTouchComponentReleased // (Native|Protected) // @ game+0x3841570
	void OnTouchComponentPressed(struct FAresTouchTrackingData TouchData); // Function ShooterGame.AresActionButton.OnTouchComponentPressed // (Native|Protected) // @ game+0x3841480
	void OnTouchComponentMoved(struct FAresTouchTrackingData TouchData); // Function ShooterGame.AresActionButton.OnTouchComponentMoved // (Native|Protected) // @ game+0x3841390
	void OnTouchComponentExited(struct FAresTouchTrackingData TouchData); // Function ShooterGame.AresActionButton.OnTouchComponentExited // (Native|Protected) // @ game+0x38412a0
	void OnTouchComponentEntered(struct FAresTouchTrackingData TouchData); // Function ShooterGame.AresActionButton.OnTouchComponentEntered // (Native|Protected) // @ game+0x38411b0
	void HandleTouchEngageVisuals(); // Function ShooterGame.AresActionButton.HandleTouchEngageVisuals // (Native|Event|Protected|BlueprintCallable|BlueprintEvent) // @ game+0x3840b70
	void HandleTouchEngage(); // Function ShooterGame.AresActionButton.HandleTouchEngage // (Native|Event|Protected|BlueprintCallable|BlueprintEvent) // @ game+0x2730a80
	void HandleTouchDisengageVisuals(); // Function ShooterGame.AresActionButton.HandleTouchDisengageVisuals // (Native|Event|Protected|BlueprintCallable|BlueprintEvent) // @ game+0x3840b40
	void HandleTouchDisengage(); // Function ShooterGame.AresActionButton.HandleTouchDisengage // (Native|Event|Protected|BlueprintCallable|BlueprintEvent) // @ game+0x3840b10
	void HandleTouchClick(); // Function ShooterGame.AresActionButton.HandleTouchClick // (Native|Event|Protected|BlueprintCallable|BlueprintEvent) // @ game+0x3840ae0
	bool GetSelfHandlesTouchEngageEnabled(); // Function ShooterGame.AresActionButton.GetSelfHandlesTouchEngageEnabled // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x3840870
};

// Class ShooterGame.AresActivatableWidgetStack
// Size: 0x280 (Inherited: 0x270)
struct UAresActivatableWidgetStack : UCommonActivatableWidgetStack {
	struct FMulticastInlineDelegate BP_OnTransitionChanged; // 0x270(0x10)

	void Native_OnTransitionChanged(struct UCommonActivatableWidgetContainerBase* Widget, bool bIsTransitioning); // Function ShooterGame.AresActivatableWidgetStack.Native_OnTransitionChanged // (Native|Protected) // @ game+0x3840cc0
	bool IsTransitionPlaying(); // Function ShooterGame.AresActivatableWidgetStack.IsTransitionPlaying // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x3840c90
};

// Class ShooterGame.AresActorSoundPool
// Size: 0x3c8 (Inherited: 0x3b8)
struct AAresActorSoundPool : AActor {
	struct TArray<struct UAresAudioComponent*> RecycledAudioComponents; // 0x3b8(0x10)
};

// Class ShooterGame.AresAddFriendViewModel
// Size: 0x68 (Inherited: 0x48)
struct UAresAddFriendViewModel : UAresViewModelBase {
	struct FMulticastInlineDelegate OnFriendRequestSuccess; // 0x48(0x10)
	struct FMulticastInlineDelegate OnFriendRequestError; // 0x58(0x10)

	void SendFriendRequestByGameNameAndTagline(struct FString GameName, struct FString TagLine); // Function ShooterGame.AresAddFriendViewModel.SendFriendRequestByGameNameAndTagline // (Final|Native|Public|BlueprintCallable) // @ game+0x3841710
	void SendFriendRequestByFullName(struct FString FullName); // Function ShooterGame.AresAddFriendViewModel.SendFriendRequestByFullName // (Final|Native|Public|BlueprintCallable) // @ game+0x3841660
	void HandleOnFriendRequestSuccess(struct FString GameNameAndTagLine); // Function ShooterGame.AresAddFriendViewModel.HandleOnFriendRequestSuccess // (Final|Native|Private) // @ game+0x3840a30
	void HandleOnFriendRequestError(enum class ERGIFriendsRequestResponseErrors ErrorType); // Function ShooterGame.AresAddFriendViewModel.HandleOnFriendRequestError // (Final|Native|Private) // @ game+0x38409b0
};

// Class ShooterGame.AresAimToolingTracker
// Size: 0x100 (Inherited: 0xf8)
struct UAresAimToolingTracker : UAimToolingTracker {
	float LastTelemetryEventSentTime; // 0xf8(0x04)
	char pad_FC[0x4]; // 0xfc(0x04)

	void TrySendAimToolingTelemetryEvent(struct APlayerState* PlayerState, struct FAimToolingTelemetryData AimToolingData); // Function ShooterGame.AresAimToolingTracker.TrySendAimToolingTelemetryEvent // (Final|Native|Public) // @ game+0x3841ba0
	void TrackAresShot(struct AShooterCharacter* ShooterCharacter, struct AAresEquippable* EquippableUsed, bool bIsBendingDamage, struct TArray<struct FAresPointDamageEvent>& AppliedDamageEvents); // Function ShooterGame.AresAimToolingTracker.TrackAresShot // (Final|Native|Public|HasOutParms) // @ game+0x38419f0
	void OnRoundEnd(int32_t RoundNumberEnding); // Function ShooterGame.AresAimToolingTracker.OnRoundEnd // (Final|Native|Public) // @ game+0x3802860
};

// Class ShooterGame.AresAimToolingTuningAsset
// Size: 0x6c0 (Inherited: 0x38)
struct UAresAimToolingTuningAsset : UDataAsset {
	bool bAimToolingModule; // 0x38(0x01)
	char pad_39[0x7]; // 0x39(0x07)
	struct FAimToolingTargetManagementSharedTuningSet TargetManagementSharedTuningSet; // 0x40(0xa0)
	struct TMap<struct FString, struct FAimToolingTargetManagementWeaponTuningSet> TargetManagementWeaponTuningSets; // 0xe0(0x50)
	struct FAimToolingMoveErrorSharedTuningSet MoveErrorSharedTuningSet; // 0x130(0x08)
	bool bAimToolingBending; // 0x138(0x01)
	struct FAimToolingBendingSharedTuningSet BendingSharedTuningSet; // 0x139(0x01)
	char pad_13A[0x6]; // 0x13a(0x06)
	struct FAimToolingSpatialBendingFeatureTuningSet SpatialBendingFeatureTuningSet; // 0x140(0x18)
	struct FAimToolingSpatialBendingFeatureTuningSet SpatialBendingFeatureTuningSetADS; // 0x158(0x18)
	struct TMap<struct FString, struct FAimToolingSpatialBendingFeatureTuningSet> SpatialBendingFeatureTuningOverrideSets; // 0x170(0x50)
	struct TMap<struct FString, struct FAimToolingSpatialBendingWeaponTuningSet> SpatialBendingWeaponTuningSets; // 0x1c0(0x50)
	struct TMap<struct FString, struct FAimToolingTemporalBendingWeaponTuningSet> TemporalBendingWeaponTuningSets; // 0x210(0x50)
	bool bAimToolingPullToCenter; // 0x260(0x01)
	char pad_261[0x3]; // 0x261(0x03)
	struct FAimToolingPullToCenterSharedTuningSet PullToCenterSharedTuningSet; // 0x264(0x04)
	struct FAimToolingPullToCenterFeatureTuningSet PullToCenterFeatureTuningSet; // 0x268(0x68)
	struct FAimToolingPullToCenterFeatureTuningSet PullToCenterFeatureTuningSetADS; // 0x2d0(0x68)
	struct TMap<struct FString, struct FAimToolingPullToCenterFeatureTuningSet> PullToCenterFeatureTuningOverrideSets; // 0x338(0x50)
	struct TMap<struct FString, struct FAimToolingPullToCenterWeaponTuningSet> PullToCenterWeaponTuningSets; // 0x388(0x50)
	bool bAimToolingTargetFriction; // 0x3d8(0x01)
	char pad_3D9[0x3]; // 0x3d9(0x03)
	struct FAimToolingTargetFrictionSharedTuningSet TargetFrictionSharedTuningSet; // 0x3dc(0x10)
	struct FAimToolingTargetFrictionFeatureTuningSet TargetFrictionFeatureTuningSet; // 0x3ec(0x08)
	struct FAimToolingTargetFrictionFeatureTuningSet TargetFrictionFeatureTuningSetADS; // 0x3f4(0x08)
	char pad_3FC[0x4]; // 0x3fc(0x04)
	struct TMap<struct FString, struct FAimToolingTargetFrictionFeatureTuningSet> TargetFrictionFeatureTuningOverrideSets; // 0x400(0x50)
	struct TMap<struct FString, struct FAimToolingTargetFrictionWeaponTuningSet> TargetFrictionWeaponTuningSets; // 0x450(0x50)
	bool bAimToolingAimAccelerationDelay; // 0x4a0(0x01)
	char pad_4A1[0x3]; // 0x4a1(0x03)
	struct FAimToolingAimAccelerationDelaySharedTuningSet AimAccelerationDelaySharedTuningSet; // 0x4a4(0x08)
	bool bAimToolingDeceleration; // 0x4ac(0x01)
	char pad_4AD[0x3]; // 0x4ad(0x03)
	struct FAimToolingDecelerationSharedTuningSet DecelerationSharedTuningSet; // 0x4b0(0x1c)
	bool bAimToolingStrafeAssist; // 0x4cc(0x01)
	char pad_4CD[0x3]; // 0x4cd(0x03)
	struct FAimToolingStrafeAssistSharedTuningSet StrafeAssistSharedTuningSet; // 0x4d0(0x14)
	struct FAimToolingStrafeAssistFeatureTuningSet StrafeAssistFeatureTuningSet; // 0x4e4(0x10)
	struct FAimToolingStrafeAssistFeatureTuningSet StrafeAssistFeatureTuningSetADS; // 0x4f4(0x10)
	char pad_504[0x4]; // 0x504(0x04)
	struct TMap<struct FString, struct FAimToolingStrafeAssistFeatureTuningSet> StrafeAssistFeatureTuningOverrideSets; // 0x508(0x50)
	struct TMap<struct FString, struct FAimToolingStrafeAssistWeaponTuningSet> StrafeAssistWeaponTuningSets; // 0x558(0x50)
	bool bAimToolingFrameOfReference; // 0x5a8(0x01)
	char pad_5A9[0x3]; // 0x5a9(0x03)
	struct FAimToolingFrameOfReferenceSharedTuningSet FrameOfReferenceSharedTuningSet; // 0x5ac(0x0c)
	struct FAimToolingFrameOfReferenceFeatureTuningSet FrameOfReferenceFeatureTuningSet; // 0x5b8(0x28)
	struct FAimToolingFrameOfReferenceFeatureTuningSet FrameOfReferenceFeatureTuningSetADS; // 0x5e0(0x28)
	struct TMap<struct FString, struct FAimToolingFrameOfReferenceFeatureTuningSet> FrameOfReferenceFeatureTuningOverrideSets; // 0x608(0x50)
	struct TMap<struct FString, struct FAimToolingFrameOfReferenceWeaponTuningSet> FrameOfReferenceWeaponTuningSets; // 0x658(0x50)
	struct FAimToolingNoTargetFalloffSharedTuningSet NoTargetFalloffSharedTuningSet; // 0x6a8(0x0c)
	struct FAimToolingNewTargetRampUpSharedTuningSet NewTargetRampUpSharedTuningSet; // 0x6b4(0x0c)
};

// Class ShooterGame.AresAimToolingTuningComponent
// Size: 0x120 (Inherited: 0xe8)
struct UAresAimToolingTuningComponent : UActorComponent {
	struct FString GamepadTuningAssetPath; // 0xe8(0x10)
	struct FString TouchTuningAssetPath; // 0xf8(0x10)
	struct UAresAimToolingTuningAsset* CurrentTuningAsset; // 0x108(0x08)
	char pad_110[0x10]; // 0x110(0x10)

	void OnAimToolingGameRuleChanged(enum class EGameRuleBoolName RuleName, bool RuleValue); // Function ShooterGame.AresAimToolingTuningComponent.OnAimToolingGameRuleChanged // (Final|Native|Protected) // @ game+0x3840da0
	void HandleTuningAssetLoaded(); // Function ShooterGame.AresAimToolingTuningComponent.HandleTuningAssetLoaded // (Final|Native|Protected) // @ game+0x3840ba0
};

// Class ShooterGame.AresAIPerceptionComponent
// Size: 0x1d8 (Inherited: 0x1d0)
struct UAresAIPerceptionComponent : UAIPerceptionComponent {
	float ReactionTime; // 0x1d0(0x04)
	char pad_1D4[0x4]; // 0x1d4(0x04)

	bool HasSensedTimePassedReactionTime(struct UAISense* SenseToUse, struct AActor* Actor); // Function ShooterGame.AresAIPerceptionComponent.HasSensedTimePassedReactionTime // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x3840bc0
	bool GetTotalSensedTime(struct UAISense* SenseToUse, struct AActor* Actor, float& Time); // Function ShooterGame.AresAIPerceptionComponent.GetTotalSensedTime // (Final|Native|Public|HasOutParms|BlueprintCallable|BlueprintPure|Const) // @ game+0x3840890
	bool GetActorsSensedLocation(struct AActor* Actor, struct FVector& Location); // Function ShooterGame.AresAIPerceptionComponent.GetActorsSensedLocation // (Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable) // @ game+0x3840790
	void DeactivatePerception(); // Function ShooterGame.AresAIPerceptionComponent.DeactivatePerception // (Final|Native|Public|BlueprintCallable) // @ game+0x3840770
	void ActivatePerception(); // Function ShooterGame.AresAIPerceptionComponent.ActivatePerception // (Final|Native|Public|BlueprintCallable) // @ game+0x3840750
};

// Class ShooterGame.AresAIPerceptionSystem
// Size: 0x148 (Inherited: 0x148)
struct UAresAIPerceptionSystem : UAIPerceptionSystem {
};

// Class ShooterGame.AresAISystem
// Size: 0x158 (Inherited: 0x158)
struct UAresAISystem : UAISystem {
};

// Class ShooterGame.GamepadTuningDataAsset
// Size: 0x60 (Inherited: 0x38)
struct UGamepadTuningDataAsset : UDataAsset {
	float AnalogRoundness; // 0x38(0x04)
	char pad_3C[0x4]; // 0x3c(0x04)
	struct UCurveFloat* PartialSquaringMultiplierByAngleCurve; // 0x40(0x08)
	struct TArray<struct UCurveFloat*> AimCurves; // 0x48(0x10)
	float QuickAbilityMaxHoldTime; // 0x58(0x04)
	float UltInputSeparationTime; // 0x5c(0x04)
};

// Class ShooterGame.AresAnalogHandlerComponent
// Size: 0x318 (Inherited: 0xe8)
struct UAresAnalogHandlerComponent : UActorComponent {
	char pad_E8[0x8]; // 0xe8(0x08)
	struct UInputComponent* MapInputComponent; // 0xf0(0x08)
	struct FVector2D CursorDeltaRemainder; // 0xf8(0x08)
	char pad_100[0x218]; // 0x100(0x218)

	void OnIntSettingChanged(enum class EAresIntSettingName SettingName, int32_t OldValue, int32_t NewValue); // Function ShooterGame.AresAnalogHandlerComponent.OnIntSettingChanged // (Final|Native|Private) // @ game+0x38410a0
	void OnFloatSettingChanged(enum class EAresFloatSettingName SettingName, float OldValue, float NewValue); // Function ShooterGame.AresAnalogHandlerComponent.OnFloatSettingChanged // (Final|Native|Private) // @ game+0x3840f90
	void OnBoolSettingChanged(enum class EAresBoolSettingName SettingName, bool OldValue, bool NewValue); // Function ShooterGame.AresAnalogHandlerComponent.OnBoolSettingChanged // (Final|Native|Private) // @ game+0x3840e70
};

// Class ShooterGame.AresAssetManager
// Size: 0x510 (Inherited: 0x4a0)
struct UAresAssetManager : UAssetManager {
	char pad_4A0[0x70]; // 0x4a0(0x70)
};

// Class ShooterGame.AresAttachmentSocket
// Size: 0x40 (Inherited: 0x30)
struct UAresAttachmentSocket : UObject {
	struct FName SocketName; // 0x30(0x0c)
	char pad_3C[0x4]; // 0x3c(0x04)
};

// Class ShooterGame.GameplayModMagnitudeCalculationLevelAsCurve
// Size: 0x50 (Inherited: 0x48)
struct UGameplayModMagnitudeCalculationLevelAsCurve : UGameplayModMagnitudeCalculation {
	struct UCurveFloat* AttributeLevelCurve; // 0x48(0x08)
};

// Class ShooterGame.AresGameplayModMagnitudeCalculation
// Size: 0x48 (Inherited: 0x48)
struct UAresGameplayModMagnitudeCalculation : UGameplayModMagnitudeCalculation {

	struct UObject* GetSourceObject(struct FGameplayEffectSpec& Spec); // Function ShooterGame.AresGameplayModMagnitudeCalculation.GetSourceObject // (Final|Native|Protected|HasOutParms|BlueprintCallable|BlueprintPure|Const) // @ game+0x3850db0
	float GetEffectLevel(struct FGameplayEffectSpec& Spec); // Function ShooterGame.AresGameplayModMagnitudeCalculation.GetEffectLevel // (Final|Native|Protected|HasOutParms|BlueprintCallable|BlueprintPure|Const) // @ game+0x3850a50
	struct AActor* GetEffectInstigator(struct FGameplayEffectSpec& Spec); // Function ShooterGame.AresGameplayModMagnitudeCalculation.GetEffectInstigator // (Final|Native|Protected|HasOutParms|BlueprintCallable|BlueprintPure|Const) // @ game+0x3850980
	struct AActor* GetEffectCauser(struct FGameplayEffectSpec& Spec); // Function ShooterGame.AresGameplayModMagnitudeCalculation.GetEffectCauser // (Final|Native|Protected|HasOutParms|BlueprintCallable|BlueprintPure|Const) // @ game+0x38508b0
};

// Class ShooterGame.AresAttributeSet
// Size: 0x838 (Inherited: 0x38)
struct UAresAttributeSet : UAttributeSet {
	struct FGameplayBooleanAttributeData AllowFiringWhileUsing; // 0x38(0x10)
	struct FGameplayAttributeData Blinded; // 0x48(0x10)
	struct FGameplayAttributeData BonusDamage; // 0x58(0x10)
	struct FGameplayBooleanAttributeData CanSeeOthersHealth; // 0x68(0x10)
	struct FGameplayAttributeData DamageReduction; // 0x78(0x10)
	struct FGameplayAttributeData DefensiveDetectionDuration; // 0x88(0x10)
	struct FGameplayAttributeData DescendingGravityModifier; // 0x98(0x10)
	struct FGameplayAttributeData DetectionDelay; // 0xa8(0x10)
	struct FGameplayBooleanAttributeData DetectionDisabled; // 0xb8(0x10)
	struct FGameplayAttributeData EquippableMovementModifier; // 0xc8(0x10)
	struct FGameplayAttributeData HealingEffectiveness; // 0xd8(0x10)
	struct FGameplayAttributeData ShieldRestoreEffectiveness; // 0xe8(0x10)
	struct FGameplayAttributeData FiringErrorModifier; // 0xf8(0x10)
	struct FGameplayAttributeData FiringRateModifier; // 0x108(0x10)
	struct FGameplayAttributeData StabilityMovementModifier; // 0x118(0x10)
	struct FGameplayAttributeData GravityModifier; // 0x128(0x10)
	struct FGameplayAttributeData FootstepVolumeReduction; // 0x138(0x10)
	struct FGameplayBooleanAttributeData ForceCrouch; // 0x148(0x10)
	struct FGameplayBooleanAttributeData Frozen; // 0x158(0x10)
	struct FGameplayBooleanAttributeData HeavyWeaponsDisabled; // 0x168(0x10)
	struct FGameplayBooleanAttributeData Hide1P; // 0x178(0x10)
	struct FGameplayBooleanAttributeData Hide3P; // 0x188(0x10)
	struct FGameplayBooleanAttributeData HideCrosshair; // 0x198(0x10)
	struct FGameplayBooleanAttributeData HudVisibleToAll; // 0x1a8(0x10)
	struct FGameplayBooleanAttributeData HudVisibleToInstigator; // 0x1b8(0x10)
	struct FGameplayBooleanAttributeData InDanger; // 0x1c8(0x10)
	struct FGameplayBooleanAttributeData Intangible; // 0x1d8(0x10)
	struct FGameplayBooleanAttributeData Invisible; // 0x1e8(0x10)
	struct FGameplayBooleanAttributeData InvisibleEquippables; // 0x1f8(0x10)
	struct FGameplayBooleanAttributeData InvisibleToEnemies; // 0x208(0x10)
	struct FGameplayBooleanAttributeData InvisibleToEnemyNonPlayers; // 0x218(0x10)
	struct FGameplayBooleanAttributeData InvisibleToOwner; // 0x228(0x10)
	struct FGameplayBooleanAttributeData Invulnerable; // 0x238(0x10)
	struct FGameplayAttributeData JumpForceModifier; // 0x248(0x10)
	struct FGameplayAttributeData JumpMovementSlow; // 0x258(0x10)
	struct FGameplayBooleanAttributeData MinimapBlinded; // 0x268(0x10)
	struct FGameplayAttributeData MinimumAboveMaxSpeedDecayRateReduction; // 0x278(0x10)
	struct FGameplayAttributeData FallDamageReduction; // 0x288(0x10)
	struct FGameplayBooleanAttributeData LockMovement; // 0x298(0x10)
	struct FGameplayAttributeData MagazineBonus; // 0x2a8(0x10)
	struct FGameplayBooleanAttributeData MapVisibleToAll; // 0x2b8(0x10)
	struct FGameplayAttributeData MaxHealthModifier; // 0x2c8(0x10)
	struct FGameplayAttributeData MaxShieldModifier; // 0x2d8(0x10)
	struct FGameplayAttributeData MaxTurnRate; // 0x2e8(0x10)
	struct FGameplayAttributeData MinError; // 0x2f8(0x10)
	struct FGameplayAttributeData MinimapDetectionDelay; // 0x308(0x10)
	struct FGameplayBooleanAttributeData MinimapDisabled; // 0x318(0x10)
	struct FGameplayBooleanAttributeData MinimapInvisible; // 0x328(0x10)
	struct FGameplayAttributeData MinimapViewDistance; // 0x338(0x10)
	struct FGameplayAttributeData MaxVisionDistance; // 0x348(0x10)
	struct FGameplayAttributeData MoneyKillRewardModifier; // 0x358(0x10)
	struct FGameplayAttributeData MovementBonus; // 0x368(0x10)
	struct FGameplayAttributeData MovementBonusCrouch; // 0x378(0x10)
	struct FGameplayAttributeData MovementBonusFlying; // 0x388(0x10)
	struct FGameplayAttributeData MovementBonusJump; // 0x398(0x10)
	struct FGameplayAttributeData MovementBonusRun; // 0x3a8(0x10)
	struct FGameplayAttributeData MovementBonusWalk; // 0x3b8(0x10)
	struct FGameplayAttributeData MovementErrorModifier; // 0x3c8(0x10)
	struct FGameplayAttributeData MovementSlow; // 0x3d8(0x10)
	struct FGameplayAttributeData OffensiveDetectionDuration; // 0x3e8(0x10)
	struct FGameplayAttributeData PickupAmmoBonus; // 0x3f8(0x10)
	struct FGameplayBooleanAttributeData PreventAbilities; // 0x408(0x10)
	struct FGameplayBooleanAttributeData PreventCrouch; // 0x418(0x10)
	struct FGameplayBooleanAttributeData PreventDroppingEquippables; // 0x428(0x10)
	struct FGameplayBooleanAttributeData PreventJump; // 0x438(0x10)
	struct FGameplayBooleanAttributeData PreventFiring; // 0x448(0x10)
	struct FGameplayBooleanAttributeData PreventMeleeAttacking; // 0x458(0x10)
	struct FGameplayBooleanAttributeData PreventMovementInput; // 0x468(0x10)
	struct FGameplayBooleanAttributeData PreventReloading; // 0x478(0x10)
	struct FGameplayBooleanAttributeData PreventSwitchingEquippables; // 0x488(0x10)
	struct FGameplayBooleanAttributeData PreventUseCancelling; // 0x498(0x10)
	struct FGameplayBooleanAttributeData PreventUsing; // 0x4a8(0x10)
	struct FGameplayBooleanAttributeData PreventPickup; // 0x4b8(0x10)
	struct FGameplayBooleanAttributeData PrimarySlotDisabled; // 0x4c8(0x10)
	struct FGameplayAttributeData ReduceAbilityMovementPenalty; // 0x4d8(0x10)
	struct FGameplayAttributeData ReduceTaggingMovementPenalty; // 0x4e8(0x10)
	struct FGameplayAttributeData ReloadTimeModifier; // 0x4f8(0x10)
	struct FGameplayAttributeData SpreadRecoveryModifier; // 0x508(0x10)
	struct FGameplayBooleanAttributeData Stealthed; // 0x518(0x10)
	struct FGameplayBooleanAttributeData Untrackable; // 0x528(0x10)
	struct FGameplayAttributeData RecoilModifier; // 0x538(0x10)
	struct FGameplayBooleanAttributeData ThirdPerson; // 0x548(0x10)
	struct FGameplayAttributeData TurnRatePenalty; // 0x558(0x10)
	struct FGameplayAttributeData UltimatePointsDeathModifier; // 0x568(0x10)
	struct FGameplayAttributeData UltimatePointsDefuseModifier; // 0x578(0x10)
	struct FGameplayAttributeData UltimatePointsKillModifier; // 0x588(0x10)
	struct FGameplayAttributeData UltimatePointsPickUpModifier; // 0x598(0x10)
	struct FGameplayAttributeData UltimatePointsPlantModifier; // 0x5a8(0x10)
	struct FGameplayAttributeData UsingTimeModifier; // 0x5b8(0x10)
	struct FGameplayAttributeData WallPenetrationDistanceModifier; // 0x5c8(0x10)
	struct FGameplayAttributeData WeaponDrawTimeModifier; // 0x5d8(0x10)
	struct FGameplayBooleanAttributeData WeaponsDisabled; // 0x5e8(0x10)
	struct FGameplayBooleanAttributeData WeaponsLowered; // 0x5f8(0x10)
	struct FGameplayBooleanAttributeData Disarmed; // 0x608(0x10)
	struct FGameplayBooleanAttributeData GrenadeDisabled; // 0x618(0x10)
	struct FGameplayBooleanAttributeData QDisabled; // 0x628(0x10)
	struct FGameplayBooleanAttributeData EDisabled; // 0x638(0x10)
	struct FGameplayBooleanAttributeData UltimateDisabled; // 0x648(0x10)
	struct FGameplayBooleanAttributeData ZoomDisabled; // 0x658(0x10)
	struct FGameplayBooleanAttributeData EquipmentDisabled; // 0x668(0x10)
	struct FGameplayAttributeData TemporaryDamage; // 0x678(0x10)
	struct FGameplayAttributeData IncomingDamageShieldPenetrationModifier; // 0x688(0x10)
	struct FGameplayAttributeData IncomingAllyDamageModifier; // 0x698(0x10)
	struct FGameplayBooleanAttributeData PreventDeathFromDamage; // 0x6a8(0x10)
	struct FGameplayBooleanAttributeData BlindImmune; // 0x6b8(0x10)
	struct FGameplayBooleanAttributeData PreventUsingAbilities; // 0x6c8(0x10)
	struct FGameplayBooleanAttributeData PreventUsingAscenders; // 0x6d8(0x10)
	struct FGameplayBooleanAttributeData PreventUsingLoreItems; // 0x6e8(0x10)
	struct FGameplayAttributeData OverrideEquippableBaseMovement; // 0x6f8(0x10)
	struct FGameplayBooleanAttributeData DisableRegionalDamageMultipliers; // 0x708(0x10)
	struct FGameplayBooleanAttributeData DisableIncomingDamageCombatTracking; // 0x718(0x10)
	struct FGameplayBooleanAttributeData HealsFromAllyFlames; // 0x728(0x10)
	struct FGameplayAttributeData Marked; // 0x738(0x10)
	struct FGameplayBooleanAttributeData Suppressed; // 0x748(0x10)
	struct FGameplayBooleanAttributeData PreventDowned; // 0x758(0x10)
	struct FGameplayBooleanAttributeData PreventPlanting; // 0x768(0x10)
	struct FGameplayBooleanAttributeData PreventDefusing; // 0x778(0x10)
	struct FGameplayBooleanAttributeData PreventFollowing; // 0x788(0x10)
	struct FGameplayBooleanAttributeData InPeril; // 0x798(0x10)
	struct FGameplayBooleanAttributeData PreventMinimapFocusing; // 0x7a8(0x10)
	struct FGameplayAttributeData SensitivityModifier; // 0x7b8(0x10)
	struct FGameplayBooleanAttributeData ShowObserverKeybindsWhileHidden; // 0x7c8(0x10)
	struct FGameplayBooleanAttributeData PreventSkinFinisherIfVictim; // 0x7d8(0x10)
	struct FGameplayBooleanAttributeData PreventTeamWipeCondition; // 0x7e8(0x10)
	struct FGameplayBooleanAttributeData GroundedFootstepMute; // 0x7f8(0x10)
	struct FGameplayBooleanAttributeData DelayDeathUltPointReward; // 0x808(0x10)
	struct FGameplayBooleanAttributeData PreventKillUltPointReward; // 0x818(0x10)
	float Healing; // 0x828(0x04)
	float Damage; // 0x82c(0x04)
	float Shield; // 0x830(0x04)
	char pad_834[0x4]; // 0x834(0x04)
};

// Class ShooterGame.AresAudioBlueprintLibrary
// Size: 0x30 (Inherited: 0x30)
struct UAresAudioBlueprintLibrary : UBlueprintFunctionLibrary {

	void SetDebugAresAudio(int32_t Value); // Function ShooterGame.AresAudioBlueprintLibrary.SetDebugAresAudio // (Final|Native|Static|Public|BlueprintCallable) // @ game+0x3851170
	void SetAudioLanguage(struct FString Language); // Function ShooterGame.AresAudioBlueprintLibrary.SetAudioLanguage // (Final|Native|Static|Public|BlueprintCallable) // @ game+0x3851080
	void LoadLocalizedEventsFromBankList(struct TArray<struct UAkAudioBank*>& AudioBanks); // Function ShooterGame.AresAudioBlueprintLibrary.LoadLocalizedEventsFromBankList // (Final|Native|Static|Public|HasOutParms|BlueprintCallable|BlueprintPure) // @ game+0x3850fa0
	void LoadEventsFromBankList(struct TArray<struct UAkAudioBank*>& AudioBanks); // Function ShooterGame.AresAudioBlueprintLibrary.LoadEventsFromBankList // (Final|Native|Static|Public|HasOutParms|BlueprintCallable|BlueprintPure) // @ game+0x3850f00
	void LoadEventsForBank(struct UAkAudioBank* AudioBank); // Function ShooterGame.AresAudioBlueprintLibrary.LoadEventsForBank // (Final|Native|Static|Public|BlueprintCallable) // @ game+0x3850e80
	struct AAresSoundHandler* GetSoundHandlerForWorld(struct UObject* WorldContextObject); // Function ShooterGame.AresAudioBlueprintLibrary.GetSoundHandlerForWorld // (Final|Native|Static|Public|BlueprintCallable) // @ game+0x3850d20
	struct TArray<struct FString> GetLocalizationDirectories(); // Function ShooterGame.AresAudioBlueprintLibrary.GetLocalizationDirectories // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x3850c00
	void GetEventsForBank(struct UAkAudioBank* AudioBank, struct TArray<struct UAkAudioEvent*>& OutEvents); // Function ShooterGame.AresAudioBlueprintLibrary.GetEventsForBank // (Final|Native|Static|Public|HasOutParms|BlueprintCallable) // @ game+0x3850b20
	int32_t GetDebugAresAudio(); // Function ShooterGame.AresAudioBlueprintLibrary.GetDebugAresAudio // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x3850880
	struct FString GetAudioLanguage(); // Function ShooterGame.AresAudioBlueprintLibrary.GetAudioLanguage // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x3850800
	struct AAresActorSoundPool* GetActorSoundPoolForWorld(struct UObject* WorldContextObject); // Function ShooterGame.AresAudioBlueprintLibrary.GetActorSoundPoolForWorld // (Final|Native|Static|Public|BlueprintCallable) // @ game+0x3850770
	void AudioStatsSetInt(struct UObject* WorldContextObject, struct FName StatName, int32_t Value); // Function ShooterGame.AresAudioBlueprintLibrary.AudioStatsSetInt // (Final|Native|Static|Public|BlueprintCallable) // @ game+0x38505d0
	void AudioStatsResetAll(struct UObject* WorldContextObject); // Function ShooterGame.AresAudioBlueprintLibrary.AudioStatsResetAll // (Final|Native|Static|Public|BlueprintCallable) // @ game+0x3850550
	int32_t AudioStatsIncrementInt(struct UObject* WorldContextObject, struct FName StatName); // Function ShooterGame.AresAudioBlueprintLibrary.AudioStatsIncrementInt // (Final|Native|Static|Public|BlueprintCallable) // @ game+0x3850470
	struct FString AudioStatsGetString(struct UObject* WorldContextObject, int32_t TotalFrames); // Function ShooterGame.AresAudioBlueprintLibrary.AudioStatsGetString // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x3850360
	int32_t AudioStatsGetInt(struct UObject* WorldContextObject, struct FName StatName); // Function ShooterGame.AresAudioBlueprintLibrary.AudioStatsGetInt // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x3850280
	struct UAkAudioEvent* AresLoadAkAudioEventByPath(struct FString EventPath); // Function ShooterGame.AresAudioBlueprintLibrary.AresLoadAkAudioEventByPath // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x3850110
};

// Class ShooterGame.AresAudioComponent
// Size: 0x550 (Inherited: 0x460)
struct UAresAudioComponent : UAkComponent {
	bool bEnableDopplerRTPC; // 0x460(0x01)
	bool bEnableOcclusion; // 0x461(0x01)
	bool bSimpleOcclusion; // 0x462(0x01)
	bool bContinuousOcclusion; // 0x463(0x01)
	float OcclusionUpdateInterval; // 0x464(0x04)
	struct TArray<struct AActor*> OcclusionIgnoredActors; // 0x468(0x10)
	char pad_478[0x11]; // 0x478(0x11)
	bool bAllowActorRecycling; // 0x489(0x01)
	char pad_48A[0xc6]; // 0x48a(0xc6)

	void WillRecycleComponent(); // Function ShooterGame.AresAudioComponent.WillRecycleComponent // (Event|Public|BlueprintEvent) // @ game+0x4282c30
	void WillPostEvent(struct FString PostEventName); // Function ShooterGame.AresAudioComponent.WillPostEvent // (Event|Public|BlueprintEvent) // @ game+0x4282c30
	void UpdatePosition(); // Function ShooterGame.AresAudioComponent.UpdatePosition // (Final|BlueprintCosmetic|Native|Public|BlueprintCallable) // @ game+0x3851590
	void SetVolumeMultiplier(float VolumeMultiplier); // Function ShooterGame.AresAudioComponent.SetVolumeMultiplier // (Final|Native|Public|BlueprintCallable) // @ game+0x3851510
	void SetSurfaceType(enum class EAresSurfaceType AresSurfaceType); // Function ShooterGame.AresAudioComponent.SetSurfaceType // (Final|Native|Public|BlueprintCallable) // @ game+0x3851490
	void SetRegionDamage(enum class EAresRegionalDamage RegionDamage); // Function ShooterGame.AresAudioComponent.SetRegionDamage // (Final|Native|Public|BlueprintCallable) // @ game+0x3851410
	void SetImpactAllies(enum class EAresImpactEffectAllies Allies); // Function ShooterGame.AresAudioComponent.SetImpactAllies // (Final|Native|Public|BlueprintCallable) // @ game+0x3851390
	void SetHitSpace(enum class EAresImpactEffectHitspace HitSpace); // Function ShooterGame.AresAudioComponent.SetHitSpace // (Final|Native|Public|BlueprintCallable) // @ game+0x3851310
	void SetHitImpactArmor(enum class EAresImpactEffectWithArmor HitImpactArmor); // Function ShooterGame.AresAudioComponent.SetHitImpactArmor // (Final|Native|Public|BlueprintCallable) // @ game+0x3851290
	void SetHitConfirmLocality(enum class EAresHitConfirmLocality HitConfirmLocality); // Function ShooterGame.AresAudioComponent.SetHitConfirmLocality // (Final|Native|Public|BlueprintCallable) // @ game+0x3851210
	void SetFacingAngle(); // Function ShooterGame.AresAudioComponent.SetFacingAngle // (Final|Native|Public|BlueprintCallable) // @ game+0x38511f0
	void ResetAudioComponent(); // Function ShooterGame.AresAudioComponent.ResetAudioComponent // (Final|BlueprintCosmetic|Native|Public|BlueprintCallable) // @ game+0x3851060
	void PrepareForReuse(); // Function ShooterGame.AresAudioComponent.PrepareForReuse // (Final|BlueprintCosmetic|Native|Public|BlueprintCallable) // @ game+0x3851040
	float GetSoundFacingAngle(); // Function ShooterGame.AresAudioComponent.GetSoundFacingAngle // (Final|Native|Public|BlueprintCallable) // @ game+0x3850d00
	float GetOcclusionValue(); // Function ShooterGame.AresAudioComponent.GetOcclusionValue // (Final|Native|Public|BlueprintCallable) // @ game+0x3850ce0
	void GetComponentDebugString(struct FString& DebugString); // Function ShooterGame.AresAudioComponent.GetComponentDebugString // (Event|Public|HasOutParms|BlueprintEvent) // @ game+0x4282c30
	float ComputeOcclusion(); // Function ShooterGame.AresAudioComponent.ComputeOcclusion // (Event|Public|BlueprintEvent) // @ game+0x4282c30
	void ComputeDopplerRTPC(float DeltaTime); // Function ShooterGame.AresAudioComponent.ComputeDopplerRTPC // (Final|Native|Public|BlueprintCallable) // @ game+0x38506f0
	void AudioTick(float DeltaTime); // Function ShooterGame.AresAudioComponent.AudioTick // (Event|Public|BlueprintEvent) // @ game+0x4282c30
	void AresUseGlobal2DAudioComponent(struct UObject* WorldContextObject, struct UAkAudioEvent* Event); // Function ShooterGame.AresAudioComponent.AresUseGlobal2DAudioComponent // (Final|BlueprintCosmetic|Native|Static|Public|BlueprintCallable) // @ game+0x38501c0
	bool AresIsEventAudible(struct UObject* WorldContextObject, struct UAkAudioEvent* AudioEvent, struct FVector& Location, bool IsAttached, float VolumeMultiplier); // Function ShooterGame.AresAudioComponent.AresIsEventAudible // (Final|BlueprintCosmetic|Native|Static|Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintPure) // @ game+0x384ff40
	struct FVector AresGetListenerVelocity(struct UObject* WorldContextObject); // Function ShooterGame.AresAudioComponent.AresGetListenerVelocity // (Final|BlueprintCosmetic|Native|Static|Public|HasDefaults|BlueprintCallable|BlueprintPure) // @ game+0x384fea0
	struct FVector AresGetListenerPosition(struct UObject* WorldContextObject); // Function ShooterGame.AresAudioComponent.AresGetListenerPosition // (Final|BlueprintCosmetic|Native|Static|Public|HasDefaults|BlueprintCallable|BlueprintPure) // @ game+0x384fe00
	struct FVector AresGetListenerForward(struct UObject* WorldContextObject); // Function ShooterGame.AresAudioComponent.AresGetListenerForward // (Final|BlueprintCosmetic|Native|Static|Public|HasDefaults|BlueprintCallable|BlueprintPure) // @ game+0x384fd60
	struct APlayerController* AresGetActiveListenerPlayerController(struct UObject* WorldContextObject); // Function ShooterGame.AresAudioComponent.AresGetActiveListenerPlayerController // (Final|BlueprintCosmetic|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x384fcd0
	struct UAresAudioComponent* AresFindOrCreateReusableAudioComponentForWorld(struct UAresAudioComponent* ComponentClass, struct UObject* WorldContextObject, struct FVector& Location, struct FRotator& Orientation, struct FString ComponentName); // Function ShooterGame.AresAudioComponent.AresFindOrCreateReusableAudioComponentForWorld // (Final|BlueprintCosmetic|Native|Static|Public|HasOutParms|HasDefaults|BlueprintCallable) // @ game+0x384fae0
	struct UAresAudioComponent* AresFindOrCreateReusableAudioComponentForActor(struct UAresAudioComponent* ComponentClass, struct AActor* Owner, struct USceneComponent* ParentComponent, struct FName AttachPointName, struct FVector Offset); // Function ShooterGame.AresAudioComponent.AresFindOrCreateReusableAudioComponentForActor // (Final|BlueprintCosmetic|Native|Static|Public|HasDefaults|BlueprintCallable) // @ game+0x384f930
	struct UAresAudioComponent* AresCreateAudioComponentForActor(struct UAresAudioComponent* ComponentClass, struct AActor* Owner, struct USceneComponent* ParentComponent, struct FName AttachPointName, struct FVector Offset, struct FRotator Orientation, bool bAutoDestroyComponent, bool bStopWhenOwnerDestroyed, bool bAllowRecycling); // Function ShooterGame.AresAudioComponent.AresCreateAudioComponentForActor // (Final|BlueprintCosmetic|Native|Static|Public|HasDefaults|BlueprintCallable) // @ game+0x384f650
};

// Class ShooterGame.AresAudioComponentManagerComponent
// Size: 0x140 (Inherited: 0xe8)
struct UAresAudioComponentManagerComponent : UActorComponent {
	char pad_E8[0x8]; // 0xe8(0x08)
	struct TMap<struct UObject*, struct FAudioComponentPool> AudioComponentPools; // 0xf0(0x50)

	void SetPooledAudioLimit(int32_t Limit, struct UObject* ParentObject); // Function ShooterGame.AresAudioComponentManagerComponent.SetPooledAudioLimit // (Final|Native|Public|BlueprintCallable) // @ game+0x38574f0
	void RemovePoolFromMontage(struct UAnimMontage* Montage, bool bInterrupted); // Function ShooterGame.AresAudioComponentManagerComponent.RemovePoolFromMontage // (Final|Native|Public|BlueprintCallable) // @ game+0x3856720
	void RemovePooledAudioComponent(struct UAresAudioComponent* AudioComponent, struct UObject* ParentObject); // Function ShooterGame.AresAudioComponentManagerComponent.RemovePooledAudioComponent // (Final|Native|Public|BlueprintCallable) // @ game+0x38567f0
	void RemoveAudioPool(struct UObject* ParentObject, bool bStopAllAudio); // Function ShooterGame.AresAudioComponentManagerComponent.RemoveAudioPool // (Final|Native|Public|BlueprintCallable) // @ game+0x3856650
	void AddPooledAudioComponent(struct UAresAudioComponent* AudioComponent, struct UObject* ParentObject); // Function ShooterGame.AresAudioComponentManagerComponent.AddPooledAudioComponent // (Final|Native|Public|BlueprintCallable) // @ game+0x3855be0
};

// Class ShooterGame.AresAudioSettings
// Size: 0xa8 (Inherited: 0x48)
struct UAresAudioSettings : UDeveloperSettings {
	float BasicOcclusion; // 0x48(0x04)
	float HeavyOcclusion; // 0x4c(0x04)
	float SoundBlockerOcclusion; // 0x50(0x04)
	float NoOcclusionPathOcclusion; // 0x54(0x04)
	struct FSoftObjectPath HeavyOcclusionMaterial; // 0x58(0x20)
	struct FSoftObjectPath SoundBlockerMaterial; // 0x78(0x20)
	float InterpolationTimeMs; // 0x98(0x04)
	float TracePadding; // 0x9c(0x04)
	enum class ECollisionChannel DirectLineToSoundCollision; // 0xa0(0x01)
	enum class ECollisionChannel DetectBlockersCollision; // 0xa1(0x01)
	char pad_A2[0x6]; // 0xa2(0x06)
};

// Class ShooterGame.AutocompleteSuggestionBase
// Size: 0x2f8 (Inherited: 0x2c8)
struct UAutocompleteSuggestionBase : UUserWidget {
	struct FString Suggestion; // 0x2c8(0x10)
	struct FMulticastInlineDelegate OnClick; // 0x2d8(0x10)
	struct FMulticastInlineDelegate OnHover; // 0x2e8(0x10)

	void SetHighlighted(bool Highlighted); // Function ShooterGame.AutocompleteSuggestionBase.SetHighlighted // (Event|Public|BlueprintCallable|BlueprintEvent) // @ game+0x4282c30
};

// Class ShooterGame.AutocompleteProvider
// Size: 0x30 (Inherited: 0x30)
struct UAutocompleteProvider : UInterface {

	bool PerformsAutoFill(); // Function ShooterGame.AutocompleteProvider.PerformsAutoFill // (Event|Public|BlueprintCallable|BlueprintEvent|BlueprintPure|Const) // @ game+0x4282c30
	bool IsRelevant(struct TArray<struct FString>& Tokens); // Function ShooterGame.AutocompleteProvider.IsRelevant // (Event|Public|HasOutParms|BlueprintCallable|BlueprintEvent|BlueprintPure|Const) // @ game+0x4282c30
	struct UAutocompleteSuggestionBase* GetSuggestionWidgetClass(); // Function ShooterGame.AutocompleteProvider.GetSuggestionWidgetClass // (Event|Public|BlueprintCallable|BlueprintEvent|BlueprintPure|Const) // @ game+0x4282c30
	struct TArray<struct FString> GetAllSuggestions(struct UAresClientGameInstance* AresClientGame); // Function ShooterGame.AutocompleteProvider.GetAllSuggestions // (Event|Public|BlueprintCallable|BlueprintEvent|BlueprintPure|Const) // @ game+0x4282c30
};

// Class ShooterGame.AresAutocompleteTextBox
// Size: 0x328 (Inherited: 0x2c8)
struct UAresAutocompleteTextBox : UUserWidget {
	struct UEditableTextBox* RawTextBox; // 0x2c8(0x08)
	int32_t MaxSuggestions; // 0x2d0(0x04)
	bool ShouldSplitInputOnSpace; // 0x2d4(0x01)
	char pad_2D5[0x3]; // 0x2d5(0x03)
	struct FString LastToken; // 0x2d8(0x10)
	bool bAutoFill; // 0x2e8(0x01)
	char pad_2E9[0x7]; // 0x2e9(0x07)
	struct UAutocompleteSuggestionBase* CurrentSuggestionWidgetClass; // 0x2f0(0x08)
	struct TArray<struct FString> CurrentSuggestions; // 0x2f8(0x10)
	bool bApplyingSuggestion; // 0x308(0x01)
	char pad_309[0x7]; // 0x309(0x07)
	struct TArray<struct TScriptInterface<IAutocompleteProvider>> Providers; // 0x310(0x10)
	struct UEmojiMapping* EmojiMapping; // 0x320(0x08)

	void UpdateSuggestions(struct FString Input); // Function ShooterGame.AresAutocompleteTextBox.UpdateSuggestions // (Final|Native|Protected|BlueprintCallable) // @ game+0x3857850
	struct TArray<struct FString> TokenizeInput(struct FString Input, bool SplitOnSpace); // Function ShooterGame.AresAutocompleteTextBox.TokenizeInput // (Final|Native|Protected|Const) // @ game+0x38575c0
	void ApplySuggestion(struct UEditableTextBox* TargetTextBox, struct FString Suggestion); // Function ShooterGame.AresAutocompleteTextBox.ApplySuggestion // (Final|Native|Protected|BlueprintCallable) // @ game+0x3855ea0
};

// Class ShooterGame.AresBaseGameInstance
// Size: 0x30 (Inherited: 0x30)
struct UAresBaseGameInstance : UObject {
};

// Class ShooterGame.AresCommonButton
// Size: 0x1028 (Inherited: 0xce8)
struct UAresCommonButton : UCommonButtonBase {
	char pad_CE8[0x18]; // 0xce8(0x18)
	struct TArray<struct TScriptInterface<IAresButtonComponent>> ButtonComponents; // 0xd00(0x10)
	struct FText Text; // 0xd10(0x18)
	struct FText SecondaryText; // 0xd28(0x18)
	struct FSlateBrush IconBrush; // 0xd40(0x90)
	enum class EInputEvent TriggeringInputActionEvent; // 0xdd0(0x01)
	bool bFocusIsHover; // 0xdd1(0x01)
	char pad_DD2[0x6]; // 0xdd2(0x06)
	struct FMulticastInlineDelegate OnButtonBaseLongClicked; // 0xdd8(0x10)
	char pad_DE8[0x18]; // 0xde8(0x18)
	struct TArray<struct FAresConditionalInputActionData> ConditionalInputActionsNew; // 0xe00(0x10)
	char pad_E10[0x50]; // 0xe10(0x50)
	struct TArray<struct FAresCommonConditionalInputAction> ConditionalInputActions; // 0xe60(0x10)
	bool bShouldLongClickTriggerRegularClick; // 0xe70(0x01)
	char pad_E71[0x7]; // 0xe71(0x07)
	struct UCommonTextBlock* ButtonText; // 0xe78(0x08)
	struct UImage* ButtonIcon; // 0xe80(0x08)
	bool bDisplayInActionBar_TMP; // 0xe88(0x01)
	char pad_E89[0x7]; // 0xe89(0x07)
	struct FText OverrideTriggerActionDisplayName; // 0xe90(0x18)
	struct FButtonMaterialAnimations MaterialAnimations[0x9]; // 0xea8(0x90)
	struct TMap<struct FName, struct UMaterialInstanceDynamic*> AnimatableMaterials; // 0xf38(0x50)
	struct FName StyleMaterialParamFocused; // 0xf88(0x0c)
	struct FName StyleMaterialParamPressed; // 0xf94(0x0c)
	struct FName StyleMaterialParamSelected; // 0xfa0(0x0c)
	struct FName StyleMaterialParamEnabled; // 0xfac(0x0c)
	char pad_FB8[0x8]; // 0xfb8(0x08)
	struct TScriptInterface<IButtonTextWidgetComponent> PrimaryTextComponent; // 0xfc0(0x10)
	struct TScriptInterface<IButtonTextWidgetComponent> SecondaryTextComponent; // 0xfd0(0x10)
	struct TArray<struct FHeldProgressMaterialPair> ProgressMaterials; // 0xfe0(0x10)
	char pad_FF0[0x28]; // 0xff0(0x28)
	struct TArray<struct FButtonMaterialAnimationInfo> ActiveMaterialAnimations; // 0x1018(0x10)

	void UnregisterProgressMaterial(struct UMaterialInstanceDynamic* ProgressMaterial); // Function ShooterGame.AresCommonButton.UnregisterProgressMaterial // (Final|Native|Public|BlueprintCallable) // @ game+0x3879070
	void SetText(struct FText& InText); // Function ShooterGame.AresCommonButton.SetText // (Native|Event|Public|HasOutParms|BlueprintCallable|BlueprintEvent) // @ game+0x3878f60
	void SetSecondaryText(struct FText& InText); // Function ShooterGame.AresCommonButton.SetSecondaryText // (Native|Event|Public|HasOutParms|BlueprintCallable|BlueprintEvent) // @ game+0x3878e70
	void SetImageBrushFromTexture(struct UTexture2D* Texture, bool bMatchSize); // Function ShooterGame.AresCommonButton.SetImageBrushFromTexture // (Native|Public|BlueprintCallable) // @ game+0x3878ce0
	void SetImageBrushFromMaterial(struct UMaterialInterface* Material); // Function ShooterGame.AresCommonButton.SetImageBrushFromMaterial // (Native|Public|BlueprintCallable) // @ game+0x3878c50
	void SetConditionalInputActionOverrideNameByInputAction(struct FDataTableRowHandle& InputAction, struct FText NewName); // Function ShooterGame.AresCommonButton.SetConditionalInputActionOverrideNameByInputAction // (Final|Native|Protected|HasOutParms|BlueprintCallable) // @ game+0x3878af0
	void SetConditionalInputActionOverrideNameByIndex(int32_t Index, struct FText NewName); // Function ShooterGame.AresCommonButton.SetConditionalInputActionOverrideNameByIndex // (Final|Native|Protected|BlueprintCallable) // @ game+0x38789b0
	void SetConditionalInputActionEnabledByInputAction(struct FDataTableRowHandle& InputAction, bool IsEnabled); // Function ShooterGame.AresCommonButton.SetConditionalInputActionEnabledByInputAction // (Final|Native|Protected|HasOutParms|BlueprintCallable) // @ game+0x38788c0
	void SetConditionalInputActionEnabledByIndex(int32_t Index, bool IsEnabled); // Function ShooterGame.AresCommonButton.SetConditionalInputActionEnabledByIndex // (Final|Native|Protected|BlueprintCallable) // @ game+0x38787f0
	void SetBrushFromTexture(struct UTexture2D* Texture, bool bMatchSize); // Function ShooterGame.AresCommonButton.SetBrushFromTexture // (Final|Native|Public|BlueprintCallable) // @ game+0x3878690
	void RegisterProgressMaterial(struct FHeldProgressMaterialPair ProgressMaterialInfo); // Function ShooterGame.AresCommonButton.RegisterProgressMaterial // (Final|Native|Public|BlueprintCallable) // @ game+0x3878380
	void OnMaterialAnimationsInitialized(); // Function ShooterGame.AresCommonButton.OnMaterialAnimationsInitialized // (Native|Event|Protected|BlueprintEvent) // @ game+0x3840b70
	void HandleButtonLongClicked(); // Function ShooterGame.AresCommonButton.HandleButtonLongClicked // (Final|Native|Protected) // @ game+0x3877f40
	enum class EAresCommonButtonVisibleState GetVisibleState(); // Function ShooterGame.AresCommonButton.GetVisibleState // (Final|Native|Public|BlueprintCallable|BlueprintPure) // @ game+0x3877ee0
	struct UCommonTextStyle* GetTextStyleClassForVisibleState(enum class EAresCommonButtonVisibleState State); // Function ShooterGame.AresCommonButton.GetTextStyleClassForVisibleState // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x3877db0
	struct FText GetText(); // Function ShooterGame.AresCommonButton.GetText // (Final|Native|Public|BlueprintCallable|BlueprintPure) // @ game+0x3877cc0
	struct FText GetSecondaryText(); // Function ShooterGame.AresCommonButton.GetSecondaryText // (Final|Native|Public|BlueprintCallable|BlueprintPure) // @ game+0x3877c00
	bool GetIsConditionalInputActionEnabledByInputAction(struct FDataTableRowHandle& InputAction); // Function ShooterGame.AresCommonButton.GetIsConditionalInputActionEnabledByInputAction // (Final|Native|Protected|HasOutParms|BlueprintCallable) // @ game+0x3877a20
	bool GetIsConditionalInputActionEnabledByIndex(int32_t Index); // Function ShooterGame.AresCommonButton.GetIsConditionalInputActionEnabledByIndex // (Final|Native|Protected|BlueprintCallable) // @ game+0x3877980
	struct FText GetConditionalInputActionNameOverrideByInputAction(struct FDataTableRowHandle& InputAction); // Function ShooterGame.AresCommonButton.GetConditionalInputActionNameOverrideByInputAction // (Final|Native|Protected|HasOutParms|BlueprintCallable) // @ game+0x3877840
	struct TMap<struct FName, struct UMaterialInstanceDynamic*> GetAnimatableMaterialsMap(); // Function ShooterGame.AresCommonButton.GetAnimatableMaterialsMap // (Native|Event|Protected|BlueprintEvent) // @ game+0x3877580
	void DisableConditionalActionsOfInputCondition(enum class EAresCommonInputCondition InputCondition); // Function ShooterGame.AresCommonButton.DisableConditionalActionsOfInputCondition // (Final|Native|Protected|BlueprintCallable) // @ game+0x3877350
	void BP_OnTransitionUnHovered(); // Function ShooterGame.AresCommonButton.BP_OnTransitionUnHovered // (Event|Protected|BlueprintEvent) // @ game+0x4282c30
	void BP_OnTransitionSelected(); // Function ShooterGame.AresCommonButton.BP_OnTransitionSelected // (Event|Protected|BlueprintEvent) // @ game+0x4282c30
	void BP_OnTransitionReleased(); // Function ShooterGame.AresCommonButton.BP_OnTransitionReleased // (Event|Protected|BlueprintEvent) // @ game+0x4282c30
	void BP_OnTransitionPressed(); // Function ShooterGame.AresCommonButton.BP_OnTransitionPressed // (Event|Protected|BlueprintEvent) // @ game+0x4282c30
	void BP_OnTransitionHovered(); // Function ShooterGame.AresCommonButton.BP_OnTransitionHovered // (Event|Protected|BlueprintEvent) // @ game+0x4282c30
	void BP_OnTransitionEnabled(); // Function ShooterGame.AresCommonButton.BP_OnTransitionEnabled // (Event|Protected|BlueprintEvent) // @ game+0x4282c30
	void BP_OnTransitionDisabled(); // Function ShooterGame.AresCommonButton.BP_OnTransitionDisabled // (Event|Protected|BlueprintEvent) // @ game+0x4282c30
	void BP_OnTransitionDeselected(); // Function ShooterGame.AresCommonButton.BP_OnTransitionDeselected // (Event|Protected|BlueprintEvent) // @ game+0x4282c30
	void BP_OnLongClicked(); // Function ShooterGame.AresCommonButton.BP_OnLongClicked // (Event|Protected|BlueprintEvent) // @ game+0x4282c30
};

// Class ShooterGame.AresClickablePanel
// Size: 0x1030 (Inherited: 0x1028)
struct UAresClickablePanel : UAresCommonButton {
	char pad_1028[0x8]; // 0x1028(0x08)

	void K2_BindToViewModel(); // Function ShooterGame.AresClickablePanel.K2_BindToViewModel // (Event|Public|BlueprintEvent) // @ game+0x4282c30
};

// Class ShooterGame.AresSettingClickablePanel
// Size: 0x1070 (Inherited: 0x1030)
struct UAresSettingClickablePanel : UAresClickablePanel {
	bool bListenForLeftRightNavigation; // 0x1030(0x01)
	bool bListenForHeldLeftRightNavigation; // 0x1031(0x01)
	char pad_1032[0x6]; // 0x1032(0x06)
	struct UAresSettingUIData* SettingDataAssetClass; // 0x1038(0x08)
	struct UAresSettingUIData* SettingDataAsset; // 0x1040(0x08)
	bool bIsLeftNavigationDown; // 0x1048(0x01)
	bool bIsLeftNavigationHeld; // 0x1049(0x01)
	bool bIsRightNavigationDown; // 0x104a(0x01)
	bool bIsRightNavigationHeld; // 0x104b(0x01)
	char pad_104C[0x1c]; // 0x104c(0x1c)
	struct USettingsOptionViewModel* SettingOptionViewModel; // 0x1068(0x08)

	void SetSettingDataAsset(struct UAresSettingUIData* InSettingDataAsset); // Function ShooterGame.AresSettingClickablePanel.SetSettingDataAsset // (Final|Native|Public|BlueprintCallable) // @ game+0x392a200
	void RefreshViewFromSettingOptionViewModel(); // Function ShooterGame.AresSettingClickablePanel.RefreshViewFromSettingOptionViewModel // (Native|Event|Protected|BlueprintEvent) // @ game+0x39292c0
	void OnDependentStateChanged(enum class EAresWidgetDependentState NewState); // Function ShooterGame.AresSettingClickablePanel.OnDependentStateChanged // (Native|Event|Protected|BlueprintEvent) // @ game+0x3928ef0
	void InternalOnRightNavigationUp(); // Function ShooterGame.AresSettingClickablePanel.InternalOnRightNavigationUp // (Native|Event|Protected|BlueprintEvent) // @ game+0x39287c0
	void InternalOnRightNavigationReleased(); // Function ShooterGame.AresSettingClickablePanel.InternalOnRightNavigationReleased // (Native|Event|Protected|BlueprintEvent) // @ game+0x3928790
	void InternalOnRightNavigationHeld(); // Function ShooterGame.AresSettingClickablePanel.InternalOnRightNavigationHeld // (Native|Event|Protected|BlueprintEvent) // @ game+0x3928760
	void InternalOnRightNavigation(); // Function ShooterGame.AresSettingClickablePanel.InternalOnRightNavigation // (Native|Event|Protected|BlueprintEvent) // @ game+0x3928730
	void InternalOnLeftNavigationUp(); // Function ShooterGame.AresSettingClickablePanel.InternalOnLeftNavigationUp // (Native|Event|Protected|BlueprintEvent) // @ game+0x3928700
	void InternalOnLeftNavigationReleased(); // Function ShooterGame.AresSettingClickablePanel.InternalOnLeftNavigationReleased // (Native|Event|Protected|BlueprintEvent) // @ game+0x39286d0
	void InternalOnLeftNavigationHeld(); // Function ShooterGame.AresSettingClickablePanel.InternalOnLeftNavigationHeld // (Native|Event|Protected|BlueprintEvent) // @ game+0x39286a0
	void InternalOnLeftNavigation(); // Function ShooterGame.AresSettingClickablePanel.InternalOnLeftNavigation // (Native|Event|Protected|BlueprintEvent) // @ game+0x3928670
	struct UAresSettingUIData* BP_GetSettingDataAssetAs(struct UAresSettingUIData* AsType, bool& bIsValid); // Function ShooterGame.AresSettingClickablePanel.BP_GetSettingDataAssetAs // (Final|Native|Public|HasOutParms|BlueprintCallable) // @ game+0x3926d00
	void BindToSettingOptionViewModel(bool bBind); // Function ShooterGame.AresSettingClickablePanel.BindToSettingOptionViewModel // (Native|Event|Protected|BlueprintEvent) // @ game+0x3927060
};

// Class ShooterGame.AresBoolSettingClickablePanel
// Size: 0x10b8 (Inherited: 0x1070)
struct UAresBoolSettingClickablePanel : UAresSettingClickablePanel {
	struct UMaterialInstance* ToggleMaterial; // 0x1070(0x08)
	struct UMaterialInstanceDynamic* ToggleMaterialInst; // 0x1078(0x08)
	struct FText OnText; // 0x1080(0x18)
	struct FText OffText; // 0x1098(0x18)
	struct USettingsBoolViewModel* BoolSettingViewModel; // 0x10b0(0x08)

	void SetOnText(struct FText& InOnText); // Function ShooterGame.AresBoolSettingClickablePanel.SetOnText // (Native|Event|Public|HasOutParms|BlueprintCallable|BlueprintEvent) // @ game+0x3857400
	void SetOffText(struct FText& InOffText); // Function ShooterGame.AresBoolSettingClickablePanel.SetOffText // (Native|Event|Public|HasOutParms|BlueprintCallable|BlueprintEvent) // @ game+0x3857310
	void OnToggleStateChanged(bool bIsSelected); // Function ShooterGame.AresBoolSettingClickablePanel.OnToggleStateChanged // (Native|Event|Protected|BlueprintEvent) // @ game+0x3856570
	void OnSettingValueChanged(bool NewValue); // Function ShooterGame.AresBoolSettingClickablePanel.OnSettingValueChanged // (Final|Native|Protected) // @ game+0x38564e0
	void OnMaterialCreated(); // Function ShooterGame.AresBoolSettingClickablePanel.OnMaterialCreated // (Native|Event|Protected|BlueprintEvent) // @ game+0x38564b0
	struct USettingsBoolViewModel* GetSettingOptionViewModelAsBoolSetting(); // Function ShooterGame.AresBoolSettingClickablePanel.GetSettingOptionViewModelAsBoolSetting // (Final|Native|Public|BlueprintCallable|BlueprintPure) // @ game+0x3856480
};

// Class ShooterGame.AresBotAimDebugComponent
// Size: 0x108 (Inherited: 0xe8)
struct UAresBotAimDebugComponent : UActorComponent {
	char pad_E8[0x20]; // 0xe8(0x20)

	void ClearTopPreaimPoints(); // Function ShooterGame.AresBotAimDebugComponent.ClearTopPreaimPoints // (Final|Native|Public|BlueprintCallable) // @ game+0x3855fb0
	void ClearTopCombatTargets(); // Function ShooterGame.AresBotAimDebugComponent.ClearTopCombatTargets // (Final|Native|Public|BlueprintCallable) // @ game+0x3855f90
	void AddTopPreaimPoint(struct AActor* PreaimPoint, struct TMap<struct FString, float>& UtilValues, float TotalUtility, int32_t HeapSize); // Function ShooterGame.AresBotAimDebugComponent.AddTopPreaimPoint // (Final|Native|Public|HasOutParms|BlueprintCallable) // @ game+0x3855cb0
	void AddTopCombatTarget(struct AActor* CombatTarget, struct TMap<struct FString, float>& UtilValues, float TotalUtility, int32_t HeapSize); // Function ShooterGame.AresBotAimDebugComponent.AddTopCombatTarget // (Final|Native|Public|HasOutParms|BlueprintCallable) // @ game+0x3855cb0
};

// Class ShooterGame.ShooterAIController
// Size: 0x528 (Inherited: 0x4d8)
struct AShooterAIController : AAIController {
	struct URoundPersistenceComponent* Persistence; // 0x4d8(0x08)
	bool bTurretAiming; // 0x4e0(0x01)
	char pad_4E1[0xf]; // 0x4e1(0x0f)
	struct AShooterCharacter* PossessedShooterCharacter; // 0x4f0(0x08)
	struct FName ShooterCharacterFocalPointBone; // 0x4f8(0x0c)
	bool bMovementDownTickingEnabled; // 0x504(0x01)
	char pad_505[0x3]; // 0x505(0x03)
	struct FMulticastInlineDelegate OnPossessPawn; // 0x508(0x10)
	struct FMulticastInlineDelegate OnUnpossessPawn; // 0x518(0x10)

	void UnSetPossessedCharacter(); // Function ShooterGame.ShooterAIController.UnSetPossessedCharacter // (Final|Native|Public|BlueprintCallable) // @ game+0x3d600a0
	void SetPossessedCharacter(struct APawn* InPawn); // Function ShooterGame.ShooterAIController.SetPossessedCharacter // (Final|Native|Public|BlueprintCallable) // @ game+0x3d5e5c0
	void SetAimOffset(struct FVector& NewOffset); // Function ShooterGame.ShooterAIController.SetAimOffset // (Final|BlueprintAuthorityOnly|Native|Public|HasOutParms|HasDefaults|BlueprintCallable) // @ game+0x3d5e120
	void OnJumpSignal(bool bShouldJump); // Function ShooterGame.ShooterAIController.OnJumpSignal // (Final|Native|Private) // @ game+0x3d5bcc0
	void OnCrouchSignal(bool bShouldCrouch); // Function ShooterGame.ShooterAIController.OnCrouchSignal // (Final|Native|Private) // @ game+0x3d5bc30
	void ClearAimOffset(); // Function ShooterGame.ShooterAIController.ClearAimOffset // (Final|BlueprintAuthorityOnly|Native|Public|BlueprintCallable) // @ game+0x3d4d5c0
};

// Class ShooterGame.AresBotController
// Size: 0x548 (Inherited: 0x528)
struct AAresBotController : AShooterAIController {
	bool bAutoSetClass; // 0x528(0x01)
	bool bRandomizeShootingSkillMultiplier; // 0x529(0x01)
	char pad_52A[0x2]; // 0x52a(0x02)
	float MinShootingSkillMultiplier; // 0x52c(0x04)
	float MaxShootingSkillMultiplier; // 0x530(0x04)
	struct FName ShootingSkillMultiplierKeyName; // 0x534(0x0c)
	bool bCanPickupBombEquippable; // 0x540(0x01)
	char pad_541[0x7]; // 0x541(0x07)
};

// Class ShooterGame.AresBotDebugComponent
// Size: 0x128 (Inherited: 0xe8)
struct UAresBotDebugComponent : UActorComponent {
	bool bDrawCombatAimDebug; // 0xe8(0x01)
	bool bDrawRecoilCompensationDebug; // 0xe9(0x01)
	bool bDrawMovementCompensationDebug; // 0xea(0x01)
	bool bDrawMechanicalAimDebug; // 0xeb(0x01)
	bool bUseNewCombatAim; // 0xec(0x01)
	bool bShouldOverrideAimOffset; // 0xed(0x01)
	enum class EAIAimPlayerCharacterOffset OverrideAimOffsetType; // 0xee(0x01)
	bool bShouldOverrideMovementReactionTime; // 0xef(0x01)
	float OverrideMovementReactionTime; // 0xf0(0x04)
	bool bShouldOverrideFlickAngleErrorStd; // 0xf4(0x01)
	char pad_F5[0x3]; // 0xf5(0x03)
	float OverrideFlickAngleErrorStd; // 0xf8(0x04)
	float FlickDistanceErrorStdMultiplier; // 0xfc(0x04)
	bool bShouldOverridePostFlickDelayMean; // 0x100(0x01)
	char pad_101[0x3]; // 0x101(0x03)
	float OverridePostFlickDelayMean; // 0x104(0x04)
	float SmoothAdjustTowardsTargetSpeedMultiplier; // 0x108(0x04)
	struct FVector ForceMoveToLocation; // 0x10c(0x0c)
	bool bShouldForceMove; // 0x118(0x01)
	char pad_119[0x3]; // 0x119(0x03)
	float OverrideFiringDelaySecondsAgainstNewTarget; // 0x11c(0x04)
	float OverrideFiringDelaySecondsAfterTargetEntersVision; // 0x120(0x04)
	char pad_124[0x4]; // 0x124(0x04)

	struct FVector PopForceMoveToLocation(); // Function ShooterGame.AresBotDebugComponent.PopForceMoveToLocation // (Final|Native|Public|HasDefaults|BlueprintCallable) // @ game+0x3856610
	int32_t DrawPersistentDebugSphereOnAllClients(int32_t ID, float LifeTime, struct FVector Center, float Radius, int32_t Segments, struct FColor Color, char DepthPriority); // Function ShooterGame.AresBotDebugComponent.DrawPersistentDebugSphereOnAllClients // (Final|Native|Public|HasDefaults|BlueprintCallable) // @ game+0x3856200
	int32_t DrawPersistentDebugLineOnAllClients(int32_t ID, float LifeTime, struct FVector LineStart, struct FVector LineEnd, struct FColor Color, char DepthPriority, float Thickness); // Function ShooterGame.AresBotDebugComponent.DrawPersistentDebugLineOnAllClients // (Final|Native|Public|HasDefaults|BlueprintCallable) // @ game+0x3855fd0
};

// Class ShooterGame.AresBotDebugPlayerComponent
// Size: 0x160 (Inherited: 0xe8)
struct UAresBotDebugPlayerComponent : UActorComponent {
	struct FRateLimiter RateLimiter; // 0xe8(0x30)
	char pad_118[0x28]; // 0x118(0x28)
	struct FMulticastInlineDelegate ClientBotAimControlChangedDelegate; // 0x140(0x10)
	struct FMulticastInlineDelegate ClientBotMovementControlChangedDelegate; // 0x150(0x10)

	void UpdateReplicatedDebugInfo(struct TArray<struct FAresDebugSpherePersistent> DebugSpheres, struct TArray<struct FAresDebugLinePersistent> DebugLines); // Function ShooterGame.AresBotDebugPlayerComponent.UpdateReplicatedDebugInfo // (Final|Net|Native|Event|Private|NetClient) // @ game+0x3857750
	void ServerSetFiringDelaySecondsAgainstNewTarget(float FiringDelaySeconds); // Function ShooterGame.AresBotDebugPlayerComponent.ServerSetFiringDelaySecondsAgainstNewTarget // (Net|NetReliableNative|Event|Public|NetServer) // @ game+0x3857280
	void ServerSetFiringDelaySecondsAfterTargetEntersVision(float FiringDelaySeconds); // Function ShooterGame.AresBotDebugPlayerComponent.ServerSetFiringDelaySecondsAfterTargetEntersVision // (Net|NetReliableNative|Event|Public|NetServer) // @ game+0x38571f0
	void ServerSetBotsUseNewCombatAim(bool bUseNewCombatAim); // Function ShooterGame.AresBotDebugPlayerComponent.ServerSetBotsUseNewCombatAim // (Net|NetReliableNative|Event|Public|NetServer) // @ game+0x3857150
	void ServerSetBotsSmoothAdjustTowardsTargetSpeedMultiplier(float Multiplier); // Function ShooterGame.AresBotDebugPlayerComponent.ServerSetBotsSmoothAdjustTowardsTargetSpeedMultiplier // (Net|NetReliableNative|Event|Public|NetServer) // @ game+0x38570c0
	void ServerSetBotsShouldDrawRecoilCompensationDebug(bool bShouldDraw); // Function ShooterGame.AresBotDebugPlayerComponent.ServerSetBotsShouldDrawRecoilCompensationDebug // (Net|NetReliableNative|Event|Public|NetServer) // @ game+0x3857020
	void ServerSetBotsShouldDrawMovementCompensationDebug(bool bShouldDraw); // Function ShooterGame.AresBotDebugPlayerComponent.ServerSetBotsShouldDrawMovementCompensationDebug // (Net|NetReliableNative|Event|Public|NetServer) // @ game+0x3856f80
	void ServerSetBotsShouldDrawMechanicalAimDebug(bool bShouldDraw); // Function ShooterGame.AresBotDebugPlayerComponent.ServerSetBotsShouldDrawMechanicalAimDebug // (Net|NetReliableNative|Event|Public|NetServer) // @ game+0x3856ee0
	void ServerSetBotsShouldDrawCombatAimDebug(bool bShouldDraw); // Function ShooterGame.AresBotDebugPlayerComponent.ServerSetBotsShouldDrawCombatAimDebug // (Net|NetReliableNative|Event|Public|NetServer) // @ game+0x3856e40
	void ServerSetBotsOverridePostFlickDelayMean(bool bShouldOverride, float PostFlickDelayMean); // Function ShooterGame.AresBotDebugPlayerComponent.ServerSetBotsOverridePostFlickDelayMean // (Net|NetReliableNative|Event|Public|NetServer) // @ game+0x3856d60
	void ServerSetBotsOverrideMovementReactionTime(bool bShouldOverride, float ReactionTime); // Function ShooterGame.AresBotDebugPlayerComponent.ServerSetBotsOverrideMovementReactionTime // (Net|NetReliableNative|Event|Public|NetServer) // @ game+0x3856c80
	void ServerSetBotsOverrideFlickAngleErrorStd(bool bShouldOverride, float FlickAngleErrorStd); // Function ShooterGame.AresBotDebugPlayerComponent.ServerSetBotsOverrideFlickAngleErrorStd // (Net|NetReliableNative|Event|Public|NetServer) // @ game+0x3856ba0
	void ServerSetBotsOverrideAimOffset(bool bShouldOverride, enum class EAIAimPlayerCharacterOffset AimOffset); // Function ShooterGame.AresBotDebugPlayerComponent.ServerSetBotsOverrideAimOffset // (Net|NetReliableNative|Event|Public|NetServer) // @ game+0x3856ac0
	void ServerSetBotsForceMoveTo(struct FVector Location, struct TArray<struct FString> ArgsArray, struct AShooterPlayerState* PlayerState); // Function ShooterGame.AresBotDebugPlayerComponent.ServerSetBotsForceMoveTo // (Net|NetReliableNative|Event|Public|NetServer|HasDefaults) // @ game+0x3856950
	void ServerSetBotsFlickDistanceErrorStdMultiplier(float Multiplier); // Function ShooterGame.AresBotDebugPlayerComponent.ServerSetBotsFlickDistanceErrorStdMultiplier // (Net|NetReliableNative|Event|Public|NetServer) // @ game+0x38568c0
	bool GetBotShouldHaveMovementControl(); // Function ShooterGame.AresBotDebugPlayerComponent.GetBotShouldHaveMovementControl // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x3856450
	bool GetBotShouldHaveAimControl(); // Function ShooterGame.AresBotDebugPlayerComponent.GetBotShouldHaveAimControl // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x3856420
};

// Class ShooterGame.AresButtonBorderComponent
// Size: 0x300 (Inherited: 0x2f0)
struct UAresButtonBorderComponent : UCommonBorder {
	char pad_2F0[0x8]; // 0x2f0(0x08)
	struct UAresCommonButton* OwningButton; // 0x2f8(0x08)
};

// Class ShooterGame.AresButtonBorderStyle
// Size: 0x420 (Inherited: 0xc0)
struct UAresButtonBorderStyle : UCommonBorderStyle {
	struct FSlateBrush BorderStyles[0x6]; // 0xc0(0x360)

	void GetBorderBrushForButtonVisibilityState(struct FSlateBrush& Brush, enum class EAresCommonButtonVisibleState State); // Function ShooterGame.AresButtonBorderStyle.GetBorderBrushForButtonVisibilityState // (Final|Native|Public|HasOutParms|BlueprintCallable|BlueprintPure|Const) // @ game+0x385f320
};

// Class ShooterGame.AresButtonImageBrushContainer
// Size: 0x390 (Inherited: 0x30)
struct UAresButtonImageBrushContainer : UObject {
	struct FSlateBrush ImageBrushes[0x6]; // 0x30(0x360)

	void GetImageBrushForButtonVisibilityState(struct FSlateBrush& Brush, enum class EAresCommonButtonVisibleState State); // Function ShooterGame.AresButtonImageBrushContainer.GetImageBrushForButtonVisibilityState // (Final|Native|Public|HasOutParms|BlueprintCallable|BlueprintPure|Const) // @ game+0x385f7d0
};

// Class ShooterGame.AresButtonImageComponent
// Size: 0x280 (Inherited: 0x268)
struct UAresButtonImageComponent : UImage {
	char pad_268[0x8]; // 0x268(0x08)
	struct UAresButtonImageBrushContainer* BrushContainer; // 0x270(0x08)
	char pad_278[0x8]; // 0x278(0x08)

	void SetBrushContainer(struct UAresButtonImageBrushContainer* InBrushContainer); // Function ShooterGame.AresButtonImageComponent.SetBrushContainer // (Final|Native|Public|BlueprintCallable) // @ game+0x38601f0
};

// Class ShooterGame.AresCommonRichText
// Size: 0x730 (Inherited: 0x730)
struct UAresCommonRichText : UCommonRichTextBlock {
};

// Class ShooterGame.AresButtonRichTextComponent
// Size: 0x758 (Inherited: 0x730)
struct UAresButtonRichTextComponent : UAresCommonRichText {
	char pad_730[0x10]; // 0x730(0x10)
	struct UAresButtonTextStyleContainer* ButtonTextStyleOverride; // 0x740(0x08)
	struct UAresCommonButton* OwningButton; // 0x748(0x08)
	enum class EButtonTextWidgetComponentType TextComponentType; // 0x750(0x01)
	char pad_751[0x7]; // 0x751(0x07)
};

// Class ShooterGame.AresCommonText
// Size: 0x338 (Inherited: 0x338)
struct UAresCommonText : UCommonTextBlock {
};

// Class ShooterGame.AresButtonTextComponent
// Size: 0x360 (Inherited: 0x338)
struct UAresButtonTextComponent : UAresCommonText {
	char pad_338[0x10]; // 0x338(0x10)
	struct UAresButtonTextStyleContainer* ButtonTextStyleOverride; // 0x348(0x08)
	struct UAresCommonButton* OwningButton; // 0x350(0x08)
	enum class EButtonTextWidgetComponentType TextComponentType; // 0x358(0x01)
	char pad_359[0x7]; // 0x359(0x07)
};

// Class ShooterGame.AresCalloutRegion
// Size: 0x3f8 (Inherited: 0x3b8)
struct AAresCalloutRegion : AActor {
	struct FText RegionName; // 0x3b8(0x18)
	enum class ECalloutSuperRegion SuperRegion; // 0x3d0(0x01)
	char pad_3D1[0x3]; // 0x3d1(0x03)
	int32_t Priority; // 0x3d4(0x04)
	struct TArray<struct UAresCalloutSubregionComponent*> SubRegions; // 0x3d8(0x10)
	struct UTextRenderComponent* EditorNameText; // 0x3e8(0x08)
	char pad_3F0[0x8]; // 0x3f0(0x08)

	void OnCalloutRegionsFeatureToggled(enum class EGameFeatureToggleName Toggle, bool bEnabled); // Function ShooterGame.AresCalloutRegion.OnCalloutRegionsFeatureToggled // (Final|Native|Public) // @ game+0x385fbd0
	bool ContainsActor(struct AActor* Actor); // Function ShooterGame.AresCalloutRegion.ContainsActor // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x385f130
};

// Class ShooterGame.AresCalloutSubregionComponent
// Size: 0x610 (Inherited: 0x610)
struct UAresCalloutSubregionComponent : UStaticMeshComponent {

	struct AAresCalloutRegion* GetParentRegion(); // Function ShooterGame.AresCalloutSubregionComponent.GetParentRegion // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x385f960
};

// Class ShooterGame.CalloutRegionTrackingComponent
// Size: 0x110 (Inherited: 0xe8)
struct UCalloutRegionTrackingComponent : UActorComponent {
	struct FMulticastInlineDelegate OnCalloutRegionChanged; // 0xe8(0x10)
	struct TArray<struct AAresCalloutRegion*> OverlappingRegions; // 0xf8(0x10)
	struct AAresCalloutRegion* CurrentRegion; // 0x108(0x08)

	void OnRep_CurrentRegion(struct AAresCalloutRegion* Region); // Function ShooterGame.CalloutRegionTrackingComponent.OnRep_CurrentRegion // (Final|Native|Protected) // @ game+0x385fd20
	struct FText GetCurrentCalloutRegionName(); // Function ShooterGame.CalloutRegionTrackingComponent.GetCurrentCalloutRegionName // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x385f690
	struct AAresCalloutRegion* GetCurrentCalloutRegion(); // Function ShooterGame.CalloutRegionTrackingComponent.GetCurrentCalloutRegion // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x385f660
	struct UCalloutRegionTrackingComponent* GetCalloutRegionTrackingComponent(struct AActor* Actor); // Function ShooterGame.CalloutRegionTrackingComponent.GetCalloutRegionTrackingComponent // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x385f4b0
};

// Class ShooterGame.AresCalloutVolume
// Size: 0x3f8 (Inherited: 0x3b8)
struct AAresCalloutVolume : AActor {
	struct UStaticMeshComponent* VolumeMesh; // 0x3b8(0x08)
	struct UBoxComponent* OverlapBox; // 0x3c0(0x08)
	struct FString CalloutRegion; // 0x3c8(0x10)
	struct FString CalloutSubRegion; // 0x3d8(0x10)
	char pad_3E8[0x10]; // 0x3e8(0x10)

	void Tick(float DeltaSeconds); // Function ShooterGame.AresCalloutVolume.Tick // (Native|Public) // @ game+0x38603b0
	struct FString GetSubRegion(); // Function ShooterGame.AresCalloutVolume.GetSubRegion // (Final|Native|Public|Const) // @ game+0x385f9d0
	struct FString GetRegion(); // Function ShooterGame.AresCalloutVolume.GetRegion // (Final|Native|Public|Const) // @ game+0x385f990
	struct TArray<struct AAresCalloutVolume*> FindOverlappingVolumes(struct AActor* Actor, bool bStopSearchOnFirstHit); // Function ShooterGame.AresCalloutVolume.FindOverlappingVolumes // (Final|Native|Static|Public) // @ game+0x385f1d0
};

// Class ShooterGame.AresCeremony
// Size: 0x3b8 (Inherited: 0x3b8)
struct AAresCeremony : AInfo {

	bool ShouldDisplayCeremony(struct FAresCeremonyDecisionContext& DecisionContext); // Function ShooterGame.AresCeremony.ShouldDisplayCeremony // (Native|Event|Public|HasOutParms|BlueprintEvent) // @ game+0x3860280
	void AuthCheatSetCeremonyDisplayed(bool bShouldDisplay); // Function ShooterGame.AresCeremony.AuthCheatSetCeremonyDisplayed // (Native|Event|Public|BlueprintEvent) // @ game+0x2a99a10
};

// Class ShooterGame.AresCeremonyComponent
// Size: 0x138 (Inherited: 0xe8)
struct UAresCeremonyComponent : UActorComponent {
	struct TArray<struct AAresCeremony*> RegisteredCeremonies; // 0xe8(0x10)
	struct TArray<struct AAresCeremony*> PrioritySortedCeremonies; // 0xf8(0x10)
	struct TArray<struct FAresCeremonyTriggerEvent> CeremonyTriggerEvents; // 0x108(0x10)
	char pad_118[0x20]; // 0x118(0x20)

	void ResetRoundTrackers(); // Function ShooterGame.AresCeremonyComponent.ResetRoundTrackers // (Final|Native|Private) // @ game+0x38601d0
	void RecordRespawn(struct APawn* RespawnedPawn); // Function ShooterGame.AresCeremonyComponent.RecordRespawn // (Final|Native|Public) // @ game+0x3802110
	void RecordKill(struct AOwnerExclusivePlayerInfo* KillerPlayerInfo, struct AOwnerExclusivePlayerInfo* VictimPlayerInfo, struct APawn* KilledPawn, struct UDamageResponse* Response, struct TArray<struct FAresAssist>& AssistList, struct UDamageType* DamageType); // Function ShooterGame.AresCeremonyComponent.RecordKill // (Final|Native|Public|HasOutParms) // @ game+0x385ffd0
	void OnRoundWin(struct UBaseTeamComponent* WinningTeam, enum class EAresRoundOutcome RoundResult); // Function ShooterGame.AresCeremonyComponent.OnRoundWin // (Final|Native|Public) // @ game+0x385fe40
	void OnRoundEnd(int32_t RoundNumberEnding); // Function ShooterGame.AresCeremonyComponent.OnRoundEnd // (Final|Native|Public) // @ game+0x385fdb0
	void OnPhaseTransition(enum class EAresGamePhase NewGamePhase); // Function ShooterGame.AresCeremonyComponent.OnPhaseTransition // (Final|Native|Public) // @ game+0x385fca0
	void GetCeremonyToDisplay(struct AShooterGameState* ShooterGameState); // Function ShooterGame.AresCeremonyComponent.GetCeremonyToDisplay // (Final|Native|Private) // @ game+0x385f540
	struct TArray<struct FAresCeremonyTriggerEvent> GetAllCeremonyTriggerEventsForCurrentRound(); // Function ShooterGame.AresCeremonyComponent.GetAllCeremonyTriggerEventsForCurrentRound // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x385f2e0
	void AuthRegisterCeremonies(); // Function ShooterGame.AresCeremonyComponent.AuthRegisterCeremonies // (Final|Native|Public) // @ game+0x2118460
	void AuthClearCeremonyTriggerEvents(); // Function ShooterGame.AresCeremonyComponent.AuthClearCeremonyTriggerEvents // (Final|Native|Public) // @ game+0x2118460
	void AuthAddCeremonyTriggerEvent(struct FAresCeremonyTriggerEvent& CeremonyKillEvent); // Function ShooterGame.AresCeremonyComponent.AuthAddCeremonyTriggerEvent // (Final|Native|Public|HasOutParms) // @ game+0x385f090
};

// Class ShooterGame.CharacterAbilityUIData
// Size: 0xd8 (Inherited: 0x90)
struct UCharacterAbilityUIData : UBaseContentUIData {
	struct FText Description; // 0x90(0x18)
	struct TSoftClassPtr<UObject> StreamedVideo; // 0xa8(0x30)
};

// Class ShooterGame.CharacterRoleUIData
// Size: 0xa8 (Inherited: 0x90)
struct UCharacterRoleUIData : UBaseContentUIData {
	struct FText Description; // 0x90(0x18)
};

// Class ShooterGame.CharacterRoleDataAsset
// Size: 0x80 (Inherited: 0x50)
struct UCharacterRoleDataAsset : UAresBasePrimaryDataAsset {
	struct TSoftClassPtr<UObject> UIData; // 0x50(0x30)
};

// Class ShooterGame.CharacterUIData
// Size: 0x1a8 (Inherited: 0x90)
struct UCharacterUIData : UBaseContentUIData {
	struct FText Description; // 0x90(0x18)
	struct UTexture* DisplayIconSmall; // 0xa8(0x08)
	struct UTexture* KillfeedPortrait; // 0xb0(0x08)
	struct UTexture* TopHUDPortrait; // 0xb8(0x08)
	struct FWidgetTransform PortraitRenderTransform; // 0xc0(0x1c)
	char pad_DC[0x4]; // 0xdc(0x04)
	struct TMap<enum class ECharacterAbilitySlot, struct UCharacterAbilityUIData*> Abilities; // 0xe0(0x50)
	struct TArray<struct FText> CharacterTags; // 0x130(0x10)
	struct FName WwiseStateName; // 0x140(0x0c)
	char pad_14C[0x4]; // 0x14c(0x04)
	struct UAkAudioEvent* PickMeVOEvent; // 0x150(0x08)
	struct FLinearColor BackgroundGradientColor1; // 0x158(0x10)
	struct FLinearColor BackgroundGradientColor2; // 0x168(0x10)
	struct FLinearColor BackgroundGradientColor3; // 0x178(0x10)
	struct FLinearColor BackgroundGradientColor4; // 0x188(0x10)
	struct FLinearColor BackgroundAgentTextColor; // 0x198(0x10)
};

// Class ShooterGame.RecruitmentData
// Size: 0x68 (Inherited: 0x30)
struct URecruitmentData : UObject {
	struct FGuid CounterID; // 0x30(0x10)
	struct FGuid MilestoneID; // 0x40(0x10)
	int32_t MilestoneThreshold; // 0x50(0x04)
	char pad_54[0x4]; // 0x54(0x04)
	struct FDateTime StartDate; // 0x58(0x08)
	struct FDateTime EndDate; // 0x60(0x08)
};

// Class ShooterGame.CharacterDataAsset
// Size: 0x1d0 (Inherited: 0x50)
struct UCharacterDataAsset : UAresBasePrimaryDataAsset {
	struct TSoftClassPtr<UObject> Character; // 0x50(0x30)
	struct TSoftClassPtr<UObject> UIData; // 0x80(0x30)
	struct TSoftClassPtr<UObject> Role; // 0xb0(0x30)
	struct TSoftObjectPtr<UTexture2D> FullPortrait; // 0xe0(0x30)
	struct TSoftObjectPtr<UTexture2D> CharacterBackground; // 0x110(0x30)
	bool FullPortraitRightFacing; // 0x140(0x01)
	char pad_141[0x7]; // 0x141(0x07)
	struct TSoftClassPtr<UObject> CharacterSelectFXC; // 0x148(0x30)
	struct FName DeveloperName; // 0x178(0x0c)
	struct FName ShippingName; // 0x184(0x0c)
	struct FDateTime ReleaseDate; // 0x190(0x08)
	bool bIsPlayableCharacter; // 0x198(0x01)
	bool bAvailableForTest; // 0x199(0x01)
	char pad_19A[0x6]; // 0x19a(0x06)
	struct TSoftClassPtr<UObject> RecruitmentData; // 0x1a0(0x30)
};

// Class ShooterGame.CharacterDataAssetOverride
// Size: 0xe0 (Inherited: 0x50)
struct UCharacterDataAssetOverride : UAresBasePrimaryDataAsset {
	struct TSoftClassPtr<UObject> CharacterDataAsset; // 0x50(0x30)
	struct TSoftClassPtr<UObject> CharacterOverride; // 0x80(0x30)
	struct TSoftClassPtr<UObject> UIDataOverride; // 0xb0(0x30)
};

// Class ShooterGame.AresTouchPad
// Size: 0x9f0 (Inherited: 0x960)
struct UAresTouchPad : UAresTouchWidget {
	struct FMulticastInlineDelegate OnPadPressed; // 0x960(0x10)
	struct FMulticastInlineDelegate OnPadReleased; // 0x970(0x10)
	struct FMulticastInlineDelegate OnPadMoved; // 0x980(0x10)
	struct FMulticastInlineDelegate OnPadIndexPressed; // 0x990(0x10)
	struct FMulticastInlineDelegate OnPadIndexReleased; // 0x9a0(0x10)
	struct FMulticastInlineDelegate OnPadIndexMoved; // 0x9b0(0x10)
	struct FMulticastInlineDelegate OnPadXLocationChanged; // 0x9c0(0x10)
	struct FMulticastInlineDelegate OnPadYLocationChanged; // 0x9d0(0x10)
	struct TWeakObjectPtr<struct UAresTouchTrackPadComponent> TouchPadComponent; // 0x9e0(0x08)
	int32_t MaxTouchesAllowed; // 0x9e8(0x04)
	char pad_9EC[0x4]; // 0x9ec(0x04)

	void SetAxisEnabledY(enum class ETouchIndex InTouchIndex, bool InEnabled); // Function ShooterGame.AresTouchPad.SetAxisEnabledY // (Final|Native|Public|BlueprintCallable) // @ game+0x397cc00
	void SetAxisEnabledX(enum class ETouchIndex InTouchIndex, bool InEnabled); // Function ShooterGame.AresTouchPad.SetAxisEnabledX // (Final|Native|Public|BlueprintCallable) // @ game+0x397cb30
	void OnTouchPadYLocationChanged(float YDelta, float UnmodifiedYDelta); // Function ShooterGame.AresTouchPad.OnTouchPadYLocationChanged // (Native|Protected) // @ game+0x397c9c0
	void OnTouchPadXLocationChanged(float XDelta, float UnmodifiedXDelta); // Function ShooterGame.AresTouchPad.OnTouchPadXLocationChanged // (Native|Protected) // @ game+0x397c8e0
	void OnTouchPadReleased(enum class ETouchIndex TouchIndex, struct FVector2D Location); // Function ShooterGame.AresTouchPad.OnTouchPadReleased // (Native|Protected|HasDefaults) // @ game+0x3974ed0
	void OnTouchPadPressed(enum class ETouchIndex TouchIndex, struct FVector2D Location); // Function ShooterGame.AresTouchPad.OnTouchPadPressed // (Native|Protected|HasDefaults) // @ game+0x3974850
	void OnTouchPadMoved(enum class ETouchIndex TouchIndex, struct FVector2D Location); // Function ShooterGame.AresTouchPad.OnTouchPadMoved // (Native|Protected|HasDefaults) // @ game+0x3974e00
};

// Class ShooterGame.AresCharacterAimingTouchPad
// Size: 0xa08 (Inherited: 0x9f0)
struct UAresCharacterAimingTouchPad : UAresTouchPad {
	char pad_9F0[0x8]; // 0x9f0(0x08)
	struct TArray<struct UAresHudElement*> DebugHudElementClasses; // 0x9f8(0x10)
};

// Class ShooterGame.AresCharacterHUDMobile
// Size: 0x370 (Inherited: 0x2c8)
struct UAresCharacterHUDMobile : UUserWidget {
	struct TMap<struct FName, struct UWidgetAnimation*> AnimationMap; // 0x2c8(0x50)
	struct TMap<struct FName, struct UWidget*> SlotNameToWidgetInstance; // 0x318(0x50)
	struct UAresTouchScreen* ParentTouchScreen; // 0x368(0x08)

	void PrePresetChange(); // Function ShooterGame.AresCharacterHUDMobile.PrePresetChange // (Final|Native|Protected|BlueprintCallable) // @ game+0x2118460
	void PostPresetChange(); // Function ShooterGame.AresCharacterHUDMobile.PostPresetChange // (Final|Native|Protected|BlueprintCallable) // @ game+0x385ffb0
	void PlayAnimationByName(struct FName& AnimationName); // Function ShooterGame.AresCharacterHUDMobile.PlayAnimationByName // (Final|Native|Public|HasOutParms|BlueprintCallable) // @ game+0x385ff10
	void LoadWidgetLayoutFromSettings(); // Function ShooterGame.AresCharacterHUDMobile.LoadWidgetLayoutFromSettings // (Final|Native|Protected|BlueprintCallable) // @ game+0x385fbb0
	bool IsWidgetInCharacterHUD(struct UUserWidget* Widget); // Function ShooterGame.AresCharacterHUDMobile.IsWidgetInCharacterHUD // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x385fb10
	struct UWidget* GetWidgetBySlotName(struct FName SlotName, struct UWidget* OptionalWidgetClass); // Function ShooterGame.AresCharacterHUDMobile.GetWidgetBySlotName // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x385fa10
	struct TArray<struct UDataTable*> GetDataTablesFromHUDDefinition(); // Function ShooterGame.AresCharacterHUDMobile.GetDataTablesFromHUDDefinition // (Native|Event|Protected|BlueprintEvent) // @ game+0x385f740
	struct UAresCharacterHUDMobile* GetCharacterHUDMobile(struct UObject* WorldContextObject); // Function ShooterGame.AresCharacterHUDMobile.GetCharacterHUDMobile // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x385f5d0
};

// Class ShooterGame.AresCheatAutoCompletePopulator
// Size: 0x50 (Inherited: 0x30)
struct UAresCheatAutoCompletePopulator : UObject {
	struct FSoftObjectPath DevOnlyGunNamesToEquippableDataAssetsDataTable; // 0x30(0x20)

	void GenerateAutoComplete(struct TArray<struct FAutoCompleteCommand>& AutoCompleteList, struct UContentIndex* ContentIndex, struct UConsole* ViewportConsole); // Function ShooterGame.AresCheatAutoCompletePopulator.GenerateAutoComplete // (Final|Native|Public|HasOutParms) // @ game+0x386e480
};

// Class ShooterGame.BasePlayerController
// Size: 0x730 (Inherited: 0x730)
struct ABasePlayerController : APlayerController {

	float GetTimeSinceLastInput(); // Function ShooterGame.BasePlayerController.GetTimeSinceLastInput // (Final|Native|Public|BlueprintCallable) // @ game+0x39bd4b0
	void ApplySettingsCustomizations(); // Function ShooterGame.BasePlayerController.ApplySettingsCustomizations // (Final|Native|Public|BlueprintCallable) // @ game+0x39bd1c0
};

// Class ShooterGame.AresPlayerController
// Size: 0x9d8 (Inherited: 0x730)
struct AAresPlayerController : ABasePlayerController {
	char pad_730[0x10]; // 0x730(0x10)
	struct FMulticastInlineDelegate OnScreenTransitionUpdated; // 0x740(0x10)
	struct FMulticastInlineDelegate OnScoreboardVisibleUpdated; // 0x750(0x10)
	struct FMulticastInlineDelegate OnShopOpenUpdated; // 0x760(0x10)
	struct FMulticastInlineDelegate OnMegamapOpenUpdated; // 0x770(0x10)
	struct FMulticastInlineDelegate OnAresPlayerStateChanged; // 0x780(0x10)
	char pad_790[0x80]; // 0x790(0x80)
	struct FMulticastInlineDelegate OnPlayerViewTargetModeChanged; // 0x810(0x10)
	struct FMulticastInlineDelegate OnPlayerViewTargetChanged; // 0x820(0x10)
	char pad_830[0x8]; // 0x830(0x08)
	struct FMulticastInlineDelegate OnInputModeChanged; // 0x838(0x10)
	char pad_848[0x18]; // 0x848(0x18)
	struct UAresUIManager* UIManager; // 0x860(0x08)
	struct UAresUIDirector* UIDirector; // 0x868(0x08)
	bool bCreateUIInstancesFromGlobals; // 0x870(0x01)
	char pad_871[0x7]; // 0x871(0x07)
	struct UShooterUICoordinator* UICoordinator; // 0x878(0x08)
	struct UAresMinimapManager* MinimapManager; // 0x880(0x08)
	char pad_888[0x8]; // 0x888(0x08)
	struct AShooterCharacter* CachedShooterCharacter; // 0x890(0x08)
	struct AShooterCamera* CachedShooterCamera; // 0x898(0x08)
	struct UScreenTransitionComponent* ScreenTransitionComponent; // 0x8a0(0x08)
	struct UViewTargetComponent* ViewTargetComponent; // 0x8a8(0x08)
	struct UGamepadInputComponent* GamepadInputComponent; // 0x8b0(0x08)
	struct USpectateInOrderActionComponent* SpectateInOrderActionComponent; // 0x8b8(0x08)
	struct USpectateSpecificActionComponent* SpectateSpecificActionComponent; // 0x8c0(0x08)
	struct UMessageListenerComponent* MessageListenerComponent; // 0x8c8(0x08)
	struct UShooterCharacterMinimapComponent* MapSpectateKeybindComponentClass; // 0x8d0(0x08)
	struct FRateLimiter SpectateRequestRateLimiter; // 0x8d8(0x30)
	char pad_908[0x10]; // 0x908(0x10)
	struct UAresAnalogHandlerComponent* AnalogHandlerComponent; // 0x918(0x08)
	char pad_920[0x18]; // 0x920(0x18)
	struct FString matchID; // 0x938(0x10)
	char pad_948[0x8]; // 0x948(0x08)
	struct UAimToolingComponent* AimToolingComponent; // 0x950(0x08)
	struct UMovementToolingComponent* MovementToolingComponent; // 0x958(0x08)
	struct URemoteClientMovementComponent* RemoteClientMovementComponent; // 0x960(0x08)
	char pad_968[0x70]; // 0x968(0x70)

	void UpdateMapSpectateKeybindVisibility(); // Function ShooterGame.AresPlayerController.UpdateMapSpectateKeybindVisibility // (Final|Native|Public) // @ game+0x390d3b0
	void UnlockFOV(); // Function ShooterGame.AresPlayerController.UnlockFOV // (Final|Native|Public|BlueprintCallable) // @ game+0x390d390
	bool TrySetAresInputModeGameOnly(); // Function ShooterGame.AresPlayerController.TrySetAresInputModeGameOnly // (Final|Native|Public|BlueprintCallable) // @ game+0x390d360
	void TouchSnapReleaseHandler(struct FVector2D WidgetLocation); // Function ShooterGame.AresPlayerController.TouchSnapReleaseHandler // (Final|Native|Public|HasDefaults) // @ game+0x390d2e0
	void TouchSnapFireHandler(struct AShooterCharacter* InCharacter, struct AAresEquippable* Equippable, struct AProjectile* ProjectileClass, int32_t NumProjectiles); // Function ShooterGame.AresPlayerController.TouchSnapFireHandler // (Final|Native|Public|BlueprintCallable) // @ game+0x390d180
	void ToggleShop(); // Function ShooterGame.AresPlayerController.ToggleShop // (Final|Native|Public|BlueprintCallable) // @ game+0x390d160
	void ToggleConsoleCheatsMenu(); // Function ShooterGame.AresPlayerController.ToggleConsoleCheatsMenu // (Final|Native|Private|BlueprintCallable) // @ game+0x2118460
	void StartScreenTransition(struct FName TransitionReason, float MaxDuration); // Function ShooterGame.AresPlayerController.StartScreenTransition // (Final|BlueprintCosmetic|Native|Public|BlueprintCallable) // @ game+0x390d070
	void SimulateInputKey(struct FKey Key, bool bPressed); // Function ShooterGame.AresPlayerController.SimulateInputKey // (Final|Native|Public|BlueprintCallable) // @ game+0x390cf20
	bool ShowCorpsesForPlayer(); // Function ShooterGame.AresPlayerController.ShowCorpsesForPlayer // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x390cef0
	bool ShowColoredMuzzleFlashesForPlayer(); // Function ShooterGame.AresPlayerController.ShowColoredMuzzleFlashesForPlayer // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x390cec0
	void ShowCheatMenuCommandFunc(struct TArray<struct FString>& Args, struct UWorld* World); // Function ShooterGame.AresPlayerController.ShowCheatMenuCommandFunc // (Final|Native|Static|Public|HasOutParms) // @ game+0x390cdb0
	bool ShowBloodForPlayer(); // Function ShooterGame.AresPlayerController.ShowBloodForPlayer // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x390cd80
	void SetTickViewTargetModeEnabled(bool bEnabled); // Function ShooterGame.AresPlayerController.SetTickViewTargetModeEnabled // (Final|Native|Protected|BlueprintCallable) // @ game+0x390ccf0
	void SetOnDemandAimAccelerationSensitivityModifiers(struct FAimAccelerationSensitivityModifiers AimAccelerationSensitivityModifiers); // Function ShooterGame.AresPlayerController.SetOnDemandAimAccelerationSensitivityModifiers // (Final|Native|Public|BlueprintCallable) // @ game+0x390cc60
	void SetMinimapVisibility(enum class EMinimapVisibleReason MinimapVisibleReason, bool Visibility); // Function ShooterGame.AresPlayerController.SetMinimapVisibility // (Final|Native|Public|BlueprintCallable) // @ game+0x390cb90
	void SetMapSpectateKeybindsVisible(bool IsVisible); // Function ShooterGame.AresPlayerController.SetMapSpectateKeybindsVisible // (BlueprintCosmetic|Native|Protected|BlueprintCallable) // @ game+0x390caf0
	void SetMapOpen(bool bOpen); // Function ShooterGame.AresPlayerController.SetMapOpen // (Final|Native|Public|BlueprintCallable) // @ game+0x390ca60
	void SetLockInputMode(bool bIsLocked); // Function ShooterGame.AresPlayerController.SetLockInputMode // (Final|Native|Public|BlueprintCallable) // @ game+0x390c9d0
	void SetInputSimulated(bool bUsingSimulatedInput); // Function ShooterGame.AresPlayerController.SetInputSimulated // (Final|Native|Public|BlueprintCallable) // @ game+0x390c940
	void SetFOV(float F); // Function ShooterGame.AresPlayerController.SetFOV // (Final|Native|Public|BlueprintCallable) // @ game+0x390c8c0
	void SetAresInputMode(bool bIsUIOnly); // Function ShooterGame.AresPlayerController.SetAresInputMode // (Final|Native|Public|BlueprintCallable) // @ game+0x390c830
	void ServerTryActivateModifier(struct UGameModifierComponent* Modifier, struct FString Argument); // Function ShooterGame.AresPlayerController.ServerTryActivateModifier // (Net|NetReliableNative|Event|Public|NetServer) // @ game+0x390c6a0
	void ServerStopRecordingReplay(); // Function ShooterGame.AresPlayerController.ServerStopRecordingReplay // (Net|NetReliableNative|Event|Public|NetServer) // @ game+0x390c670
	void ServerStartRecordingReplay(struct FString RecordingName); // Function ShooterGame.AresPlayerController.ServerStartRecordingReplay // (Net|NetReliableNative|Event|Public|NetServer) // @ game+0x390c5c0
	void ServerSlackMessage(struct FString Channel, struct FString Text, struct FString Icon); // Function ShooterGame.AresPlayerController.ServerSlackMessage // (Net|NetReliableNative|Event|Public|NetServer) // @ game+0x390c450
	void ServerSetPlayerDisassociating(bool NewDisassociating); // Function ShooterGame.AresPlayerController.ServerSetPlayerDisassociating // (Net|NetReliableNative|Event|Public|NetServer|Const) // @ game+0x390c3b0
	void ServerSetBotShootingSkillMultiplier(float Multiplier); // Function ShooterGame.AresPlayerController.ServerSetBotShootingSkillMultiplier // (Net|NetReliableNative|Event|Public|NetServer) // @ game+0x390c320
	void ServerSay(struct FString Msg, int32_t ChatMode); // Function ShooterGame.AresPlayerController.ServerSay // (Net|NetReliableNative|Event|Public|NetServer|NetValidate) // @ game+0x390c180
	void ServerSaveRiotProfiling(); // Function ShooterGame.AresPlayerController.ServerSaveRiotProfiling // (Final|Net|NetReliableNative|Event|Private|NetServer) // @ game+0x390c150
	void ServerOnToggleDetailedProfiling(bool bEnabled); // Function ShooterGame.AresPlayerController.ServerOnToggleDetailedProfiling // (Net|NetReliableNative|Event|Public|NetServer|NetValidate) // @ game+0x390c010
	void ServerNotifyOnClientToggleDetailedProfiling(bool bEnabled); // Function ShooterGame.AresPlayerController.ServerNotifyOnClientToggleDetailedProfiling // (Net|NetReliableNative|Event|Public|NetServer|NetValidate) // @ game+0x390bed0
	void ServerNotifyFinishedLoadingDropInPlayer(struct FUniqueNetIdRepl UniqueId); // Function ShooterGame.AresPlayerController.ServerNotifyFinishedLoadingDropInPlayer // (Net|NetReliableNative|Event|Public|NetServer|Const) // @ game+0x390bdc0
	void ServerConsoleCommand(struct FString Text); // Function ShooterGame.AresPlayerController.ServerConsoleCommand // (Net|NetReliableNative|Event|Public|NetServer) // @ game+0x390bd10
	void ServerCommandFunc(struct TArray<struct FString>& Args, struct UWorld* World); // Function ShooterGame.AresPlayerController.ServerCommandFunc // (Final|Native|Static|Public|HasOutParms) // @ game+0x390bc00
	void ServerBugItWorker(struct FVector TheLocation, struct FRotator TheRotation); // Function ShooterGame.AresPlayerController.ServerBugItWorker // (Net|NetReliableNative|Event|Public|NetServer|HasDefaults) // @ game+0x390bb10
	void ServerBroadcastConsoleCommand(struct FString Text); // Function ShooterGame.AresPlayerController.ServerBroadcastConsoleCommand // (Net|NetReliableNative|Event|Public|NetServer) // @ game+0x390ba60
	void ServerAddRiotProfileInstantMarker(); // Function ShooterGame.AresPlayerController.ServerAddRiotProfileInstantMarker // (Final|Net|NetReliableNative|Event|Private|NetServer) // @ game+0x390ba30
	void ServerAcknowledgeSetControlRotation(); // Function ShooterGame.AresPlayerController.ServerAcknowledgeSetControlRotation // (Net|NetReliableNative|Event|Protected|NetServer) // @ game+0x390ba00
	void ServerAcknowledgeLoadClass(struct FSoftObjectPath Class); // Function ShooterGame.AresPlayerController.ServerAcknowledgeLoadClass // (Net|NetReliableNative|Event|Public|NetServer|HasDefaults) // @ game+0x390b8f0
	bool ScreenTransitionActive(); // Function ShooterGame.AresPlayerController.ScreenTransitionActive // (Final|BlueprintCosmetic|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x390b8c0
	void PCSendServerSerializedData(struct TArray<char> Bytes); // Function ShooterGame.AresPlayerController.PCSendServerSerializedData // (Net|NetReliableNative|Event|Public|NetServer) // @ game+0x390b7e0
	void OnViewTargetModeChanged(struct FViewTargetInfo& Info); // Function ShooterGame.AresPlayerController.OnViewTargetModeChanged // (Final|Native|Public|HasOutParms) // @ game+0x390b730
	void OnViewTargetActorReplicated(struct FViewTargetInfo& Info); // Function ShooterGame.AresPlayerController.OnViewTargetActorReplicated // (Final|Native|Public|HasOutParms) // @ game+0x390b6a0
	void OnToggleInformationalHUD(); // Function ShooterGame.AresPlayerController.OnToggleInformationalHUD // (Final|Native|Public) // @ game+0x390b680
	void OnToggleDetailedProfiling(bool bEnabled, struct AActor* Initiator); // Function ShooterGame.AresPlayerController.OnToggleDetailedProfiling // (Final|Native|Public) // @ game+0x390b5b0
	void OnShowDeveloperMenu(); // Function ShooterGame.AresPlayerController.OnShowDeveloperMenu // (Final|Native|Public) // @ game+0x390b590
	void OnShopOpenStateChanged(bool bIsVisible); // Function ShooterGame.AresPlayerController.OnShopOpenStateChanged // (Final|Native|Public) // @ game+0x390b500
	void OnNoPreloadsInProgress(); // Function ShooterGame.AresPlayerController.OnNoPreloadsInProgress // (Final|Native|Private) // @ game+0x390b4e0
	void OnMinimapKeybindSettingsChange(enum class EAresBoolSettingName SettingName, bool bOldValue, bool bNewValue); // Function ShooterGame.AresPlayerController.OnMinimapKeybindSettingsChange // (Final|Native|Public) // @ game+0x390b3c0
	void OnMegamapOpenStateChanged(bool bIsVisible); // Function ShooterGame.AresPlayerController.OnMegamapOpenStateChanged // (Final|Native|Public) // @ game+0x390b330
	void OnMapToggle(bool bOpen); // Function ShooterGame.AresPlayerController.OnMapToggle // (Event|Public|BlueprintEvent) // @ game+0x4282c30
	void OnGoreSettingChanged(enum class EAresBoolSettingName SettingName, bool OldValue, bool NewValue); // Function ShooterGame.AresPlayerController.OnGoreSettingChanged // (Final|Native|Private) // @ game+0x390b210
	void OnEventScreenTransitionUpdated(bool IsAnyTransitionActive); // Function ShooterGame.AresPlayerController.OnEventScreenTransitionUpdated // (Final|Native|Public) // @ game+0x390b180
	void OnColoredMuzzleFlashesSettingChanged(enum class EAresBoolSettingName SettingName, bool OldValue, bool NewValue); // Function ShooterGame.AresPlayerController.OnColoredMuzzleFlashesSettingChanged // (Final|Native|Private) // @ game+0x390b060
	void OnBotDesiredCharactersReady(); // Function ShooterGame.AresPlayerController.OnBotDesiredCharactersReady // (Final|Native|Private) // @ game+0x390b040
	void OnAlternateMovementUp(); // Function ShooterGame.AresPlayerController.OnAlternateMovementUp // (Final|Native|Public) // @ game+0x390b020
	void OnAlternateMovementDown(); // Function ShooterGame.AresPlayerController.OnAlternateMovementDown // (Final|Native|Public) // @ game+0x390b000
	bool K2_UseShortConnectTimeout(); // Function ShooterGame.AresPlayerController.K2_UseShortConnectTimeout // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x390afb0
	bool IsViewingPlayerState(struct AShooterPlayerState* InPlayerState); // Function ShooterGame.AresPlayerController.IsViewingPlayerState // (Final|Native|Protected|BlueprintCallable|BlueprintPure|Const) // @ game+0x390af10
	bool IsSpectatingShooterCharacter(struct AShooterCharacter* ShooterCharacter); // Function ShooterGame.AresPlayerController.IsSpectatingShooterCharacter // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x390ae70
	bool IsShowHUD(); // Function ShooterGame.AresPlayerController.IsShowHUD // (Final|Native|Public|BlueprintCallable|BlueprintPure) // @ game+0x390ae40
	bool IsShopOpen(); // Function ShooterGame.AresPlayerController.IsShopOpen // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x390ae10
	bool IsMinimapVisible(); // Function ShooterGame.AresPlayerController.IsMinimapVisible // (Final|Native|Public|BlueprintCallable|BlueprintPure) // @ game+0x390adb0
	bool IsMapOpen(); // Function ShooterGame.AresPlayerController.IsMapOpen // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x390ad80
	bool IsInputModeLocked(); // Function ShooterGame.AresPlayerController.IsInputModeLocked // (Final|Native|Public|BlueprintCallable|BlueprintPure) // @ game+0x390ad50
	bool InSpectatorMode(); // Function ShooterGame.AresPlayerController.InSpectatorMode // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x390ac40
	void InsertLogMarker(); // Function ShooterGame.AresPlayerController.InsertLogMarker // (Final|Native|Public) // @ game+0x390ad00
	void InsertClientHitchFromKeybind(); // Function ShooterGame.AresPlayerController.InsertClientHitchFromKeybind // (Final|Native|Protected) // @ game+0x2118460
	void InitMapSpectateKeybindComponentFor(struct AShooterCharacter* InCharacter); // Function ShooterGame.AresPlayerController.InitMapSpectateKeybindComponentFor // (Final|Native|Protected) // @ game+0x390ac70
	bool HasValidUIGlobals(); // Function ShooterGame.AresPlayerController.HasValidUIGlobals // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x390ac10
	void HandleThreadedChatManagerSentInGameMessage(struct FString NewMessage, enum class EChatMode ChatMode); // Function ShooterGame.AresPlayerController.HandleThreadedChatManagerSentInGameMessage // (Native|Protected) // @ game+0x390ab10
	void HandleDisassociateComplete(); // Function ShooterGame.AresPlayerController.HandleDisassociateComplete // (Final|Native|Private) // @ game+0x390aaf0
	struct UAresUIManager* GetUIManager(); // Function ShooterGame.AresPlayerController.GetUIManager // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x390aac0
	struct UAresUIDirector* GetUIDirector(); // Function ShooterGame.AresPlayerController.GetUIDirector // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x390aa90
	struct AShooterCharacter* GetSpectatingShooterCharacter(); // Function ShooterGame.AresPlayerController.GetSpectatingShooterCharacter // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x390aa60
	struct AShooterCharacter* GetSpectatedSpawnedCharacter(); // Function ShooterGame.AresPlayerController.GetSpectatedSpawnedCharacter // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x390aa30
	float GetSmokeOverlay(); // Function ShooterGame.AresPlayerController.GetSmokeOverlay // (Native|Event|Public|BlueprintEvent|Const) // @ game+0x390a9f0
	struct FText GetShortcutActionDisplayNameToSpectate(struct AShooterCharacter* ViewedCharacter); // Function ShooterGame.AresPlayerController.GetShortcutActionDisplayNameToSpectate // (Final|Native|Protected|BlueprintCallable|BlueprintPure|Const) // @ game+0x390a8e0
	struct AShooterCharacter* GetShooterCharacter(); // Function ShooterGame.AresPlayerController.GetShooterCharacter // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x390a8b0
	struct AShooterCamera* GetShooterCamera(); // Function ShooterGame.AresPlayerController.GetShooterCamera // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x390a880
	struct FVector GetPlayerViewVector(); // Function ShooterGame.AresPlayerController.GetPlayerViewVector // (Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const) // @ game+0x390a7c0
	enum class EAresPlayerViewTargetMode GetPlayerViewTargetMode(); // Function ShooterGame.AresPlayerController.GetPlayerViewTargetMode // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x390a790
	struct FRotator GetPlayerViewRotation(); // Function ShooterGame.AresPlayerController.GetPlayerViewRotation // (Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const) // @ game+0x390a750
	void GetPlayerViewPoint(struct FVector& out_Location, struct FRotator& out_Rotation); // Function ShooterGame.AresPlayerController.GetPlayerViewPoint // (Native|Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintPure|Const) // @ game+0x390a660
	struct FVector GetPlayerViewLocation(); // Function ShooterGame.AresPlayerController.GetPlayerViewLocation // (Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const) // @ game+0x390a620
	struct APlayerCameraManager* GetPlayerCameraManager(); // Function ShooterGame.AresPlayerController.GetPlayerCameraManager // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x386f4d0
	struct UAresMinimapManager* GetMinimapManager(); // Function ShooterGame.AresPlayerController.GetMinimapManager // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x390a560
	struct TScriptInterface<IInputMethodInterface> GetInputMethodInterface(); // Function ShooterGame.AresPlayerController.GetInputMethodInterface // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x390a520
	struct AShooterCharacter* GetFirstPersonCharacter(); // Function ShooterGame.AresPlayerController.GetFirstPersonCharacter // (Final|Native|Public) // @ game+0x390a4f0
	struct AAresPlayerStateBase* GetAresPlayerState(); // Function ShooterGame.AresPlayerController.GetAresPlayerState // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x390a280
	void EnablePacketLossKeybindsFunc(struct UWorld* World); // Function ShooterGame.AresPlayerController.EnablePacketLossKeybindsFunc // (Final|Native|Static|Protected) // @ game+0x390a1a0
	void EnableClientHitchKeybindFunc(struct TArray<struct FString>& Args, struct UWorld* World); // Function ShooterGame.AresPlayerController.EnableClientHitchKeybindFunc // (Final|Native|Static|Protected|HasOutParms) // @ game+0x390a090
	void DisconnectPlayerDueToSecurityViolation(); // Function ShooterGame.AresPlayerController.DisconnectPlayerDueToSecurityViolation // (BlueprintAuthorityOnly|Native|Public|BlueprintCallable) // @ game+0x390a060
	void DisconnectFromServer(); // Function ShooterGame.AresPlayerController.DisconnectFromServer // (Final|Native|Public) // @ game+0x390a040
	void DisassociateAndDisconnectFromServer(); // Function ShooterGame.AresPlayerController.DisassociateAndDisconnectFromServer // (Final|Native|Public|BlueprintCallable) // @ game+0x390a020
	void ConsoleBroadcastCommandFunc(struct TArray<struct FString>& Args, struct UWorld* World); // Function ShooterGame.AresPlayerController.ConsoleBroadcastCommandFunc // (Final|Native|Static|Public|HasOutParms) // @ game+0x3909f10
	void CompleteScreenTransition(struct FName TransitionReason); // Function ShooterGame.AresPlayerController.CompleteScreenTransition // (Final|BlueprintCosmetic|Native|Public|BlueprintCallable) // @ game+0x3909e70
	void ClientUpdateVisibility(struct UVisibilityComponent* VisibilityComponent, struct FVector Location, struct FVector_NetQuantizeNormal FacingVector, struct TArray<struct AShooterCharacter*> CharactersWithVision); // Function ShooterGame.AresPlayerController.ClientUpdateVisibility // (Net|Native|Event|Public|HasDefaults|NetClient) // @ game+0x3909cf0
	void ClientUpdateActiveForceModules(struct UForceModuleManagerComponent* ForceModuleManager, struct TArray<struct FNetworkedForceModuleInfo> ServerForceModules); // Function ShooterGame.AresPlayerController.ClientUpdateActiveForceModules // (Net|NetReliableNative|Event|Public|NetClient) // @ game+0x3909c00
	void ClientSyncLifeState(struct AShooterCharacter* CharacterToSync, struct TArray<struct FLifeChangeEvent> DamageSectionStates, bool bDamageableComponentAlive, struct FLifeChangeTimestamp LifeChangeTimestamp); // Function ShooterGame.AresPlayerController.ClientSyncLifeState // (Net|NetReliableNative|Event|Public|NetClient) // @ game+0x3909a60
	void ClientStartOnlineGame(); // Function ShooterGame.AresPlayerController.ClientStartOnlineGame // (Net|NetReliableNative|Event|Public|NetClient) // @ game+0x3909a30
	void ClientSendSystemMessage(struct APlayerState* SourcePlayerState, struct APlayerState* TargetPlayerState, struct FText S, bool bIsLocalMessage); // Function ShooterGame.AresPlayerController.ClientSendSystemMessage // (Net|NetReliableNative|Event|Public|NetClient|BlueprintCallable) // @ game+0x3909880
	void ClientSaveRiotProfiling(); // Function ShooterGame.AresPlayerController.ClientSaveRiotProfiling // (Final|Native|Private|BlueprintCallable) // @ game+0x2118460
	void ClientReceiveRemoteCharacterUpdatesSingleArrayNoAutonomous(struct TArray<struct FRemoteCharacterUpdate> RemoteCharacterUpdates); // Function ShooterGame.AresPlayerController.ClientReceiveRemoteCharacterUpdatesSingleArrayNoAutonomous // (Net|Native|Event|Protected|NetClient) // @ game+0x39097b0
	void ClientReceiveRemoteCharacterUpdatesSingleArray(struct TArray<struct FRemoteCharacterUpdate> RemoteCharacterUpdates, struct FComponentDataStream AutonomousComponentDataStream); // Function ShooterGame.AresPlayerController.ClientReceiveRemoteCharacterUpdatesSingleArray // (Net|Native|Event|Protected|NetClient) // @ game+0x3909680
	void ClientReceiveRemoteCharacterUpdates(struct TArray<struct FRemoteCharacterUpdate> AllyRemoteCharacterUpdates, struct TArray<struct FRemoteCharacterUpdate> EnemyAndNeutralRemoteCharacterUpdates, struct FComponentDataStream AutonomousComponentDataStream); // Function ShooterGame.AresPlayerController.ClientReceiveRemoteCharacterUpdates // (Net|Native|Event|Protected|NetClient) // @ game+0x39094c0
	void ClientOnWinningTeam(struct UBaseTeamComponent* WinningTeam); // Function ShooterGame.AresPlayerController.ClientOnWinningTeam // (Net|NetReliableNative|Event|Public|NetClient) // @ game+0x3909400
	void ClientInternalUnreliableOnScreenDebugMessageWithName(struct FName Identifier, float TimeToDisplay, struct TArray<struct FAresHUDDebugTextLine> Message, enum class EDebugMessagePosition Loc, enum class EDebugMessageOptionFlags OPTIONS); // Function ShooterGame.AresPlayerController.ClientInternalUnreliableOnScreenDebugMessageWithName // (Final|Net|Native|Event|Private|NetClient|Const) // @ game+0x3909210
	void ClientInternalUnreliableOnScreenDebugMessage(uint64_t Identifier, float TimeToDisplay, struct TArray<struct FAresHUDDebugTextLine> Message, enum class EDebugMessagePosition Loc, enum class EDebugMessageOptionFlags OPTIONS); // Function ShooterGame.AresPlayerController.ClientInternalUnreliableOnScreenDebugMessage // (Final|Net|Native|Event|Private|NetClient|Const) // @ game+0x3909030
	void ClientInternalOnScreenDebugMessageWithName(struct FName Identifier, float TimeToDisplay, struct TArray<struct FAresHUDDebugTextLine> Message, enum class EDebugMessagePosition Loc, enum class EDebugMessageOptionFlags OPTIONS); // Function ShooterGame.AresPlayerController.ClientInternalOnScreenDebugMessageWithName // (Final|Net|NetReliableNative|Event|Private|NetClient|Const) // @ game+0x3908e40
	void ClientInternalOnScreenDebugMessage(uint64_t Identifier, float TimeToDisplay, struct TArray<struct FAresHUDDebugTextLine> Message, enum class EDebugMessagePosition Loc, enum class EDebugMessageOptionFlags OPTIONS); // Function ShooterGame.AresPlayerController.ClientInternalOnScreenDebugMessage // (Final|Net|NetReliableNative|Event|Private|NetClient|Const) // @ game+0x3908c60
	void ClientGameStarted(); // Function ShooterGame.AresPlayerController.ClientGameStarted // (Net|NetReliableNative|Event|Public|NetClient) // @ game+0x3908c30
	void ClientGamePhaseEnded(enum class EAresGamePhase OldPhase); // Function ShooterGame.AresPlayerController.ClientGamePhaseEnded // (Net|NetReliableNative|Event|Public|NetClient) // @ game+0x3908ba0
	void ClientGamePhaseBegin(enum class EAresGamePhase NewPhase); // Function ShooterGame.AresPlayerController.ClientGamePhaseBegin // (Net|NetReliableNative|Event|Public|NetClient|NetValidate) // @ game+0x3908a60
	void ClientForceSetControlRotation(struct FRotator NewRotation); // Function ShooterGame.AresPlayerController.ClientForceSetControlRotation // (Net|NetReliableNative|Event|Protected|HasDefaults|NetClient) // @ game+0x39089d0
	void ClientEndOnlineGame(); // Function ShooterGame.AresPlayerController.ClientEndOnlineGame // (Net|NetReliableNative|Event|Public|NetClient) // @ game+0x39088f0
	void ClientDrawDebugSpheres(struct TArray<struct FAresDebugSphereReplicated> DebugSpheres); // Function ShooterGame.AresPlayerController.ClientDrawDebugSpheres // (Net|NetReliableNative|Event|Public|NetClient) // @ game+0x3908840
	void ClientDrawDebugLines(struct TArray<struct FAresDebugLineReplicated> DebugLines); // Function ShooterGame.AresPlayerController.ClientDrawDebugLines // (Net|NetReliableNative|Event|Public|NetClient) // @ game+0x3908790
	void ClientDebugDrawTextOnScreenAndLog(struct FString DrawText, struct FLinearColor DrawColor, float DurationOverride); // Function ShooterGame.AresPlayerController.ClientDebugDrawTextOnScreenAndLog // (Net|NetReliableNative|Event|Public|HasDefaults|NetClient|BlueprintCallable|Const) // @ game+0x3908650
	void ClientDebugDrawTextOnScreen(struct FString DrawText, struct FLinearColor DrawColor, float DurationOverride); // Function ShooterGame.AresPlayerController.ClientDebugDrawTextOnScreen // (Net|NetReliableNative|Event|Public|HasDefaults|NetClient|BlueprintCallable|Const) // @ game+0x3908510
	void ClientConsolePrint(struct FString ConsoleText); // Function ShooterGame.AresPlayerController.ClientConsolePrint // (Net|NetReliableNative|Event|Public|NetClient|BlueprintCallable) // @ game+0x3908460
	void ClientConsoleCommand(struct FString Text, struct APlayerState* RequestingPlayer); // Function ShooterGame.AresPlayerController.ClientConsoleCommand // (Net|NetReliableNative|Event|Public|NetClient) // @ game+0x3908360
	void ClientBeginLoadingDropInPlayer(struct FUniqueNetIdRepl UniqueId, struct FDropInPlayerAssets DropInPlayerAssets); // Function ShooterGame.AresPlayerController.ClientBeginLoadingDropInPlayer // (Net|NetReliableNative|Event|Public|NetClient|Const) // @ game+0x3908180
	bool CanTriggerSpectateShortcuts(); // Function ShooterGame.AresPlayerController.CanTriggerSpectateShortcuts // (Final|Native|Protected|BlueprintCallable|BlueprintPure|Const) // @ game+0x39080a0
	bool CanBeMinimapFocused(); // Function ShooterGame.AresPlayerController.CanBeMinimapFocused // (Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x3908060
	void AuthOverrideControlRotation(struct FRotator NewRotation); // Function ShooterGame.AresPlayerController.AuthOverrideControlRotation // (Final|BlueprintAuthorityOnly|Native|Public|HasDefaults|BlueprintCallable) // @ game+0x3907fd0
	void AuthFindValidSpectateTarget(); // Function ShooterGame.AresPlayerController.AuthFindValidSpectateTarget // (Final|Native|Public) // @ game+0x3907fb0
	void AresGetInputMouseDelta(float& DeltaX, float& DeltaY); // Function ShooterGame.AresPlayerController.AresGetInputMouseDelta // (Native|Public|HasOutParms|BlueprintCallable|BlueprintPure|Const) // @ game+0x3907ec0
	void AddRiotProfileInstantMarker(); // Function ShooterGame.AresPlayerController.AddRiotProfileInstantMarker // (Final|Native|Private|BlueprintCallable) // @ game+0x3907db0
};

// Class ShooterGame.AresCheatManagerBase
// Size: 0x90 (Inherited: 0x90)
struct UAresCheatManagerBase : UCheatManager {

	void ToggleWatermark(); // Function ShooterGame.AresCheatManagerBase.ToggleWatermark // (Final|Exec|Native|Private) // @ game+0x2118460
	struct UUserWidget* CheatGetSecretWidgetClass(struct FString Name); // Function ShooterGame.AresCheatManagerBase.CheatGetSecretWidgetClass // (Final|Native|Private|BlueprintCallable) // @ game+0x386def0
};

// Class ShooterGame.AresCheatManager
// Size: 0x108 (Inherited: 0x90)
struct UAresCheatManager : UAresCheatManagerBase {
	struct UMaterial* GreenScreenMaterial; // 0x90(0x08)
	struct FSoftObjectPath GreenScreenMaterialName; // 0x98(0x20)
	struct TMap<struct UStaticMeshComponent*, struct FStaticMeshMaterialList> StaticMeshToOriginalMaterialsMap; // 0xb8(0x50)

	void ShowUI(int32_t Show); // Function ShooterGame.AresCheatManager.ShowUI // (Final|Exec|Native|Public) // @ game+0x3802860
	void SetClientMuted(int32_t Mute); // Function ShooterGame.AresCheatManager.SetClientMuted // (Final|Exec|Native|Public) // @ game+0x3802860
	void SetBotShootingSkillMultiplier(float Multiplier); // Function ShooterGame.AresCheatManager.SetBotShootingSkillMultiplier // (Final|Exec|Native|Public) // @ game+0x38707e0
	void OnFoWDebugCheatsChanged(enum class EGameFeatureToggleName GameFeatureToggleName, bool bEnabled); // Function ShooterGame.AresCheatManager.OnFoWDebugCheatsChanged // (Final|Native|Public) // @ game+0x385fbd0
	void EnableGreenScreen(bool bEnableGreenScreen, int32_t Red, int32_t Green, int32_t Blue); // Function ShooterGame.AresCheatManager.EnableGreenScreen // (Final|Exec|Native|Public) // @ game+0x386e320
};

// Class ShooterGame.AresClientEvents
// Size: 0x68 (Inherited: 0x30)
struct UAresClientEvents : UObject {
	struct FMulticastInlineDelegate OnBugCommandDelegate; // 0x30(0x10)
	struct FMulticastInlineDelegate OnPlatformUnhealthy; // 0x40(0x10)
	struct FMulticastInlineDelegate OnInitScreenComplete; // 0x50(0x10)
	char pad_60[0x8]; // 0x60(0x08)

	void MarkInitScreenComplete(); // Function ShooterGame.AresClientEvents.MarkInitScreenComplete // (Final|Native|Public|BlueprintCallable) // @ game+0x3870450
};

// Class ShooterGame.AresClientGameInstance
// Size: 0x868 (Inherited: 0x30)
struct UAresClientGameInstance : UAresBaseGameInstance {
	char pad_30[0x18]; // 0x30(0x18)
	struct FString ErrorMessage; // 0x48(0x10)
	struct FMulticastInlineDelegate OnNativePlatformLogin; // 0x58(0x10)
	struct FMulticastInlineDelegate ClientGameInstanceInitStatusChanged; // 0x68(0x10)
	enum class EAresClientGameInstanceInitStatus InitStatus; // 0x78(0x01)
	char pad_79[0x7]; // 0x79(0x07)
	struct FMulticastInlineDelegate OnPatchContentUpToDate; // 0x80(0x10)
	struct FMulticastInlineDelegate OnQuitGameInstance; // 0x90(0x10)
	struct FMulticastInlineDelegate OnRequestDestroyWindow; // 0xa0(0x10)
	bool bDidPlayIntroCinematic; // 0xb0(0x01)
	char pad_B1[0x7]; // 0xb1(0x07)
	struct UCrossWorldUserWidget* PlaytimeManagerWidget; // 0xb8(0x08)
	int32_t PlaytimeWidgetZOrder; // 0xc0(0x04)
	char pad_C4[0x4]; // 0xc4(0x04)
	struct TSoftClassPtr<UObject> GlobalAudioManagerAssetClass; // 0xc8(0x30)
	struct TSoftClassPtr<UObject> PlaytimeManagerWidgetAssetClass; // 0xf8(0x30)
	struct TSoftClassPtr<UObject> LeaveMatchConfirmationClass; // 0x128(0x30)
	struct UAresSettingsManager* AresSettingsManagerClass; // 0x158(0x08)
	struct UActionTraitsManager* ActionTraitsManagerClass; // 0x160(0x08)
	struct UUserWidget* LeaveMatchConfirmationWidget; // 0x168(0x08)
	struct TSoftClassPtr<UObject> InputMethodEditorAssetClass; // 0x170(0x30)
	struct UAresInputMethodEditor* InputMethodEditor; // 0x1a0(0x08)
	struct UPlatformInitializerV2* PlatformInitializer; // 0x1a8(0x08)
	struct UAresWidgetRegistry* WidgetRegistry; // 0x1b0(0x08)
	bool bNoRiotClient; // 0x1b8(0x01)
	char pad_1B9[0x7f]; // 0x1b9(0x7f)
	struct UAresGameInstance* MyGameInstance; // 0x238(0x08)
	struct FAllInitSystems Systems; // 0x240(0x488)
	bool RiotLoggedIn; // 0x6c8(0x01)
	char pad_6C9[0xf]; // 0x6c9(0x0f)
	bool bPatchFiles; // 0x6d8(0x01)
	bool bPendingLogoutOnExit; // 0x6d9(0x01)
	bool UserPatchConfirmed; // 0x6da(0x01)
	char pad_6DB[0xd]; // 0x6db(0x0d)
	struct FSoftObjectPath SoftResetMap; // 0x6e8(0x20)
	struct UUpdateManager* UpdateManager; // 0x708(0x08)
	char pad_710[0x8]; // 0x710(0x08)
	struct FGameClientInstanceInfo ClientInstanceInfo; // 0x718(0x150)

	bool UseLoginWithField(); // Function ShooterGame.AresClientGameInstance.UseLoginWithField // (Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x38709d0
	void UpdatePatchStatus(); // Function ShooterGame.AresClientGameInstance.UpdatePatchStatus // (Native|Protected) // @ game+0x38709a0
	void UpdateInitStatus(); // Function ShooterGame.AresClientGameInstance.UpdateInitStatus // (Final|Native|Private) // @ game+0x3870980
	void TriggerVanguardBanNotification(struct FString Subject); // Function ShooterGame.AresClientGameInstance.TriggerVanguardBanNotification // (Final|Native|Public|BlueprintCallable) // @ game+0x38708d0
	void StartPatchDownload(); // Function ShooterGame.AresClientGameInstance.StartPatchDownload // (Final|Native|Public|BlueprintCallable) // @ game+0x38708b0
	bool ShouldAllowLeaveMatch(); // Function ShooterGame.AresClientGameInstance.ShouldAllowLeaveMatch // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x3870880
	void SetupRequestDestroyWindowOverride(); // Function ShooterGame.AresClientGameInstance.SetupRequestDestroyWindowOverride // (Final|Native|Private) // @ game+0x3870860
	bool RiotLogin(struct FString Username, struct FString Password); // Function ShooterGame.AresClientGameInstance.RiotLogin // (Final|Native|Public|BlueprintCallable) // @ game+0x38706c0
	bool RequestSystemRestart(struct FText& Reason); // Function ShooterGame.AresClientGameInstance.RequestSystemRestart // (Final|Native|Public|HasOutParms|BlueprintCallable|BlueprintPure|Const) // @ game+0x38705d0
	void QueueSoftResetOnNextTick(enum class ESoftResetReason Reason); // Function ShooterGame.AresClientGameInstance.QueueSoftResetOnNextTick // (Final|Native|Public) // @ game+0x3870540
	void PostTelemetryConsoleStartupTime(); // Function ShooterGame.AresClientGameInstance.PostTelemetryConsoleStartupTime // (Final|Native|Private) // @ game+0x2118460
	bool PatchFailed(); // Function ShooterGame.AresClientGameInstance.PatchFailed // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x3870510
	void OnSoftResetModalConfirm(struct FGuid& ModalID); // Function ShooterGame.AresClientGameInstance.OnSoftResetModalConfirm // (Final|Native|Private|HasOutParms|HasDefaults) // @ game+0x3870470
	bool IsRiotSDKAvailable(); // Function ShooterGame.AresClientGameInstance.IsRiotSDKAvailable // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x3870420
	bool IsPlatformFaulted(); // Function ShooterGame.AresClientGameInstance.IsPlatformFaulted // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x38703f0
	bool IsPatchUpToDate(); // Function ShooterGame.AresClientGameInstance.IsPatchUpToDate // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x38703c0
	bool IsLoggedIn(); // Function ShooterGame.AresClientGameInstance.IsLoggedIn // (Native|Public|BlueprintCallable) // @ game+0x3870380
	bool IsInProvisioningFlow(enum class EProvisioningFlowID ExpectedProvisioningFlow); // Function ShooterGame.AresClientGameInstance.IsInProvisioningFlow // (Final|Native|Public|Const) // @ game+0x38702c0
	bool IsInPregame(); // Function ShooterGame.AresClientGameInstance.IsInPregame // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x3870290
	bool IsInMatchmadeGame(); // Function ShooterGame.AresClientGameInstance.IsInMatchmadeGame // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x3870260
	bool IsInitialized(); // Function ShooterGame.AresClientGameInstance.IsInitialized // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x3870350
	bool IsInCustomGame(); // Function ShooterGame.AresClientGameInstance.IsInCustomGame // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x3870230
	bool IsDirectConnectAllowed(); // Function ShooterGame.AresClientGameInstance.IsDirectConnectAllowed // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x3870200
	void InitiateRiotLogin(enum class ERiotLoginStrategy LoginStrategy); // Function ShooterGame.AresClientGameInstance.InitiateRiotLogin // (Native|Public|BlueprintCallable) // @ game+0x3870170
	void HandleRNetHealthChange(); // Function ShooterGame.AresClientGameInstance.HandleRNetHealthChange // (Final|Native|Private) // @ game+0x3870150
	void HandlePlatformInitStatusChanged(enum class EAresPlatformInitStatus Status); // Function ShooterGame.AresClientGameInstance.HandlePlatformInitStatusChanged // (Final|Native|Public) // @ game+0x38700d0
	void HandlePlatformFault(enum class EPlatformFaultReason& Reason); // Function ShooterGame.AresClientGameInstance.HandlePlatformFault // (Final|Native|Protected|HasOutParms) // @ game+0x3870040
	struct UAresWidgetRegistry* GetWidgetRegistry(); // Function ShooterGame.AresClientGameInstance.GetWidgetRegistry // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x3870020
	struct UWhisperChatManager* GetWhisperChatManager(); // Function ShooterGame.AresClientGameInstance.GetWhisperChatManager // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x3822ba0
	struct UAresWatermarkManager* GetWatermarkManager(); // Function ShooterGame.AresClientGameInstance.GetWatermarkManager // (Final|Native|Public|Const) // @ game+0x386fff0
	struct UVoiceViewController* GetVoiceViewController(); // Function ShooterGame.AresClientGameInstance.GetVoiceViewController // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x386ffc0
	struct UVoiceRoomManager* GetVoiceRoomManager(); // Function ShooterGame.AresClientGameInstance.GetVoiceRoomManager // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x386ff90
	struct UVoicePreferencesManager* GetVoicePreferencesManager(); // Function ShooterGame.AresClientGameInstance.GetVoicePreferencesManager // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x386ff60
	struct UVoiceModel* GetVoiceModel(); // Function ShooterGame.AresClientGameInstance.GetVoiceModel // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x386ff30
	struct URNetVoiceManager* GetVoiceManager(); // Function ShooterGame.AresClientGameInstance.GetVoiceManager // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x386ff00
	struct UVNGManager* GetVNGManager(); // Function ShooterGame.AresClientGameInstance.GetVNGManager // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x386fdf0
	struct UVanguardManager* GetVanguardManager(); // Function ShooterGame.AresClientGameInstance.GetVanguardManager // (Final|Native|Public|Const) // @ game+0x386fed0
	struct FString GetVanguardIncompatibleSoftware(); // Function ShooterGame.AresClientGameInstance.GetVanguardIncompatibleSoftware // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x386fe50
	int32_t GetVanguardErrorCode(); // Function ShooterGame.AresClientGameInstance.GetVanguardErrorCode // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x386fe20
	struct UUITelemetryManager* GetUITelemetryManager(); // Function ShooterGame.AresClientGameInstance.GetUITelemetryManager // (Final|Native|Public|Const) // @ game+0x386fdc0
	struct UUINavigationManager* GetUINavigationManager(); // Function ShooterGame.AresClientGameInstance.GetUINavigationManager // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x386fd90
	struct UTutorialManager* GetTutorialManager(); // Function ShooterGame.AresClientGameInstance.GetTutorialManager // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x386fd60
	struct UTravelManager* GetTravelManager(); // Function ShooterGame.AresClientGameInstance.GetTravelManager // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x386fd30
	struct UTransitionModelManager* GetTransitionModelManager(); // Function ShooterGame.AresClientGameInstance.GetTransitionModelManager // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x386fd00
	struct UTournamentsManager* GetTournamentsManager(); // Function ShooterGame.AresClientGameInstance.GetTournamentsManager // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x386fcd0
	float GetTimeSinceLastInput(); // Function ShooterGame.AresClientGameInstance.GetTimeSinceLastInput // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x386fca0
	struct UThreadedChatManager* GetThreadedChatManager(); // Function ShooterGame.AresClientGameInstance.GetThreadedChatManager // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x256a070
	struct UTextChatManagerV2* GetTextChatManager(); // Function ShooterGame.AresClientGameInstance.GetTextChatManager // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x386fc70
	struct UStoreViewControllerV2* GetStoreViewController(); // Function ShooterGame.AresClientGameInstance.GetStoreViewController // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x386fc40
	struct UStoreUITelemetryManager* GetStoreUITelemetryManager(); // Function ShooterGame.AresClientGameInstance.GetStoreUITelemetryManager // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x386fc10
	struct UStoreManager* GetStoreManager(); // Function ShooterGame.AresClientGameInstance.GetStoreManager // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x386fbe0
